[Killed] BlockStatement
components/entities/chart/chart-data.ts:41:16
   startTime: string | undefined,
   endTime: string | undefined,
   layer: FetchWindowInput,
-): FetchWindow {
-  let computedStartTime = startTime || layer.startTime;
-  let computedEndTime = endTime || layer.endTime;
-
-  if (typeof layer.windowBuffer === "number") {
-    const newStartTimeDate = new Date(computedStartTime);
-    newStartTimeDate.setDate(newStartTimeDate.getDate() - 1);
-    computedStartTime = newStartTimeDate.toISOString();
-
-    const newEndTimeDate = new Date(computedEndTime);
-    newEndTimeDate.setDate(newEndTimeDate.getDate() + 1);
-    computedEndTime = newEndTimeDate.toISOString();
-  }
-
-  const durationSeconds =
-    (new Date(computedEndTime).getTime() -
-      new Date(computedStartTime).getTime()) /
-    1000;
-
-  return {
-    startTime: computedStartTime,
-    endTime: computedEndTime,
-    durationSeconds,
-  };
-}
+): FetchWindow {}
 
 /** The subset of `Product` needed to choose a downsampling factor. */
killedBy: computeFetchWindow uses explicit times over the layer's own times
statusReason: Cannot read properties of undefined (reading 'startTime')

[Killed] ConditionalExpression
components/entities/chart/chart-data.ts:42:27
   endTime: string | undefined,
   layer: FetchWindowInput,
 ): FetchWindow {
-  let computedStartTime = startTime || layer.startTime;
+  let computedStartTime = true;
   let computedEndTime = endTime || layer.endTime;
 
killedBy: computeFetchWindow uses explicit times over the layer's own times
statusReason: expected true to be '2020-03-01T00:00:00.000Z' // Object.is equality

[Killed] ConditionalExpression
components/entities/chart/chart-data.ts:42:27
   endTime: string | undefined,
   layer: FetchWindowInput,
 ): FetchWindow {
-  let computedStartTime = startTime || layer.startTime;
+  let computedStartTime = false;
   let computedEndTime = endTime || layer.endTime;
 
killedBy: computeFetchWindow uses explicit times over the layer's own times
statusReason: expected false to be '2020-03-01T00:00:00.000Z' // Object.is equality

[Killed] ConditionalExpression
components/entities/chart/chart-data.ts:43:25
   layer: FetchWindowInput,
 ): FetchWindow {
   let computedStartTime = startTime || layer.startTime;
-  let computedEndTime = endTime || layer.endTime;
+  let computedEndTime = false;
 
   if (typeof layer.windowBuffer === "number") {
killedBy: computeFetchWindow uses explicit times over the layer's own times
statusReason: expected false to be '2020-03-02T00:00:00.000Z' // Object.is equality

[Killed] LogicalOperator
components/entities/chart/chart-data.ts:43:25
   layer: FetchWindowInput,
 ): FetchWindow {
   let computedStartTime = startTime || layer.startTime;
-  let computedEndTime = endTime || layer.endTime;
+  let computedEndTime = endTime && layer.endTime;
 
   if (typeof layer.windowBuffer === "number") {
killedBy: computeFetchWindow uses explicit times over the layer's own times
statusReason: expected 'ignored-end' to be '2020-03-02T00:00:00.000Z' // Object.is equality

[Killed] ConditionalExpression
components/entities/chart/chart-data.ts:45:7
   let computedStartTime = startTime || layer.startTime;
   let computedEndTime = endTime || layer.endTime;
 
-  if (typeof layer.windowBuffer === "number") {
+  if (false) {
     const newStartTimeDate = new Date(computedStartTime);
     newStartTimeDate.setDate(newStartTimeDate.getDate() - 1);
killedBy: computeFetchWindow pads the window by one day per side when windowBuffer is numeric
statusReason: expected '2020-01-10T00:00:00.000Z' to be '2020-01-09T00:00:00.000Z' // Object.is equality

[Killed] ConditionalExpression
components/entities/chart/chart-data.ts:45:7
   let computedStartTime = startTime || layer.startTime;
   let computedEndTime = endTime || layer.endTime;
 
-  if (typeof layer.windowBuffer === "number") {
+  if (true) {
     const newStartTimeDate = new Date(computedStartTime);
     newStartTimeDate.setDate(newStartTimeDate.getDate() - 1);
killedBy: computeFetchWindow uses explicit times over the layer's own times
statusReason: expected '2020-02-29T00:00:00.000Z' to be '2020-03-01T00:00:00.000Z' // Object.is equality

[Killed] ArithmeticOperator
components/entities/chart/chart-data.ts:47:30
 
   if (typeof layer.windowBuffer === "number") {
     const newStartTimeDate = new Date(computedStartTime);
-    newStartTimeDate.setDate(newStartTimeDate.getDate() - 1);
+    newStartTimeDate.setDate(newStartTimeDate.getDate() + 1);
     computedStartTime = newStartTimeDate.toISOString();
 
killedBy: computeFetchWindow pads the window by one day per side when windowBuffer is numeric
statusReason: expected '2020-01-11T00:00:00.000Z' to be '2020-01-09T00:00:00.000Z' // Object.is equality

[Killed] MethodExpression
components/entities/chart/chart-data.ts:47:5
 
   if (typeof layer.windowBuffer === "number") {
     const newStartTimeDate = new Date(computedStartTime);
-    newStartTimeDate.setDate(newStartTimeDate.getDate() - 1);
+    newStartTimeDate.setTime(newStartTimeDate.getDate() - 1);
     computedStartTime = newStartTimeDate.toISOString();
 
killedBy: computeFetchWindow pads the window by one day per side when windowBuffer is numeric
statusReason: expected '1970-01-01T00:00:00.009Z' to be '2020-01-09T00:00:00.000Z' // Object.is equality

[Killed] MethodExpression
components/entities/chart/chart-data.ts:51:5
     computedStartTime = newStartTimeDate.toISOString();
 
     const newEndTimeDate = new Date(computedEndTime);
-    newEndTimeDate.setDate(newEndTimeDate.getDate() + 1);
+    newEndTimeDate.setTime(newEndTimeDate.getDate() + 1);
     computedEndTime = newEndTimeDate.toISOString();
   }
killedBy: computeFetchWindow pads the window by one day per side when windowBuffer is numeric
statusReason: expected '1970-01-01T00:00:00.011Z' to be '2020-01-11T00:00:00.000Z' // Object.is equality

[Killed] ArithmeticOperator
components/entities/chart/chart-data.ts:51:28
     computedStartTime = newStartTimeDate.toISOString();
 
     const newEndTimeDate = new Date(computedEndTime);
-    newEndTimeDate.setDate(newEndTimeDate.getDate() + 1);
+    newEndTimeDate.setDate(newEndTimeDate.getDate() - 1);
     computedEndTime = newEndTimeDate.toISOString();
   }
killedBy: computeFetchWindow pads the window by one day per side when windowBuffer is numeric
statusReason: expected '2020-01-09T00:00:00.000Z' to be '2020-01-11T00:00:00.000Z' // Object.is equality

[Killed] ArithmeticOperator
components/entities/chart/chart-data.ts:56:5
   }
 
   const durationSeconds =
-    (new Date(computedEndTime).getTime() -
-      new Date(computedStartTime).getTime()) /
-    1000;
+    (new Date(computedEndTime).getTime() - new Date(computedStartTime).getTime()) * 1000;
 
   return {
killedBy: computeFetchWindow uses explicit times over the layer's own times
statusReason: expected 86400000000 to be 86400 // Object.is equality

[Killed] ArithmeticOperator
components/entities/chart/chart-data.ts:56:6
   }
 
   const durationSeconds =
-    (new Date(computedEndTime).getTime() -
-      new Date(computedStartTime).getTime()) /
+    (new Date(computedEndTime).getTime() + new Date(computedStartTime).getTime()) /
     1000;
 
killedBy: computeFetchWindow uses explicit times over the layer's own times
statusReason: expected 3166128000 to be 86400 // Object.is equality

[Killed] ObjectLiteral
components/entities/chart/chart-data.ts:60:10
       new Date(computedStartTime).getTime()) /
     1000;
 
-  return {
-    startTime: computedStartTime,
-    endTime: computedEndTime,
-    durationSeconds,
-  };
+  return {};
 }
 
killedBy: computeFetchWindow uses explicit times over the layer's own times
statusReason: expected undefined to be '2020-03-01T00:00:00.000Z' // Object.is equality

[Killed] BlockStatement
components/entities/chart/chart-data.ts:82:11
   product: DownsamplingProduct | null | undefined,
   durationSeconds: number,
   chartSize: number,
-): number {
-  let downsamplingFactor = 1;
-  if (product) {
-    for (let i = 0; i < product.available_resolutions.length; i++) {
-      const resolution = product.available_resolutions[i];
-      const nextResolution = product.available_resolutions[i + 1];
-      const pointsForDuration =
-        durationSeconds / resolution.nominal_data_interval_seconds;
-      const nextPointsForDuration = nextResolution
-        ? durationSeconds / nextResolution.nominal_data_interval_seconds
-        : null;
-      if (
-        pointsForDuration > chartSize &&
-        (nextPointsForDuration == null || nextPointsForDuration < chartSize)
-      ) {
-        downsamplingFactor = resolution.downsampling_factor;
-        break;
-      }
-    }
-  }
-  return downsamplingFactor;
-}
+): number {}
 
 export type ResolvedFetchFields = {
killedBy: computeDownsamplingFactor returns 1 with no product
statusReason: expected undefined to be 1 // Object.is equality

[Killed] ConditionalExpression
components/entities/chart/chart-data.ts:84:7
   chartSize: number,
 ): number {
   let downsamplingFactor = 1;
-  if (product) {
+  if (true) {
     for (let i = 0; i < product.available_resolutions.length; i++) {
       const resolution = product.available_resolutions[i];
killedBy: computeDownsamplingFactor returns 1 with no product
statusReason: Cannot read properties of null (reading 'available_resolutions')

[Killed] ConditionalExpression
components/entities/chart/chart-data.ts:84:7
   chartSize: number,
 ): number {
   let downsamplingFactor = 1;
-  if (product) {
+  if (false) {
     for (let i = 0; i < product.available_resolutions.length; i++) {
       const resolution = product.available_resolutions[i];
killedBy: computeDownsamplingFactor selects the resolution whose next step drops below the chart width
statusReason: expected 1 to be 10 // Object.is equality

[Killed] BlockStatement
components/entities/chart/chart-data.ts:85:68
 ): number {
   let downsamplingFactor = 1;
   if (product) {
-    for (let i = 0; i < product.available_resolutions.length; i++) {
-      const resolution = product.available_resolutions[i];
-      const nextResolution = product.available_resolutions[i + 1];
-      const pointsForDuration =
-        durationSeconds / resolution.nominal_data_interval_seconds;
-      const nextPointsForDuration = nextResolution
-        ? durationSeconds / nextResolution.nominal_data_interval_seconds
-        : null;
-      if (
-        pointsForDuration > chartSize &&
-        (nextPointsForDuration == null || nextPointsForDuration < chartSize)
-      ) {
-        downsamplingFactor = resolution.downsampling_factor;
-        break;
-      }
-    }
+    for (let i = 0; i < product.available_resolutions.length; i++) {}
   }
   return downsamplingFactor;
killedBy: computeDownsamplingFactor selects the resolution whose next step drops below the chart width
statusReason: expected 1 to be 10 // Object.is equality

[Killed] EqualityOperator
components/entities/chart/chart-data.ts:85:21
 ): number {
   let downsamplingFactor = 1;
   if (product) {
-    for (let i = 0; i < product.available_resolutions.length; i++) {
+    for (let i = 0; i <= product.available_resolutions.length; i++) {
       const resolution = product.available_resolutions[i];
       const nextResolution = product.available_resolutions[i + 1];
killedBy: computeDownsamplingFactor returns 1 with no product
statusReason: Cannot read properties of undefined (reading 'nominal_data_interval_seconds')

[Killed] ArithmeticOperator
components/entities/chart/chart-data.ts:87:60
   if (product) {
     for (let i = 0; i < product.available_resolutions.length; i++) {
       const resolution = product.available_resolutions[i];
-      const nextResolution = product.available_resolutions[i + 1];
+      const nextResolution = product.available_resolutions[i - 1];
       const pointsForDuration =
         durationSeconds / resolution.nominal_data_interval_seconds;
killedBy: computeDownsamplingFactor selects the resolution whose next step drops below the chart width
statusReason: expected 1 to be 10 // Object.is equality

[Killed] ArithmeticOperator
components/entities/chart/chart-data.ts:89:9
       const resolution = product.available_resolutions[i];
       const nextResolution = product.available_resolutions[i + 1];
       const pointsForDuration =
-        durationSeconds / resolution.nominal_data_interval_seconds;
+        durationSeconds * resolution.nominal_data_interval_seconds;
       const nextPointsForDuration = nextResolution
         ? durationSeconds / nextResolution.nominal_data_interval_seconds
killedBy: computeDownsamplingFactor returns 1 when no resolution exceeds the chart width
statusReason: expected 10 to be 1 // Object.is equality

[Killed] ArithmeticOperator
components/entities/chart/chart-data.ts:91:11
       const pointsForDuration =
         durationSeconds / resolution.nominal_data_interval_seconds;
       const nextPointsForDuration = nextResolution
-        ? durationSeconds / nextResolution.nominal_data_interval_seconds
+        ? durationSeconds * nextResolution.nominal_data_interval_seconds
         : null;
       if (
killedBy: computeDownsamplingFactor selects the resolution whose next step drops below the chart width
statusReason: expected 1 to be 10 // Object.is equality

[Killed] ConditionalExpression
components/entities/chart/chart-data.ts:94:9
         ? durationSeconds / nextResolution.nominal_data_interval_seconds
         : null;
       if (
-        pointsForDuration > chartSize &&
-        (nextPointsForDuration == null || nextPointsForDuration < chartSize)
+        false
       ) {
         downsamplingFactor = resolution.downsampling_factor;
killedBy: computeDownsamplingFactor selects the resolution whose next step drops below the chart width
statusReason: expected 1 to be 10 // Object.is equality

[Killed] EqualityOperator
components/entities/chart/chart-data.ts:94:9
         ? durationSeconds / nextResolution.nominal_data_interval_seconds
         : null;
       if (
-        pointsForDuration > chartSize &&
+        pointsForDuration >= chartSize &&
         (nextPointsForDuration == null || nextPointsForDuration < chartSize)
       ) {
killedBy: computeDownsamplingFactor uses a strict > against the chart width
statusReason: expected 7 to be 1 // Object.is equality

[Killed] EqualityOperator
components/entities/chart/chart-data.ts:95:10
         : null;
       if (
         pointsForDuration > chartSize &&
-        (nextPointsForDuration == null || nextPointsForDuration < chartSize)
+        (nextPointsForDuration != null || nextPointsForDuration < chartSize)
       ) {
         downsamplingFactor = resolution.downsampling_factor;
killedBy: computeDownsamplingFactor selects the resolution whose next step drops below the chart width
statusReason: expected 1 to be 10 // Object.is equality

[Killed] ConditionalExpression
components/entities/chart/chart-data.ts:95:10
         : null;
       if (
         pointsForDuration > chartSize &&
-        (nextPointsForDuration == null || nextPointsForDuration < chartSize)
+        (false || nextPointsForDuration < chartSize)
       ) {
         downsamplingFactor = resolution.downsampling_factor;
killedBy: computeDownsamplingFactor picks the coarsest resolution for a zero-width chart
statusReason: expected 1 to be 100 // Object.is equality

[Killed] BlockStatement
components/entities/chart/chart-data.ts:96:9
       if (
         pointsForDuration > chartSize &&
         (nextPointsForDuration == null || nextPointsForDuration < chartSize)
-      ) {
-        downsamplingFactor = resolution.downsampling_factor;
-        break;
-      }
+      ) {}
     }
   }
killedBy: computeDownsamplingFactor selects the resolution whose next step drops below the chart width
statusReason: expected 1 to be 10 // Object.is equality

[Killed] BlockStatement
components/entities/chart/chart-data.ts:115:76
  * layers backed by a product that carries `subset_version` request that extra field,
  * and downsampling is disabled for those requests (the raw subset versions are needed).
  */
-export function resolveFetchFields(layer: ChartLayer): ResolvedFetchFields {
-  let fieldsToFetch = layer.fields;
-  let shouldSkipDownsampling = false;
-
-  if (isChartLayerLine(layer)) {
-    if (
-      (layer as ChartLayer & { hasSubsetVersionField?: boolean })
-        .hasSubsetVersionField &&
-      !fieldsToFetch.includes("subset_version")
-    ) {
-      fieldsToFetch = [...fieldsToFetch, "subset_version"];
-      shouldSkipDownsampling = true;
-    }
-  }
-
-  return { fieldsToFetch, shouldSkipDownsampling };
-}
+export function resolveFetchFields(layer: ChartLayer): ResolvedFetchFields {}
 
 /**
killedBy: resolveFetchFields returns the layer fields unchanged for a plain line layer
statusReason: expected undefined to deeply equal { fieldsToFetch: [ 'a', 'b' ], …(1) }

[Killed] BooleanLiteral
components/entities/chart/chart-data.ts:117:32
  */
 export function resolveFetchFields(layer: ChartLayer): ResolvedFetchFields {
   let fieldsToFetch = layer.fields;
-  let shouldSkipDownsampling = false;
+  let shouldSkipDownsampling = true;
 
   if (isChartLayerLine(layer)) {
killedBy: resolveFetchFields returns the layer fields unchanged for a plain line layer
statusReason: expected { fieldsToFetch: [ 'a', 'b' ], …(1) } to deeply equal { fieldsToFetch: [ 'a', 'b' ], …(1) }

[Killed] ConditionalExpression
components/entities/chart/chart-data.ts:119:7
   let fieldsToFetch = layer.fields;
   let shouldSkipDownsampling = false;
 
-  if (isChartLayerLine(layer)) {
+  if (true) {
     if (
       (layer as ChartLayer & { hasSubsetVersionField?: boolean })
killedBy: resolveFetchFields ignores subset_version handling for non-line (event) layers
statusReason: expected { fieldsToFetch: [ 'a', …(1) ], …(1) } to deeply equal { fieldsToFetch: [ 'a' ], …(1) }

[Killed] ConditionalExpression
components/entities/chart/chart-data.ts:119:7
   let fieldsToFetch = layer.fields;
   let shouldSkipDownsampling = false;
 
-  if (isChartLayerLine(layer)) {
+  if (false) {
     if (
       (layer as ChartLayer & { hasSubsetVersionField?: boolean })
killedBy: resolveFetchFields appends subset_version and skips downsampling for subset-version line layers
statusReason: expected { fieldsToFetch: [ 'a' ], …(1) } to deeply equal { fieldsToFetch: [ 'a', …(1) ], …(1) }

[Killed] LogicalOperator
components/entities/chart/chart-data.ts:121:7
 
   if (isChartLayerLine(layer)) {
     if (
-      (layer as ChartLayer & { hasSubsetVersionField?: boolean })
-        .hasSubsetVersionField &&
-      !fieldsToFetch.includes("subset_version")
+      (layer as ChartLayer & {
+  hasSubsetVersionField?: boolean;
+}).hasSubsetVersionField || !fieldsToFetch.includes("subset_version")
     ) {
       fieldsToFetch = [...fieldsToFetch, "subset_version"];
killedBy: resolveFetchFields returns the layer fields unchanged for a plain line layer
statusReason: expected { …(2) } to deeply equal { fieldsToFetch: [ 'a', 'b' ], …(1) }

[Killed] ConditionalExpression
components/entities/chart/chart-data.ts:121:7
 
   if (isChartLayerLine(layer)) {
     if (
-      (layer as ChartLayer & { hasSubsetVersionField?: boolean })
-        .hasSubsetVersionField &&
-      !fieldsToFetch.includes("subset_version")
+      true
     ) {
       fieldsToFetch = [...fieldsToFetch, "subset_version"];
killedBy: resolveFetchFields returns the layer fields unchanged for a plain line layer
statusReason: expected { …(2) } to deeply equal { fieldsToFetch: [ 'a', 'b' ], …(1) }

[Killed] BooleanLiteral
components/entities/chart/chart-data.ts:123:7
     if (
       (layer as ChartLayer & { hasSubsetVersionField?: boolean })
         .hasSubsetVersionField &&
-      !fieldsToFetch.includes("subset_version")
+      fieldsToFetch.includes("subset_version")
     ) {
       fieldsToFetch = [...fieldsToFetch, "subset_version"];
killedBy: resolveFetchFields appends subset_version and skips downsampling for subset-version line layers
statusReason: expected { fieldsToFetch: [ 'a' ], …(1) } to deeply equal { fieldsToFetch: [ 'a', …(1) ], …(1) }

[Killed] BlockStatement
components/entities/chart/chart-data.ts:124:7
       (layer as ChartLayer & { hasSubsetVersionField?: boolean })
         .hasSubsetVersionField &&
       !fieldsToFetch.includes("subset_version")
-    ) {
-      fieldsToFetch = [...fieldsToFetch, "subset_version"];
-      shouldSkipDownsampling = true;
-    }
+    ) {}
   }
 
killedBy: resolveFetchFields appends subset_version and skips downsampling for subset-version line layers
statusReason: expected { fieldsToFetch: [ 'a' ], …(1) } to deeply equal { fieldsToFetch: [ 'a', …(1) ], …(1) }

[Killed] BooleanLiteral
components/entities/chart/chart-data.ts:126:32
       !fieldsToFetch.includes("subset_version")
     ) {
       fieldsToFetch = [...fieldsToFetch, "subset_version"];
-      shouldSkipDownsampling = true;
+      shouldSkipDownsampling = false;
     }
   }
killedBy: resolveFetchFields appends subset_version and skips downsampling for subset-version line layers
statusReason: expected { fieldsToFetch: [ 'a', …(1) ], …(1) } to deeply equal { fieldsToFetch: [ 'a', …(1) ], …(1) }

[Killed] BlockStatement
components/entities/chart/chart-data.ts:138:61
  * genuine failure), so the chart renders it as an empty, "not ingested" series
  * rather than surfacing an error.
  */
-export function isNotIngestedError(error: unknown): boolean {
-  return (
-    error instanceof HttpError && error.status >= 400 && error.status < 500
-  );
-}
+export function isNotIngestedError(error: unknown): boolean {}
 
 /** The empty response substituted for a not-ingested (4xx) layer. */
killedBy: isNotIngestedError is true only for 4xx HttpErrors
statusReason: expected undefined to be true // Object.is equality

[Killed] EqualityOperator
components/entities/chart/chart-data.ts:140:35
  */
 export function isNotIngestedError(error: unknown): boolean {
   return (
-    error instanceof HttpError && error.status >= 400 && error.status < 500
+    error instanceof HttpError && error.status > 400 && error.status < 500
   );
 }
killedBy: isNotIngestedError is true only for 4xx HttpErrors
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
components/entities/chart/chart-data.ts:140:5
  */
 export function isNotIngestedError(error: unknown): boolean {
   return (
-    error instanceof HttpError && error.status >= 400 && error.status < 500
+    error instanceof HttpError || error.status >= 400 && error.status < 500
   );
 }
killedBy: isNotIngestedError is false for non-4xx statuses and non-HttpErrors
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
components/entities/chart/chart-data.ts:145:63
 }
 
 /** The empty response substituted for a not-ingested (4xx) layer. */
-export function createNotIngestedDataResponse(): DataResponse {
-  return {
-    data: [],
-    data_begin: "",
-    data_count: 0,
-    data_end: "",
-    downsampling_factor: 1,
-    from_isotimestamp: "",
-    nominal_data_interval_seconds: null,
-    query_elapsed_ms: 0,
-    to_isotimestamp: "",
-  };
-}
+export function createNotIngestedDataResponse(): DataResponse {}
 
 /** One processed layer ready for Chart.js dataset construction. */
killedBy: createNotIngestedDataResponse returns a fresh empty response
statusReason: expected undefined to deeply equal { data: [], data_begin: '', …(7) }

[Killed] ArrayDeclaration
components/entities/chart/chart-data.ts:147:11
 /** The empty response substituted for a not-ingested (4xx) layer. */
 export function createNotIngestedDataResponse(): DataResponse {
   return {
-    data: [],
+    data: ["Stryker was here"],
     data_begin: "",
     data_count: 0,
killedBy: createNotIngestedDataResponse returns a fresh empty response
statusReason: expected { data: [ 'Stryker was here' ], …(8) } to deeply equal { data: [], data_begin: '', …(7) }

[Killed] StringLiteral
components/entities/chart/chart-data.ts:152:24
     data_count: 0,
     data_end: "",
     downsampling_factor: 1,
-    from_isotimestamp: "",
+    from_isotimestamp: "Stryker was here!",
     nominal_data_interval_seconds: null,
     query_elapsed_ms: 0,
killedBy: createNotIngestedDataResponse returns a fresh empty response
statusReason: expected { data: [], data_begin: '', …(7) } to deeply equal { data: [], data_begin: '', …(7) }

[Killed] StringLiteral
components/entities/chart/chart-data.ts:155:22
     from_isotimestamp: "",
     nominal_data_interval_seconds: null,
     query_elapsed_ms: 0,
-    to_isotimestamp: "",
+    to_isotimestamp: "Stryker was here!",
   };
 }
killedBy: createNotIngestedDataResponse returns a fresh empty response
statusReason: expected { data: [], data_begin: '', …(7) } to deeply equal { data: [], data_begin: '', …(7) }

[Killed] BooleanLiteral
components/entities/chart/chart-data.ts:180:7
   const { layer, pointsByField } = item;
 
   // Only process ChartLayerLine
-  if (!isChartLayerLine(layer)) {
+  if (isChartLayerLine(layer)) {
     return [item];
   }
killedBy: expandLayerBySubsetVersion returns non-line layers unchanged even with expandable data
statusReason: expected [ { data_count: 3, …(4) }, …(1) ] to deeply equal [ { data_count: 3, …(4) } ]

[Killed] BlockStatement
components/entities/chart/chart-data.ts:180:33
   const { layer, pointsByField } = item;
 
   // Only process ChartLayerLine
-  if (!isChartLayerLine(layer)) {
-    return [item];
-  }
+  if (!isChartLayerLine(layer)) {}
 
   const primaryField = layer.fields[0];
killedBy: expandLayerBySubsetVersion returns non-line layers unchanged even with expandable data
statusReason: expected [ { data_count: 3, …(4) }, …(1) ] to deeply equal [ { data_count: 3, …(4) } ]

[Killed] BlockStatement
components/entities/chart/chart-data.ts:187:37
   const primaryField = layer.fields[0];
 
   // Skip if the primary field data doesn't exist
-  if (!pointsByField[primaryField]) {
-    return [item];
-  }
+  if (!pointsByField[primaryField]) {}
 
   // Check if any point has subset_version data
killedBy: expandLayerBySubsetVersion returns the item unchanged when primary-field data is missing
statusReason: Cannot read properties of undefined (reading 'some')

[Killed] BooleanLiteral
components/entities/chart/chart-data.ts:187:7
   const primaryField = layer.fields[0];
 
   // Skip if the primary field data doesn't exist
-  if (!pointsByField[primaryField]) {
+  if (pointsByField[primaryField]) {
     return [item];
   }
killedBy: expandLayerBySubsetVersion returns the item unchanged when primary-field data is missing
statusReason: Cannot read properties of undefined (reading 'some')

[Killed] MethodExpression
components/entities/chart/chart-data.ts:192:28
   }
 
   // Check if any point has subset_version data
-  const hasSubsetVersion = pointsByField[primaryField].some(
-    (point) => point.raw.subset_version?.value !== undefined,
-  );
+  const hasSubsetVersion = pointsByField[primaryField].every(point => point.raw.subset_version?.value !== undefined);
 
   if (!hasSubsetVersion) {
killedBy: expandLayerBySubsetVersion expands when only some points carry a subset_version
statusReason: expected [ undefined ] to deeply equal [ 'subset_version=5', …(1) ]

[Killed] ConditionalExpression
components/entities/chart/chart-data.ts:193:16
 
   // Check if any point has subset_version data
   const hasSubsetVersion = pointsByField[primaryField].some(
-    (point) => point.raw.subset_version?.value !== undefined,
+    (point) => false,
   );
 
killedBy: expandLayerBySubsetVersion splits into numerically-sorted, alternating-colored virtual layers
statusReason: expected [ { data_count: 7, …(4) } ] to have a length of 2 but got 1

[Killed] EqualityOperator
components/entities/chart/chart-data.ts:193:16
 
   // Check if any point has subset_version data
   const hasSubsetVersion = pointsByField[primaryField].some(
-    (point) => point.raw.subset_version?.value !== undefined,
+    (point) => point.raw.subset_version?.value === undefined,
   );
 
killedBy: expandLayerBySubsetVersion returns the item unchanged when no point has a subset_version
statusReason: expected [ { data_count: 3, …(4) } ] to deeply equal [ { data_count: 3, …(4) } ]

[Killed] ConditionalExpression
components/entities/chart/chart-data.ts:196:7
     (point) => point.raw.subset_version?.value !== undefined,
   );
 
-  if (!hasSubsetVersion) {
+  if (true) {
     return [item];
   }
killedBy: expandLayerBySubsetVersion splits into numerically-sorted, alternating-colored virtual layers
statusReason: expected [ { data_count: 7, …(4) } ] to have a length of 2 but got 1

[Killed] ConditionalExpression
components/entities/chart/chart-data.ts:196:7
     (point) => point.raw.subset_version?.value !== undefined,
   );
 
-  if (!hasSubsetVersion) {
+  if (false) {
     return [item];
   }
killedBy: expandLayerBySubsetVersion returns the item unchanged when no point has a subset_version
statusReason: expected [ { data_count: 3, …(4) } ] to deeply equal [ { data_count: 3, …(4) } ]

[Killed] ArrayDeclaration
components/entities/chart/chart-data.ts:197:12
   );
 
   if (!hasSubsetVersion) {
-    return [item];
+    return [];
   }
 
killedBy: expandLayerBySubsetVersion returns the item unchanged when no point has a subset_version
statusReason: expected [] to deeply equal [ { data_count: 3, …(4) } ]
