[Killed] BlockStatement
components/entities/chart/chart-data.ts:203:50
   // Group points by subset_version
   const groups: Record<string, CustomChartData[]> = {};
 
-  pointsByField[primaryField].forEach((point) => {
-    const subsetVersionValue =
-      point.raw.subset_version?.value?.toString() || "unknown";
-    if (!groups[subsetVersionValue]) {
-      groups[subsetVersionValue] = [];
-    }
-    groups[subsetVersionValue].push(point);
-  });
+  pointsByField[primaryField].forEach((point) => {});
 
   // Create a virtual layer for each subset_version with alternating colors
killedBy: expandLayerBySubsetVersion splits into numerically-sorted, alternating-colored virtual layers
statusReason: expected [] to have a length of 2 but got +0

[Killed] OptionalChaining
components/entities/chart/chart-data.ts:205:7
 
   pointsByField[primaryField].forEach((point) => {
     const subsetVersionValue =
-      point.raw.subset_version?.value?.toString() || "unknown";
+      point.raw.subset_version.value?.toString() || "unknown";
     if (!groups[subsetVersionValue]) {
       groups[subsetVersionValue] = [];
killedBy: expandLayerBySubsetVersion expands when only some points carry a subset_version
statusReason: Cannot read properties of undefined (reading 'value')

[Killed] OptionalChaining
components/entities/chart/chart-data.ts:205:7
 
   pointsByField[primaryField].forEach((point) => {
     const subsetVersionValue =
-      point.raw.subset_version?.value?.toString() || "unknown";
+      point.raw.subset_version?.value.toString() || "unknown";
     if (!groups[subsetVersionValue]) {
       groups[subsetVersionValue] = [];
killedBy: expandLayerBySubsetVersion labels without a base label and falls back to 'unknown'
statusReason: Cannot read properties of null (reading 'toString')

[Killed] ConditionalExpression
components/entities/chart/chart-data.ts:206:9
   pointsByField[primaryField].forEach((point) => {
     const subsetVersionValue =
       point.raw.subset_version?.value?.toString() || "unknown";
-    if (!groups[subsetVersionValue]) {
+    if (false) {
       groups[subsetVersionValue] = [];
     }
killedBy: expandLayerBySubsetVersion splits into numerically-sorted, alternating-colored virtual layers
statusReason: Cannot read properties of undefined (reading 'push')

[Killed] BlockStatement
components/entities/chart/chart-data.ts:206:38
   pointsByField[primaryField].forEach((point) => {
     const subsetVersionValue =
       point.raw.subset_version?.value?.toString() || "unknown";
-    if (!groups[subsetVersionValue]) {
-      groups[subsetVersionValue] = [];
-    }
+    if (!groups[subsetVersionValue]) {}
     groups[subsetVersionValue].push(point);
   });
killedBy: expandLayerBySubsetVersion splits into numerically-sorted, alternating-colored virtual layers
statusReason: Cannot read properties of undefined (reading 'push')

[Killed] ArrayDeclaration
components/entities/chart/chart-data.ts:207:36
     const subsetVersionValue =
       point.raw.subset_version?.value?.toString() || "unknown";
     if (!groups[subsetVersionValue]) {
-      groups[subsetVersionValue] = [];
+      groups[subsetVersionValue] = ["Stryker was here"];
     }
     groups[subsetVersionValue].push(point);
killedBy: expandLayerBySubsetVersion splits into numerically-sorted, alternating-colored virtual layers
statusReason: expected [ 'Stryker was here', { …(4) }, …(1) ] to deeply equal [ { …(4) }, { …(4) } ]

[Killed] MethodExpression
components/entities/chart/chart-data.ts:213:10
   });
 
   // Create a virtual layer for each subset_version with alternating colors
-  return Object.entries(groups)
-    .sort(([a], [b]) => a.localeCompare(b, "en", { numeric: true }))
+  return Object.entries(groups)
     .map(([subsetVersionValue, groupPoints], index) => {
       // Alternate between blue and red for subset_versions
killedBy: expandLayerBySubsetVersion splits into numerically-sorted, alternating-colored virtual layers
statusReason: expected 'L (subset_version=v10)' to be 'L (subset_version=v2)' // Object.is equality

[Killed] ArrowFunction
components/entities/chart/chart-data.ts:214:11
 
   // Create a virtual layer for each subset_version with alternating colors
   return Object.entries(groups)
-    .sort(([a], [b]) => a.localeCompare(b, "en", { numeric: true }))
+    .sort(() => undefined)
     .map(([subsetVersionValue, groupPoints], index) => {
       // Alternate between blue and red for subset_versions
killedBy: expandLayerBySubsetVersion splits into numerically-sorted, alternating-colored virtual layers
statusReason: expected 'L (subset_version=v10)' to be 'L (subset_version=v2)' // Object.is equality

[Killed] BooleanLiteral
components/entities/chart/chart-data.ts:214:61
 
   // Create a virtual layer for each subset_version with alternating colors
   return Object.entries(groups)
-    .sort(([a], [b]) => a.localeCompare(b, "en", { numeric: true }))
+    .sort(([a], [b]) => a.localeCompare(b, "en", { numeric: false }))
     .map(([subsetVersionValue, groupPoints], index) => {
       // Alternate between blue and red for subset_versions
killedBy: expandLayerBySubsetVersion splits into numerically-sorted, alternating-colored virtual layers
statusReason: expected 'L (subset_version=v10)' to be 'L (subset_version=v2)' // Object.is equality

[Killed] BlockStatement
components/entities/chart/chart-data.ts:215:56
   // Create a virtual layer for each subset_version with alternating colors
   return Object.entries(groups)
     .sort(([a], [b]) => a.localeCompare(b, "en", { numeric: true }))
-    .map(([subsetVersionValue, groupPoints], index) => {
-      // Alternate between blue and red for subset_versions
-      const color = index % 2 === 0 ? "#0000FF" : "#FF0000";
-
-      const virtualLayer = {
-        ...layer,
-        color: color,
-        // Update label to include subset_version
-        label: layer.label
-          ? `${layer.label} (subset_version=${subsetVersionValue})`
-          : `subset_version=${subsetVersionValue}`,
-      };
-
-      return {
-        ...item,
-        layer: virtualLayer,
-        pointsByField: {
-          ...pointsByField,
-          [primaryField]: groupPoints,
-        },
-      };
-    });
+    .map(([subsetVersionValue, groupPoints], index) => {});
 }
 
killedBy: expandLayerBySubsetVersion splits into numerically-sorted, alternating-colored virtual layers
statusReason: Cannot read properties of undefined (reading 'layer')

[Killed] ConditionalExpression
components/entities/chart/chart-data.ts:217:21
     .sort(([a], [b]) => a.localeCompare(b, "en", { numeric: true }))
     .map(([subsetVersionValue, groupPoints], index) => {
       // Alternate between blue and red for subset_versions
-      const color = index % 2 === 0 ? "#0000FF" : "#FF0000";
+      const color = false ? "#0000FF" : "#FF0000";
 
       const virtualLayer = {
killedBy: expandLayerBySubsetVersion splits into numerically-sorted, alternating-colored virtual layers
statusReason: expected '#FF0000' to be '#0000FF' // Object.is equality

[Killed] ArithmeticOperator
components/entities/chart/chart-data.ts:217:21
     .sort(([a], [b]) => a.localeCompare(b, "en", { numeric: true }))
     .map(([subsetVersionValue, groupPoints], index) => {
       // Alternate between blue and red for subset_versions
-      const color = index % 2 === 0 ? "#0000FF" : "#FF0000";
+      const color = index * 2 === 0 ? "#0000FF" : "#FF0000";
 
       const virtualLayer = {
killedBy: expandLayerBySubsetVersion alternates colors across three or more groups
statusReason: expected [ '#0000FF', '#FF0000', '#FF0000' ] to deeply equal [ '#0000FF', '#FF0000', '#0000FF' ]

[Killed] StringLiteral
components/entities/chart/chart-data.ts:224:13
         color: color,
         // Update label to include subset_version
         label: layer.label
-          ? `${layer.label} (subset_version=${subsetVersionValue})`
+          ? ``
           : `subset_version=${subsetVersionValue}`,
       };
killedBy: expandLayerBySubsetVersion splits into numerically-sorted, alternating-colored virtual layers
statusReason: expected '' to be 'L (subset_version=v2)' // Object.is equality

[Killed] BlockStatement
components/entities/chart/chart-data.ts:245:11
  */
 export function countUniqueSubsetVersions(
   points: CustomChartData[] | undefined,
-): number {
-  const subsetVersionSet = new Set<string>();
-  if (points) {
-    points.forEach((point) => {
-      const subsetVersionValue = point.raw.subset_version?.value;
-      if (subsetVersionValue !== undefined && subsetVersionValue !== null) {
-        subsetVersionSet.add(String(subsetVersionValue));
-      }
-    });
-  }
-  return subsetVersionSet.size;
-}
+): number {}
 
 /**
killedBy: countUniqueSubsetVersions returns 0 for undefined or empty points
statusReason: expected undefined to be +0 // Object.is equality

[Killed] ConditionalExpression
components/entities/chart/chart-data.ts:247:7
   points: CustomChartData[] | undefined,
 ): number {
   const subsetVersionSet = new Set<string>();
-  if (points) {
+  if (false) {
     points.forEach((point) => {
       const subsetVersionValue = point.raw.subset_version?.value;
killedBy: countUniqueSubsetVersions counts distinct values and ignores duplicates
statusReason: expected +0 to be 2 // Object.is equality

[Killed] ConditionalExpression
components/entities/chart/chart-data.ts:247:7
   points: CustomChartData[] | undefined,
 ): number {
   const subsetVersionSet = new Set<string>();
-  if (points) {
+  if (true) {
     points.forEach((point) => {
       const subsetVersionValue = point.raw.subset_version?.value;
killedBy: countUniqueSubsetVersions returns 0 for undefined or empty points
statusReason: Cannot read properties of undefined (reading 'forEach')

[Killed] BlockStatement
components/entities/chart/chart-data.ts:248:31
 ): number {
   const subsetVersionSet = new Set<string>();
   if (points) {
-    points.forEach((point) => {
-      const subsetVersionValue = point.raw.subset_version?.value;
-      if (subsetVersionValue !== undefined && subsetVersionValue !== null) {
-        subsetVersionSet.add(String(subsetVersionValue));
-      }
-    });
+    points.forEach((point) => {});
   }
   return subsetVersionSet.size;
killedBy: countUniqueSubsetVersions counts distinct values and ignores duplicates
statusReason: expected +0 to be 2 // Object.is equality

[Killed] OptionalChaining
components/entities/chart/chart-data.ts:249:34
   const subsetVersionSet = new Set<string>();
   if (points) {
     points.forEach((point) => {
-      const subsetVersionValue = point.raw.subset_version?.value;
+      const subsetVersionValue = point.raw.subset_version.value;
       if (subsetVersionValue !== undefined && subsetVersionValue !== null) {
         subsetVersionSet.add(String(subsetVersionValue));
killedBy: countUniqueSubsetVersions returns 0 when no point carries a subset_version
statusReason: Cannot read properties of undefined (reading 'value')

[Killed] BlockStatement
components/entities/chart/chart-data.ts:250:76
   if (points) {
     points.forEach((point) => {
       const subsetVersionValue = point.raw.subset_version?.value;
-      if (subsetVersionValue !== undefined && subsetVersionValue !== null) {
-        subsetVersionSet.add(String(subsetVersionValue));
-      }
+      if (subsetVersionValue !== undefined && subsetVersionValue !== null) {}
     });
   }
killedBy: countUniqueSubsetVersions counts distinct values and ignores duplicates
statusReason: expected +0 to be 2 // Object.is equality

[Killed] EqualityOperator
components/entities/chart/chart-data.ts:250:11
   if (points) {
     points.forEach((point) => {
       const subsetVersionValue = point.raw.subset_version?.value;
-      if (subsetVersionValue !== undefined && subsetVersionValue !== null) {
+      if (subsetVersionValue === undefined && subsetVersionValue !== null) {
         subsetVersionSet.add(String(subsetVersionValue));
       }
killedBy: countUniqueSubsetVersions returns 0 when no point carries a subset_version
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ConditionalExpression
components/entities/chart/chart-data.ts:278:7
   const points: CustomChartData[] = [];
   const fieldValue = d[field];
   const timestamp = d.timestamp;
-  if (!fieldValue || typeof timestamp !== "string") return points;
+  if (true) return points;
 
   // Case where downsampling is not applied
killedBy: deriveFieldPoints returns a single raw point when downsampling is off
statusReason: expected [] to deeply equal [ { …(4) } ]

[Killed] ConditionalExpression
components/entities/chart/chart-data.ts:278:7
   const points: CustomChartData[] = [];
   const fieldValue = d[field];
   const timestamp = d.timestamp;
-  if (!fieldValue || typeof timestamp !== "string") return points;
+  if (false) return points;
 
   // Case where downsampling is not applied
killedBy: deriveFieldPoints returns [] when the field value or timestamp is invalid
statusReason: Cannot read properties of undefined (reading 'value')

[Killed] ConditionalExpression
components/entities/chart/chart-data.ts:281:7
   if (!fieldValue || typeof timestamp !== "string") return points;
 
   // Case where downsampling is not applied
-  if (downsamplingFactor === 1) {
+  if (true) {
     points.push({
       x: timestamp,
killedBy: deriveFieldPoints returns [] when downsampled without field metadata
statusReason: expected [ { …(4) } ] to deeply equal []

[Killed] EqualityOperator
components/entities/chart/chart-data.ts:281:7
   if (!fieldValue || typeof timestamp !== "string") return points;
 
   // Case where downsampling is not applied
-  if (downsamplingFactor === 1) {
+  if (downsamplingFactor !== 1) {
     points.push({
       x: timestamp,
killedBy: deriveFieldPoints returns a single raw point when downsampling is off
statusReason: expected [] to deeply equal [ { …(4) } ]

[Killed] ObjectLiteral
components/entities/chart/chart-data.ts:282:17
 
   // Case where downsampling is not applied
   if (downsamplingFactor === 1) {
-    points.push({
-      x: timestamp,
-      y: fieldValue.value as number,
-      raw: d,
-      selected: false,
-    });
+    points.push({});
   } else {
     if (!fieldMetadata) return points;
killedBy: deriveFieldPoints returns a single raw point when downsampling is off
statusReason: expected [ {} ] to deeply equal [ { …(4) } ]

[Killed] BooleanLiteral
components/entities/chart/chart-data.ts:286:17
       x: timestamp,
       y: fieldValue.value as number,
       raw: d,
-      selected: false,
+      selected: true,
     });
   } else {
killedBy: deriveFieldPoints returns a single raw point when downsampling is off
statusReason: expected [ { …(4) } ] to deeply equal [ { …(4) } ]

[Killed] ConditionalExpression
components/entities/chart/chart-data.ts:289:9
       selected: false,
     });
   } else {
-    if (!fieldMetadata) return points;
+    if (true) return points;
     if (
       fieldMetadata.supported_aggregations.find(({ type }) => type === "min") &&
killedBy: deriveFieldPoints emits min and max points at the window midpoint when they differ
statusReason: expected [] to deeply equal [ { …(4) }, { …(4) } ]

[Killed] ConditionalExpression
components/entities/chart/chart-data.ts:289:9
       selected: false,
     });
   } else {
-    if (!fieldMetadata) return points;
+    if (false) return points;
     if (
       fieldMetadata.supported_aggregations.find(({ type }) => type === "min") &&
killedBy: deriveFieldPoints returns [] when downsampled without field metadata
statusReason: Cannot read properties of null (reading 'supported_aggregations')

[Killed] LogicalOperator
components/entities/chart/chart-data.ts:291:7
   } else {
     if (!fieldMetadata) return points;
     if (
-      fieldMetadata.supported_aggregations.find(({ type }) => type === "min") &&
-      fieldMetadata.supported_aggregations.find(({ type }) => type === "max")
+      fieldMetadata.supported_aggregations.find(({
+  type
+}) => type === "min") || fieldMetadata.supported_aggregations.find(({
+  type
+}) => type === "max")
     ) {
       // Compute middle time of aggregation window
killedBy: deriveFieldPoints returns [] when downsampled aggregations are unusable
statusReason: expected [ { …(4) }, { …(4) } ] to deeply equal []

[Killed] ConditionalExpression
components/entities/chart/chart-data.ts:291:7
   } else {
     if (!fieldMetadata) return points;
     if (
-      fieldMetadata.supported_aggregations.find(({ type }) => type === "min") &&
-      fieldMetadata.supported_aggregations.find(({ type }) => type === "max")
+      false
     ) {
       // Compute middle time of aggregation window
killedBy: deriveFieldPoints emits min and max points at the window midpoint when they differ
statusReason: expected [] to deeply equal [ { …(4) }, { …(4) } ]

[Killed] ConditionalExpression
components/entities/chart/chart-data.ts:292:63
     if (!fieldMetadata) return points;
     if (
       fieldMetadata.supported_aggregations.find(({ type }) => type === "min") &&
-      fieldMetadata.supported_aggregations.find(({ type }) => type === "max")
+      fieldMetadata.supported_aggregations.find(({ type }) => false)
     ) {
       // Compute middle time of aggregation window
killedBy: deriveFieldPoints emits min and max points at the window midpoint when they differ
statusReason: expected [] to deeply equal [ { …(4) }, { …(4) } ]

[Killed] ArrowFunction
components/entities/chart/chart-data.ts:292:49
     if (!fieldMetadata) return points;
     if (
       fieldMetadata.supported_aggregations.find(({ type }) => type === "min") &&
-      fieldMetadata.supported_aggregations.find(({ type }) => type === "max")
+      fieldMetadata.supported_aggregations.find(() => undefined)
     ) {
       // Compute middle time of aggregation window
killedBy: deriveFieldPoints emits min and max points at the window midpoint when they differ
statusReason: expected [] to deeply equal [ { …(4) }, { …(4) } ]

[Killed] BlockStatement
components/entities/chart/chart-data.ts:293:7
     if (
       fieldMetadata.supported_aggregations.find(({ type }) => type === "min") &&
       fieldMetadata.supported_aggregations.find(({ type }) => type === "max")
-    ) {
-      // Compute middle time of aggregation window
-      const pointTimestampMS = new Date(timestamp).getTime();
-      const halfFieldDataIntervalMS =
-        ((nominalDataIntervalSeconds || 0) / 2) * 1000;
-      const middleTime = new Date(
-        pointTimestampMS + halfFieldDataIntervalMS,
-      ).toISOString();
-
-      // Use the min and max set to the middle of the window
-      points.push({
-        x: middleTime,
-        y: fieldValue.min as number,
-        raw: d,
-        selected: false,
-      });
-      if (fieldValue.min !== fieldValue.max) {
-        points.push({
-          x: middleTime,
-          y: fieldValue.max as number,
-          raw: d,
-          selected: false,
-        });
-      }
-    } else if (
+    ) {} else if (
       fieldMetadata.supported_aggregations.find(({ type }) => type === "avg")
     ) {
killedBy: deriveFieldPoints emits min and max points at the window midpoint when they differ
statusReason: expected [] to deeply equal [ { …(4) }, { …(4) } ]

[Killed] LogicalOperator
components/entities/chart/chart-data.ts:297:11
       // Compute middle time of aggregation window
       const pointTimestampMS = new Date(timestamp).getTime();
       const halfFieldDataIntervalMS =
-        ((nominalDataIntervalSeconds || 0) / 2) * 1000;
+        ((nominalDataIntervalSeconds && 0) / 2) * 1000;
       const middleTime = new Date(
         pointTimestampMS + halfFieldDataIntervalMS,
killedBy: deriveFieldPoints emits min and max points at the window midpoint when they differ
statusReason: expected [ { …(4) }, { …(4) } ] to deeply equal [ { …(4) }, { …(4) } ]

[Killed] ConditionalExpression
components/entities/chart/chart-data.ts:297:11
       // Compute middle time of aggregation window
       const pointTimestampMS = new Date(timestamp).getTime();
       const halfFieldDataIntervalMS =
-        ((nominalDataIntervalSeconds || 0) / 2) * 1000;
+        ((true) / 2) * 1000;
       const middleTime = new Date(
         pointTimestampMS + halfFieldDataIntervalMS,
killedBy: deriveFieldPoints emits min and max points at the window midpoint when they differ
statusReason: expected [ { …(4) }, { …(4) } ] to deeply equal [ { …(4) }, { …(4) } ]

[Killed] ArithmeticOperator
components/entities/chart/chart-data.ts:299:9
       const halfFieldDataIntervalMS =
         ((nominalDataIntervalSeconds || 0) / 2) * 1000;
       const middleTime = new Date(
-        pointTimestampMS + halfFieldDataIntervalMS,
+        pointTimestampMS - halfFieldDataIntervalMS,
       ).toISOString();
 
killedBy: deriveFieldPoints emits min and max points at the window midpoint when they differ
statusReason: expected [ { …(4) }, { …(4) } ] to deeply equal [ { …(4) }, { …(4) } ]

[Killed] BlockStatement
components/entities/chart/chart-data.ts:309:46
         raw: d,
         selected: false,
       });
-      if (fieldValue.min !== fieldValue.max) {
-        points.push({
-          x: middleTime,
-          y: fieldValue.max as number,
-          raw: d,
-          selected: false,
-        });
-      }
+      if (fieldValue.min !== fieldValue.max) {}
     } else if (
       fieldMetadata.supported_aggregations.find(({ type }) => type === "avg")
killedBy: deriveFieldPoints emits min and max points at the window midpoint when they differ
statusReason: expected [ { …(4) } ] to deeply equal [ { …(4) }, { …(4) } ]

[Killed] ConditionalExpression
components/entities/chart/chart-data.ts:309:11
         raw: d,
         selected: false,
       });
-      if (fieldValue.min !== fieldValue.max) {
+      if (true) {
         points.push({
           x: middleTime,
killedBy: deriveFieldPoints emits a single midpoint point when min equals max
statusReason: expected [ { …(4) }, { …(4) } ] to deeply equal [ { …(4) } ]

[Killed] ConditionalExpression
components/entities/chart/chart-data.ts:318:7
         });
       }
     } else if (
-      fieldMetadata.supported_aggregations.find(({ type }) => type === "avg")
+      true
     ) {
       points.push({
killedBy: deriveFieldPoints returns [] when downsampled aggregations are unusable
statusReason: expected [ { …(4) } ] to deeply equal []

[Killed] EqualityOperator
components/entities/chart/chart-data.ts:318:63
         });
       }
     } else if (
-      fieldMetadata.supported_aggregations.find(({ type }) => type === "avg")
+      fieldMetadata.supported_aggregations.find(({ type }) => type !== "avg")
     ) {
       points.push({
killedBy: deriveFieldPoints uses avg at the raw timestamp when only avg is supported
statusReason: expected [] to deeply equal [ { …(4) } ]

[Killed] BlockStatement
components/entities/chart/chart-data.ts:319:7
       }
     } else if (
       fieldMetadata.supported_aggregations.find(({ type }) => type === "avg")
-    ) {
-      points.push({
-        x: timestamp,
-        y: fieldValue.avg as number,
-        raw: d,
-        selected: false,
-      });
-    }
+    ) {}
   }
   return points;
killedBy: deriveFieldPoints uses avg at the raw timestamp when only avg is supported
statusReason: expected [] to deeply equal [ { …(4) } ]

[Killed] BlockStatement
components/entities/chart/chart-data.ts:335:80
  * Resolve a dimension value that may be an absolute number or a percentage string
  * (e.g. `"25%"`) into an absolute value relative to `dimension`.
  */
-export function toDimension(value: number | string, dimension: number): number {
-  return typeof value === "string" && value.endsWith("%")
-    ? (parseFloat(value) / 100) * dimension
-    : +value;
-}
+export function toDimension(value: number | string, dimension: number): number {}
 
 /**
killedBy: toDimension resolves a percentage string relative to the dimension
statusReason: expected undefined to be 50 // Object.is equality

[Killed] LogicalOperator
components/entities/chart/chart-data.ts:336:10
  * (e.g. `"25%"`) into an absolute value relative to `dimension`.
  */
 export function toDimension(value: number | string, dimension: number): number {
-  return typeof value === "string" && value.endsWith("%")
+  return typeof value === "string" || value.endsWith("%")
     ? (parseFloat(value) / 100) * dimension
     : +value;
killedBy: toDimension coerces a non-percentage value to an absolute number
statusReason: expected 60 to be 30 // Object.is equality

[Killed] EqualityOperator
components/entities/chart/chart-data.ts:336:10
  * (e.g. `"25%"`) into an absolute value relative to `dimension`.
  */
 export function toDimension(value: number | string, dimension: number): number {
-  return typeof value === "string" && value.endsWith("%")
+  return typeof value !== "string" && value.endsWith("%")
     ? (parseFloat(value) / 100) * dimension
     : +value;
killedBy: toDimension resolves a percentage string relative to the dimension
statusReason: expected NaN to be 50 // Object.is equality

[Killed] ArithmeticOperator
components/entities/chart/chart-data.ts:337:7
  */
 export function toDimension(value: number | string, dimension: number): number {
   return typeof value === "string" && value.endsWith("%")
-    ? (parseFloat(value) / 100) * dimension
+    ? parseFloat(value) / 100 / dimension
     : +value;
 }
killedBy: toDimension resolves a percentage string relative to the dimension
statusReason: expected 0.00125 to be 50 // Object.is equality

[Killed] ArithmeticOperator
components/entities/chart/chart-data.ts:337:8
  */
 export function toDimension(value: number | string, dimension: number): number {
   return typeof value === "string" && value.endsWith("%")
-    ? (parseFloat(value) / 100) * dimension
+    ? (parseFloat(value) * 100) * dimension
     : +value;
 }
killedBy: toDimension resolves a percentage string relative to the dimension
statusReason: expected 500000 to be 50 // Object.is equality

[Killed] UnaryOperator
components/entities/chart/chart-data.ts:338:7
 export function toDimension(value: number | string, dimension: number): number {
   return typeof value === "string" && value.endsWith("%")
     ? (parseFloat(value) / 100) * dimension
-    : +value;
+    : -value;
 }
 
killedBy: toDimension coerces a non-percentage value to an absolute number
statusReason: expected -30 to be 30 // Object.is equality

[Killed] BlockStatement
components/entities/chart/chart-data.ts:351:11
   tooltipWidth: number,
   innerWidth: number,
   scrollX: number,
-): number {
-  return Math.min(
-    innerWidth - tooltipWidth - 20,
-    triggerLeft + scrollX - tooltipWidth / 2 + caretX,
-  );
-}
+): number {}
 
 /** Vertical position (px) for the chart tooltip: above the caret by the tooltip height plus a gap. */
killedBy: computeTooltipLeft centers on the caret when it fits within the viewport
statusReason: expected undefined to be 95 // Object.is equality

[Killed] MethodExpression
components/entities/chart/chart-data.ts:352:10
   innerWidth: number,
   scrollX: number,
 ): number {
-  return Math.min(
-    innerWidth - tooltipWidth - 20,
-    triggerLeft + scrollX - tooltipWidth / 2 + caretX,
-  );
+  return Math.max(innerWidth - tooltipWidth - 20, triggerLeft + scrollX - tooltipWidth / 2 + caretX);
 }
 
killedBy: computeTooltipLeft centers on the caret when it fits within the viewport
statusReason: expected 940 to be 95 // Object.is equality

[Killed] ArithmeticOperator
components/entities/chart/chart-data.ts:353:5
   scrollX: number,
 ): number {
   return Math.min(
-    innerWidth - tooltipWidth - 20,
+    innerWidth - tooltipWidth + 20,
     triggerLeft + scrollX - tooltipWidth / 2 + caretX,
   );
killedBy: computeTooltipLeft clamps to the right viewport edge with a 20px margin
statusReason: expected 480 to be 440 // Object.is equality

[Killed] ArithmeticOperator
components/entities/chart/chart-data.ts:353:5
   scrollX: number,
 ): number {
   return Math.min(
-    innerWidth - tooltipWidth - 20,
+    innerWidth + tooltipWidth - 20,
     triggerLeft + scrollX - tooltipWidth / 2 + caretX,
   );
killedBy: computeTooltipLeft clamps to the right viewport edge with a 20px margin
statusReason: expected 520 to be 440 // Object.is equality

[Killed] ArithmeticOperator
components/entities/chart/chart-data.ts:354:5
 ): number {
   return Math.min(
     innerWidth - tooltipWidth - 20,
-    triggerLeft + scrollX - tooltipWidth / 2 + caretX,
+    triggerLeft + scrollX - tooltipWidth / 2 - caretX,
   );
 }
killedBy: computeTooltipLeft centers on the caret when it fits within the viewport
statusReason: expected 75 to be 95 // Object.is equality

[Killed] ArithmeticOperator
components/entities/chart/chart-data.ts:354:5
 ): number {
   return Math.min(
     innerWidth - tooltipWidth - 20,
-    triggerLeft + scrollX - tooltipWidth / 2 + caretX,
+    triggerLeft - scrollX - tooltipWidth / 2 + caretX,
   );
 }
killedBy: computeTooltipLeft centers on the caret when it fits within the viewport
statusReason: expected 85 to be 95 // Object.is equality

[Killed] BlockStatement
components/entities/chart/chart-data.ts:364:11
   caretY: number,
   tooltipHeight: number,
   scrollY: number,
-): number {
-  return triggerTop + scrollY - tooltipHeight + caretY - 12;
-}
+): number {}
 
killedBy: computeTooltipTop positions the tooltip above the caret
statusReason: expected undefined to be 163 // Object.is equality

[Killed] ArithmeticOperator
components/entities/chart/chart-data.ts:365:10
   tooltipHeight: number,
   scrollY: number,
 ): number {
-  return triggerTop + scrollY - tooltipHeight + caretY - 12;
+  return triggerTop + scrollY - tooltipHeight - caretY - 12;
 }
 
killedBy: computeTooltipTop positions the tooltip above the caret
statusReason: expected 143 to be 163 // Object.is equality
