[Killed] ArithmeticOperator
components/entities/chart/chart-data.ts:365:10
   tooltipHeight: number,
   scrollY: number,
 ): number {
-  return triggerTop + scrollY - tooltipHeight + caretY - 12;
+  return triggerTop + scrollY - tooltipHeight + caretY + 12;
 }
 
killedBy: computeTooltipTop positions the tooltip above the caret
statusReason: expected 187 to be 163 // Object.is equality
