[Killed] BlockStatement
components/entities/map/map-utils.ts:9:80
 };
 
 /** Duration between two ISO timestamps, in seconds (`end - start`). */
-export function getDurationSeconds(startTime: string, endTime: string): number {
-  return (new Date(endTime).getTime() - new Date(startTime).getTime()) / 1000;
-}
+export function getDurationSeconds(startTime: string, endTime: string): number {}
 
 /**
killedBy: getDurationSeconds returns the end-minus-start span in seconds
statusReason: expected undefined to be 90 // Object.is equality

[Killed] ArithmeticOperator
components/entities/map/map-utils.ts:10:10
 
 /** Duration between two ISO timestamps, in seconds (`end - start`). */
 export function getDurationSeconds(startTime: string, endTime: string): number {
-  return (new Date(endTime).getTime() - new Date(startTime).getTime()) / 1000;
+  return (new Date(endTime).getTime() - new Date(startTime).getTime()) * 1000;
 }
 
killedBy: getDurationSeconds returns the end-minus-start span in seconds
statusReason: expected 90000000 to be 90 // Object.is equality

[Killed] ArithmeticOperator
components/entities/map/map-utils.ts:10:11
 
 /** Duration between two ISO timestamps, in seconds (`end - start`). */
 export function getDurationSeconds(startTime: string, endTime: string): number {
-  return (new Date(endTime).getTime() - new Date(startTime).getTime()) / 1000;
+  return (new Date(endTime).getTime() + new Date(startTime).getTime()) / 1000;
 }
 
killedBy: getDurationSeconds returns the end-minus-start span in seconds
statusReason: expected 3155673690 to be 90 // Object.is equality

[Killed] BlockStatement
components/entities/map/map-utils.ts:22:11
   resolutions: ProductResolution[],
   durationSeconds: number,
   maxPointNumber: number,
-): number {
-  let downsamplingFactor = 1;
-  for (let i = 0; i < resolutions.length; i++) {
-    const resolution = resolutions[i];
-    const nextResolution = resolutions[i + 1];
-    const pointsForDuration =
-      durationSeconds / resolution.nominal_data_interval_seconds;
-
-    if (pointsForDuration < maxPointNumber || nextResolution == null) {
-      downsamplingFactor = resolution.downsampling_factor;
-      break;
-    }
-  }
-  return downsamplingFactor;
-}
+): number {}
 
 /**
killedBy: computeDownsamplingFactor returns 1 when there are no resolutions
statusReason: expected undefined to be 1 // Object.is equality

[Killed] ConditionalExpression
components/entities/map/map-utils.ts:24:19
   maxPointNumber: number,
 ): number {
   let downsamplingFactor = 1;
-  for (let i = 0; i < resolutions.length; i++) {
+  for (let i = 0; false; i++) {
     const resolution = resolutions[i];
     const nextResolution = resolutions[i + 1];
killedBy: computeDownsamplingFactor skips too-dense resolutions until one fits the cap
statusReason: expected 1 to be 4 // Object.is equality

[Killed] BlockStatement
components/entities/map/map-utils.ts:24:48
   maxPointNumber: number,
 ): number {
   let downsamplingFactor = 1;
-  for (let i = 0; i < resolutions.length; i++) {
-    const resolution = resolutions[i];
-    const nextResolution = resolutions[i + 1];
-    const pointsForDuration =
-      durationSeconds / resolution.nominal_data_interval_seconds;
-
-    if (pointsForDuration < maxPointNumber || nextResolution == null) {
-      downsamplingFactor = resolution.downsampling_factor;
-      break;
-    }
-  }
+  for (let i = 0; i < resolutions.length; i++) {}
   return downsamplingFactor;
 }
killedBy: computeDownsamplingFactor skips too-dense resolutions until one fits the cap
statusReason: expected 1 to be 4 // Object.is equality

[Killed] ArithmeticOperator
components/entities/map/map-utils.ts:26:40
   let downsamplingFactor = 1;
   for (let i = 0; i < resolutions.length; i++) {
     const resolution = resolutions[i];
-    const nextResolution = resolutions[i + 1];
+    const nextResolution = resolutions[i - 1];
     const pointsForDuration =
       durationSeconds / resolution.nominal_data_interval_seconds;
killedBy: computeDownsamplingFactor skips too-dense resolutions until one fits the cap
statusReason: expected 1 to be 4 // Object.is equality

[Killed] ConditionalExpression
components/entities/map/map-utils.ts:30:9
     const pointsForDuration =
       durationSeconds / resolution.nominal_data_interval_seconds;
 
-    if (pointsForDuration < maxPointNumber || nextResolution == null) {
+    if (true) {
       downsamplingFactor = resolution.downsampling_factor;
       break;
killedBy: computeDownsamplingFactor skips too-dense resolutions until one fits the cap
statusReason: expected 1 to be 4 // Object.is equality

[Killed] EqualityOperator
components/entities/map/map-utils.ts:30:47
     const pointsForDuration =
       durationSeconds / resolution.nominal_data_interval_seconds;
 
-    if (pointsForDuration < maxPointNumber || nextResolution == null) {
+    if (pointsForDuration < maxPointNumber || nextResolution != null) {
       downsamplingFactor = resolution.downsampling_factor;
       break;
killedBy: computeDownsamplingFactor skips too-dense resolutions until one fits the cap
statusReason: expected 1 to be 4 // Object.is equality

[Killed] BlockStatement
components/entities/map/map-utils.ts:45:3
 export function extractMapPoints(results: { result: DataResponse }[]): {
   downsampling: number;
   points: Location[];
-} {
-  let downsampling = 1;
-  const points: Location[] = [];
-
-  results.forEach(({ result }) => {
-    downsampling = result.downsampling_factor;
-    result.data.forEach((d) => {
-      const location = d.location as unknown as Location | undefined;
-      if (!location) {
-        return;
-      }
-      points.push({
-        latitude: location.latitude,
-        longitude: location.longitude,
-      });
-    });
-  });
-
-  return { downsampling, points };
-}
+} {}
 
killedBy: extractMapPoints returns downsampling 1 and no points for empty results
statusReason: expected undefined to deeply equal { downsampling: 1, points: [] }

[Killed] BlockStatement
components/entities/map/map-utils.ts:49:35
   let downsampling = 1;
   const points: Location[] = [];
 
-  results.forEach(({ result }) => {
-    downsampling = result.downsampling_factor;
-    result.data.forEach((d) => {
-      const location = d.location as unknown as Location | undefined;
-      if (!location) {
-        return;
-      }
-      points.push({
-        latitude: location.latitude,
-        longitude: location.longitude,
-      });
-    });
-  });
+  results.forEach(({ result }) => {});
 
   return { downsampling, points };
killedBy: extractMapPoints collects lat/lng points and the result's downsampling factor
statusReason: expected { downsampling: 1, points: [] } to deeply equal { downsampling: 4, points: [ …(2) ] }

[Killed] BlockStatement
components/entities/map/map-utils.ts:51:32
 
   results.forEach(({ result }) => {
     downsampling = result.downsampling_factor;
-    result.data.forEach((d) => {
-      const location = d.location as unknown as Location | undefined;
-      if (!location) {
-        return;
-      }
-      points.push({
-        latitude: location.latitude,
-        longitude: location.longitude,
-      });
-    });
+    result.data.forEach((d) => {});
   });
 
killedBy: extractMapPoints collects lat/lng points and the result's downsampling factor
statusReason: expected { downsampling: 4, points: [] } to deeply equal { downsampling: 4, points: [ …(2) ] }

[Killed] BooleanLiteral
components/entities/map/map-utils.ts:53:11
     downsampling = result.downsampling_factor;
     result.data.forEach((d) => {
       const location = d.location as unknown as Location | undefined;
-      if (!location) {
+      if (location) {
         return;
       }
killedBy: extractMapPoints collects lat/lng points and the result's downsampling factor
statusReason: expected { downsampling: 4, points: [] } to deeply equal { downsampling: 4, points: [ …(2) ] }

[Killed] ConditionalExpression
components/entities/map/map-utils.ts:53:11
     downsampling = result.downsampling_factor;
     result.data.forEach((d) => {
       const location = d.location as unknown as Location | undefined;
-      if (!location) {
+      if (true) {
         return;
       }
killedBy: extractMapPoints collects lat/lng points and the result's downsampling factor
statusReason: expected { downsampling: 4, points: [] } to deeply equal { downsampling: 4, points: [ …(2) ] }

[Killed] ObjectLiteral
components/entities/map/map-utils.ts:56:19
       if (!location) {
         return;
       }
-      points.push({
-        latitude: location.latitude,
-        longitude: location.longitude,
-      });
+      points.push({});
     });
   });
killedBy: extractMapPoints collects lat/lng points and the result's downsampling factor
statusReason: expected { downsampling: 4, points: [ {}, {} ] } to deeply equal { downsampling: 4, points: [ …(2) ] }
