[Killed] BlockStatement
components/entities/table/table-utils.ts:15:74
 >;
 
 /** Map a product field type to the corresponding ag-grid floating-filter type. */
-export function getAGGridFilterType(type: ProductField["type"] | string) {
-  switch (type) {
-    case "int":
-    case "float":
-      return "agNumberColumnFilter";
-    case "str":
-    case "bool":
-    case "dict":
-      return "agTextColumnFilter";
-    case "datetime":
-      return "agDateColumnFilter";
-    default:
-      return true;
-  }
-}
+export function getAGGridFilterType(type: ProductField["type"] | string) {}
 
 /**
killedBy: getAGGridFilterType maps each known field type to its ag-grid filter
statusReason: expected undefined to be 'agNumberColumnFilter' // Object.is equality

[Killed] StringLiteral
components/entities/table/table-utils.ts:17:10
 /** Map a product field type to the corresponding ag-grid floating-filter type. */
 export function getAGGridFilterType(type: ProductField["type"] | string) {
   switch (type) {
-    case "int":
+    case "":
     case "float":
       return "agNumberColumnFilter";
killedBy: getAGGridFilterType maps each known field type to its ag-grid filter
statusReason: expected true to be 'agNumberColumnFilter' // Object.is equality

[Killed] ConditionalExpression
components/entities/table/table-utils.ts:18:5
 export function getAGGridFilterType(type: ProductField["type"] | string) {
   switch (type) {
     case "int":
-    case "float":
-      return "agNumberColumnFilter";
+    case "float":
     case "str":
     case "bool":
killedBy: getAGGridFilterType maps each known field type to its ag-grid filter
statusReason: expected 'agTextColumnFilter' to be 'agNumberColumnFilter' // Object.is equality

[Killed] StringLiteral
components/entities/table/table-utils.ts:18:10
 export function getAGGridFilterType(type: ProductField["type"] | string) {
   switch (type) {
     case "int":
-    case "float":
+    case "":
       return "agNumberColumnFilter";
     case "str":
killedBy: getAGGridFilterType maps each known field type to its ag-grid filter
statusReason: expected true to be 'agNumberColumnFilter' // Object.is equality

[Killed] StringLiteral
components/entities/table/table-utils.ts:19:14
   switch (type) {
     case "int":
     case "float":
-      return "agNumberColumnFilter";
+      return "";
     case "str":
     case "bool":
killedBy: getAGGridFilterType maps each known field type to its ag-grid filter
statusReason: expected '' to be 'agNumberColumnFilter' // Object.is equality

[Killed] StringLiteral
components/entities/table/table-utils.ts:20:10
     case "int":
     case "float":
       return "agNumberColumnFilter";
-    case "str":
+    case "":
     case "bool":
     case "dict":
killedBy: getAGGridFilterType maps each known field type to its ag-grid filter
statusReason: expected true to be 'agTextColumnFilter' // Object.is equality

[Killed] ConditionalExpression
components/entities/table/table-utils.ts:22:5
       return "agNumberColumnFilter";
     case "str":
     case "bool":
-    case "dict":
-      return "agTextColumnFilter";
+    case "dict":
     case "datetime":
       return "agDateColumnFilter";
killedBy: getAGGridFilterType maps each known field type to its ag-grid filter
statusReason: expected 'agDateColumnFilter' to be 'agTextColumnFilter' // Object.is equality

[Killed] ConditionalExpression
components/entities/table/table-utils.ts:24:5
     case "bool":
     case "dict":
       return "agTextColumnFilter";
-    case "datetime":
-      return "agDateColumnFilter";
+    case "datetime":
     default:
       return true;
killedBy: getAGGridFilterType maps each known field type to its ag-grid filter
statusReason: expected true to be 'agDateColumnFilter' // Object.is equality

[Killed] StringLiteral
components/entities/table/table-utils.ts:24:10
     case "bool":
     case "dict":
       return "agTextColumnFilter";
-    case "datetime":
+    case "":
       return "agDateColumnFilter";
     default:
killedBy: getAGGridFilterType maps each known field type to its ag-grid filter
statusReason: expected true to be 'agDateColumnFilter' // Object.is equality

[Killed] ConditionalExpression
components/entities/table/table-utils.ts:26:5
       return "agTextColumnFilter";
     case "datetime":
       return "agDateColumnFilter";
-    default:
-      return true;
+    default:
   }
 }
killedBy: getAGGridFilterType returns true for unknown types
statusReason: expected undefined to be true // Object.is equality

[Killed] BooleanLiteral
components/entities/table/table-utils.ts:27:14
     case "datetime":
       return "agDateColumnFilter";
     default:
-      return true;
+      return false;
   }
 }
killedBy: getAGGridFilterType returns true for unknown types
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
components/entities/table/table-utils.ts:37:32
  */
 export function getFieldDisplayValue(
   fieldData: TableFieldValue,
-): string | number | undefined {
-  if (typeof fieldData !== "object") {
-    return fieldData;
-  }
-  if (Object.prototype.hasOwnProperty.call(fieldData, "value")) {
-    return fieldData.value;
-  }
-  if (Object.prototype.hasOwnProperty.call(fieldData, "avg")) {
-    return fieldData.avg;
-  }
-  if (
-    Object.prototype.hasOwnProperty.call(fieldData, "min") &&
-    Object.prototype.hasOwnProperty.call(fieldData, "max")
-  ) {
-    return `${fieldData.min} – ${fieldData.max}`;
-  }
-}
+): string | number | undefined {}
 
 /**
killedBy: getFieldDisplayValue returns a raw non-object value as-is
statusReason: expected undefined to be 5 // Object.is equality

[Killed] ConditionalExpression
components/entities/table/table-utils.ts:38:7
 export function getFieldDisplayValue(
   fieldData: TableFieldValue,
 ): string | number | undefined {
-  if (typeof fieldData !== "object") {
+  if (false) {
     return fieldData;
   }
killedBy: getFieldDisplayValue returns a raw non-object value as-is
statusReason: expected undefined to be 5 // Object.is equality

[Killed] ConditionalExpression
components/entities/table/table-utils.ts:38:7
 export function getFieldDisplayValue(
   fieldData: TableFieldValue,
 ): string | number | undefined {
-  if (typeof fieldData !== "object") {
+  if (true) {
     return fieldData;
   }
killedBy: getFieldDisplayValue prefers value, then avg, then a min–max range
statusReason: expected { value: 3 } to be 3 // Object.is equality

[Killed] ConditionalExpression
components/entities/table/table-utils.ts:41:7
   if (typeof fieldData !== "object") {
     return fieldData;
   }
-  if (Object.prototype.hasOwnProperty.call(fieldData, "value")) {
+  if (true) {
     return fieldData.value;
   }
killedBy: getFieldDisplayValue prefers value, then avg, then a min–max range
statusReason: expected undefined to be 4 // Object.is equality

[Killed] BlockStatement
components/entities/table/table-utils.ts:41:65
   if (typeof fieldData !== "object") {
     return fieldData;
   }
-  if (Object.prototype.hasOwnProperty.call(fieldData, "value")) {
-    return fieldData.value;
-  }
+  if (Object.prototype.hasOwnProperty.call(fieldData, "value")) {}
   if (Object.prototype.hasOwnProperty.call(fieldData, "avg")) {
     return fieldData.avg;
killedBy: getFieldDisplayValue prefers value, then avg, then a min–max range
statusReason: expected undefined to be 3 // Object.is equality

[Killed] ConditionalExpression
components/entities/table/table-utils.ts:44:7
   if (Object.prototype.hasOwnProperty.call(fieldData, "value")) {
     return fieldData.value;
   }
-  if (Object.prototype.hasOwnProperty.call(fieldData, "avg")) {
+  if (true) {
     return fieldData.avg;
   }
killedBy: getFieldDisplayValue prefers value, then avg, then a min–max range
statusReason: expected undefined to be '1 – 9' // Object.is equality

[Killed] BlockStatement
components/entities/table/table-utils.ts:44:63
   if (Object.prototype.hasOwnProperty.call(fieldData, "value")) {
     return fieldData.value;
   }
-  if (Object.prototype.hasOwnProperty.call(fieldData, "avg")) {
-    return fieldData.avg;
-  }
+  if (Object.prototype.hasOwnProperty.call(fieldData, "avg")) {}
   if (
     Object.prototype.hasOwnProperty.call(fieldData, "min") &&
killedBy: getFieldDisplayValue prefers value, then avg, then a min–max range
statusReason: expected '1 – 9' to be 4 // Object.is equality

[Killed] ConditionalExpression
components/entities/table/table-utils.ts:48:5
     return fieldData.avg;
   }
   if (
-    Object.prototype.hasOwnProperty.call(fieldData, "min") &&
-    Object.prototype.hasOwnProperty.call(fieldData, "max")
+    false
   ) {
     return `${fieldData.min} – ${fieldData.max}`;
killedBy: getFieldDisplayValue prefers value, then avg, then a min–max range
statusReason: expected undefined to be '1 – 9' // Object.is equality

[Killed] LogicalOperator
components/entities/table/table-utils.ts:48:5
     return fieldData.avg;
   }
   if (
-    Object.prototype.hasOwnProperty.call(fieldData, "min") &&
-    Object.prototype.hasOwnProperty.call(fieldData, "max")
+    Object.prototype.hasOwnProperty.call(fieldData, "min") || Object.prototype.hasOwnProperty.call(fieldData, "max")
   ) {
     return `${fieldData.min} – ${fieldData.max}`;
killedBy: getFieldDisplayValue returns undefined when there is no usable field
statusReason: expected '1 – undefined' to be undefined

[Killed] StringLiteral
components/entities/table/table-utils.ts:49:53
   }
   if (
     Object.prototype.hasOwnProperty.call(fieldData, "min") &&
-    Object.prototype.hasOwnProperty.call(fieldData, "max")
+    Object.prototype.hasOwnProperty.call(fieldData, "")
   ) {
     return `${fieldData.min} – ${fieldData.max}`;
killedBy: getFieldDisplayValue prefers value, then avg, then a min–max range
statusReason: expected undefined to be '1 – 9' // Object.is equality

[Killed] BlockStatement
components/entities/table/table-utils.ts:50:5
   if (
     Object.prototype.hasOwnProperty.call(fieldData, "min") &&
     Object.prototype.hasOwnProperty.call(fieldData, "max")
-  ) {
-    return `${fieldData.min} – ${fieldData.max}`;
-  }
+  ) {}
 }
 
killedBy: getFieldDisplayValue prefers value, then avg, then a min–max range
statusReason: expected undefined to be '1 – 9' // Object.is equality

[Killed] StringLiteral
components/entities/table/table-utils.ts:51:12
     Object.prototype.hasOwnProperty.call(fieldData, "min") &&
     Object.prototype.hasOwnProperty.call(fieldData, "max")
   ) {
-    return `${fieldData.min} – ${fieldData.max}`;
+    return ``;
   }
 }
killedBy: getFieldDisplayValue prefers value, then avg, then a min–max range
statusReason: expected '' to be '1 – 9' // Object.is equality

[Killed] BlockStatement
components/entities/table/table-utils.ts:63:11
   value: string,
   type: string | undefined,
   dateFormat: string | undefined,
-): string {
-  if (type === "datetime" && dateFormat === "short") {
-    return value.split("T")[0];
-  } else if (type === "datetime") {
-    return value.split("+")[0];
-  }
-
-  if (value === "") {
-    return "-";
-  }
-
-  return value;
-}
+): string {}
 
 /**
killedBy: formatTableCellValue truncates a short datetime to the day
statusReason: expected undefined to be '2020-01-02' // Object.is equality

[Killed] EqualityOperator
components/entities/table/table-utils.ts:64:30
   type: string | undefined,
   dateFormat: string | undefined,
 ): string {
-  if (type === "datetime" && dateFormat === "short") {
+  if (type === "datetime" && dateFormat !== "short") {
     return value.split("T")[0];
   } else if (type === "datetime") {
killedBy: formatTableCellValue truncates a short datetime to the day
statusReason: expected '2020-01-02T03:04:05' to be '2020-01-02' // Object.is equality

[Killed] EqualityOperator
components/entities/table/table-utils.ts:64:7
   type: string | undefined,
   dateFormat: string | undefined,
 ): string {
-  if (type === "datetime" && dateFormat === "short") {
+  if (type !== "datetime" && dateFormat === "short") {
     return value.split("T")[0];
   } else if (type === "datetime") {
killedBy: formatTableCellValue truncates a short datetime to the day
statusReason: expected '2020-01-02T03:04:05' to be '2020-01-02' // Object.is equality

[Killed] ConditionalExpression
components/entities/table/table-utils.ts:66:14
 ): string {
   if (type === "datetime" && dateFormat === "short") {
     return value.split("T")[0];
-  } else if (type === "datetime") {
+  } else if (true) {
     return value.split("+")[0];
   }
killedBy: formatTableCellValue renders an empty value as a dash
statusReason: expected '' to be '-' // Object.is equality

[Killed] ConditionalExpression
components/entities/table/table-utils.ts:66:14
 ): string {
   if (type === "datetime" && dateFormat === "short") {
     return value.split("T")[0];
-  } else if (type === "datetime") {
+  } else if (false) {
     return value.split("+")[0];
   }
killedBy: formatTableCellValue truncates a full datetime at the offset boundary
statusReason: expected '2020-01-02T03:04:05+00:00' to be '2020-01-02T03:04:05' // Object.is equality

[Killed] ConditionalExpression
components/entities/table/table-utils.ts:70:7
     return value.split("+")[0];
   }
 
-  if (value === "") {
+  if (false) {
     return "-";
   }
killedBy: formatTableCellValue renders an empty value as a dash
statusReason: expected '' to be '-' // Object.is equality

[Killed] BlockStatement
components/entities/table/table-utils.ts:70:21
     return value.split("+")[0];
   }
 
-  if (value === "") {
-    return "-";
-  }
+  if (value === "") {}
 
   return value;
killedBy: formatTableCellValue renders an empty value as a dash
statusReason: expected '' to be '-' // Object.is equality

[Killed] StringLiteral
components/entities/table/table-utils.ts:71:12
   }
 
   if (value === "") {
-    return "-";
+    return "";
   }
 
killedBy: formatTableCellValue renders an empty value as a dash
statusReason: expected '' to be '-' // Object.is equality

[Killed] BlockStatement
components/entities/table/table-utils.ts:84:11
 export function formatTimestampValue(
   value: string,
   collapseByDay: boolean,
-): string {
-  if (collapseByDay) {
-    return value.split("T")[0];
-  }
-  return value.split("+")[0];
-}
+): string {}
 
 /**
killedBy: formatTimestampValue truncates to the day when collapsing by day
statusReason: expected undefined to be '2020-01-02' // Object.is equality

[Killed] ConditionalExpression
components/entities/table/table-utils.ts:85:7
   value: string,
   collapseByDay: boolean,
 ): string {
-  if (collapseByDay) {
+  if (true) {
     return value.split("T")[0];
   }
killedBy: formatTimestampValue truncates at the offset boundary otherwise
statusReason: expected '2020-01-02' to be '2020-01-02T03:04:05' // Object.is equality

[Killed] ConditionalExpression
components/entities/table/table-utils.ts:85:7
   value: string,
   collapseByDay: boolean,
 ): string {
-  if (collapseByDay) {
+  if (false) {
     return value.split("T")[0];
   }
killedBy: formatTimestampValue truncates to the day when collapsing by day
statusReason: expected '2020-01-02T03:04:05' to be '2020-01-02' // Object.is equality

[Killed] StringLiteral
components/entities/table/table-utils.ts:86:24
   collapseByDay: boolean,
 ): string {
   if (collapseByDay) {
-    return value.split("T")[0];
+    return value.split("")[0];
   }
   return value.split("+")[0];
killedBy: formatTimestampValue truncates to the day when collapsing by day
statusReason: expected '2' to be '2020-01-02' // Object.is equality

[Killed] StringLiteral
components/entities/table/table-utils.ts:88:22
   if (collapseByDay) {
     return value.split("T")[0];
   }
-  return value.split("+")[0];
+  return value.split("")[0];
 }
 
killedBy: formatTimestampValue truncates at the offset boundary otherwise
statusReason: expected '2' to be '2020-01-02T03:04:05' // Object.is equality

[Killed] StringLiteral
components/entities/table/table-utils.ts:100:25
   rowData: Record<string, ProcessedDataResponseDataEntry> | null | undefined,
   columns: TableColumn[],
 ): Status {
-  let tripped: Status = "nominal";
+  let tripped: Status = "";
   for (let i = 0; i < columns.length; i++) {
     const column = columns[i];
killedBy: deriveRowTrippedStatus is nominal with no columns or no row data
statusReason: expected '' to be 'nominal' // Object.is equality

[Killed] EqualityOperator
components/entities/table/table-utils.ts:101:19
   columns: TableColumn[],
 ): Status {
   let tripped: Status = "nominal";
-  for (let i = 0; i < columns.length; i++) {
+  for (let i = 0; i >= columns.length; i++) {
     const column = columns[i];
 
killedBy: deriveRowTrippedStatus is nominal with no columns or no row data
statusReason: Cannot read properties of undefined (reading 'layerId')

[Killed] EqualityOperator
components/entities/table/table-utils.ts:101:19
   columns: TableColumn[],
 ): Status {
   let tripped: Status = "nominal";
-  for (let i = 0; i < columns.length; i++) {
+  for (let i = 0; i <= columns.length; i++) {
     const column = columns[i];
 
killedBy: deriveRowTrippedStatus is nominal with no columns or no row data
statusReason: Cannot read properties of undefined (reading 'layerId')

[Killed] LogicalOperator
components/entities/table/table-utils.ts:106:7
 
     // For each column, see if the row has tripped any thresholds
     if (
-      !rowData ||
-      !(column.layerId in rowData) ||
-      !(column.field in rowData[column.layerId]) ||
+      (!rowData || !(column.layerId in rowData)) && !(column.field in rowData[column.layerId]) ||
       !rowData[column.layerId][column.field] ||
       !rowData[column.layerId][column.field]._thresholds
killedBy: deriveRowTrippedStatus is nominal with no columns or no row data
statusReason: Cannot read properties of null (reading 'L')

[Killed] LogicalOperator
components/entities/table/table-utils.ts:106:7
 
     // For each column, see if the row has tripped any thresholds
     if (
-      !rowData ||
-      !(column.layerId in rowData) ||
-      !(column.field in rowData[column.layerId]) ||
-      !rowData[column.layerId][column.field] ||
+      (!rowData || !(column.layerId in rowData) || !(column.field in rowData[column.layerId])) && !rowData[column.layerId][column.field] ||
       !rowData[column.layerId][column.field]._thresholds
     ) {
killedBy: deriveRowTrippedStatus is nominal with no columns or no row data
statusReason: Cannot read properties of null (reading 'L')

[Killed] BooleanLiteral
components/entities/table/table-utils.ts:107:7
     // For each column, see if the row has tripped any thresholds
     if (
       !rowData ||
-      !(column.layerId in rowData) ||
+      column.layerId in rowData ||
       !(column.field in rowData[column.layerId]) ||
       !rowData[column.layerId][column.field] ||
killedBy: deriveRowTrippedStatus skips columns whose layer/field is absent from the row
statusReason: Cannot use 'in' operator to search for 'f' in undefined

[Killed] BooleanLiteral
components/entities/table/table-utils.ts:108:7
     if (
       !rowData ||
       !(column.layerId in rowData) ||
-      !(column.field in rowData[column.layerId]) ||
+      column.field in rowData[column.layerId] ||
       !rowData[column.layerId][column.field] ||
       !rowData[column.layerId][column.field]._thresholds
killedBy: deriveRowTrippedStatus returns error when a limit (lower or upper) is tripped
statusReason: expected 'nominal' to be 'error' // Object.is equality

[Killed] BooleanLiteral
components/entities/table/table-utils.ts:109:7
       !rowData ||
       !(column.layerId in rowData) ||
       !(column.field in rowData[column.layerId]) ||
-      !rowData[column.layerId][column.field] ||
+      rowData[column.layerId][column.field] ||
       !rowData[column.layerId][column.field]._thresholds
     ) {
killedBy: deriveRowTrippedStatus skips cells that are missing or lack computed thresholds
statusReason: Cannot read properties of undefined (reading '_thresholds')

[Killed] BooleanLiteral
components/entities/table/table-utils.ts:110:7
       !(column.layerId in rowData) ||
       !(column.field in rowData[column.layerId]) ||
       !rowData[column.layerId][column.field] ||
-      !rowData[column.layerId][column.field]._thresholds
+      rowData[column.layerId][column.field]._thresholds
     ) {
       continue;
killedBy: deriveRowTrippedStatus skips cells that are missing or lack computed thresholds
statusReason: Cannot destructure property 'limits' of 'rowData[column.layerId][column.field]._thresholds' as it is undefined.

[Killed] BlockStatement
components/entities/table/table-utils.ts:111:7
       !(column.field in rowData[column.layerId]) ||
       !rowData[column.layerId][column.field] ||
       !rowData[column.layerId][column.field]._thresholds
-    ) {
-      continue;
-    }
+    ) {}
     const { limits, warnings }: ComputedThresholds =
       rowData[column.layerId][column.field]._thresholds!;
killedBy: deriveRowTrippedStatus is nominal with no columns or no row data
statusReason: Cannot read properties of null (reading 'L')

[Killed] BlockStatement
components/entities/table/table-utils.ts:117:39
     const { limits, warnings }: ComputedThresholds =
       rowData[column.layerId][column.field]._thresholds!;
 
-    if (limits.lower || limits.upper) {
-      tripped = "error";
-      break;
-    }
+    if (limits.lower || limits.upper) {}
 
     if (warnings.lower || warnings.upper) {
killedBy: deriveRowTrippedStatus returns error when a limit (lower or upper) is tripped
statusReason: expected 'nominal' to be 'error' // Object.is equality

[Killed] ConditionalExpression
components/entities/table/table-utils.ts:117:9
     const { limits, warnings }: ComputedThresholds =
       rowData[column.layerId][column.field]._thresholds!;
 
-    if (limits.lower || limits.upper) {
+    if (false) {
       tripped = "error";
       break;
killedBy: deriveRowTrippedStatus returns error when a limit (lower or upper) is tripped
statusReason: expected 'nominal' to be 'error' // Object.is equality

[Killed] BlockStatement
components/entities/table/table-utils.ts:122:43
       break;
     }
 
-    if (warnings.lower || warnings.upper) {
-      tripped = "warning";
-      break;
-    }
+    if (warnings.lower || warnings.upper) {}
   }
   return tripped;
killedBy: deriveRowTrippedStatus returns warning when only a warning (lower or upper) is tripped
statusReason: expected 'nominal' to be 'warning' // Object.is equality

[Killed] LogicalOperator
components/entities/table/table-utils.ts:122:9
       break;
     }
 
-    if (warnings.lower || warnings.upper) {
+    if (warnings.lower && warnings.upper) {
       tripped = "warning";
       break;
killedBy: deriveRowTrippedStatus returns warning when only a warning (lower or upper) is tripped
statusReason: expected 'nominal' to be 'warning' // Object.is equality

[Killed] BlockStatement
components/entities/table/table-utils.ts:131:62
 }
 
 /** Map a derived row threshold status to its ag-grid row CSS class (empty when nominal). */
-export function getRowThresholdClass(status: Status): string {
-  if (status === "error") {
-    return "limit-row";
-  }
-  if (status === "warning") {
-    return "warning-row";
-  }
-  return "";
-}
+export function getRowThresholdClass(status: Status): string {}
 
 /** Build the multi-line cell tooltip describing a field's computed limit/warning threshold values. */
killedBy: getRowThresholdClass maps a threshold status to its row CSS class
statusReason: expected undefined to be 'limit-row' // Object.is equality

[Killed] ConditionalExpression
components/entities/table/table-utils.ts:132:7
 
 /** Map a derived row threshold status to its ag-grid row CSS class (empty when nominal). */
 export function getRowThresholdClass(status: Status): string {
-  if (status === "error") {
+  if (true) {
     return "limit-row";
   }
killedBy: getRowThresholdClass maps a threshold status to its row CSS class
statusReason: expected 'limit-row' to be 'warning-row' // Object.is equality

[Killed] ConditionalExpression
components/entities/table/table-utils.ts:132:7
 
 /** Map a derived row threshold status to its ag-grid row CSS class (empty when nominal). */
 export function getRowThresholdClass(status: Status): string {
-  if (status === "error") {
+  if (false) {
     return "limit-row";
   }
killedBy: getRowThresholdClass maps a threshold status to its row CSS class
statusReason: expected '' to be 'limit-row' // Object.is equality

[Killed] ConditionalExpression
components/entities/table/table-utils.ts:135:7
   if (status === "error") {
     return "limit-row";
   }
-  if (status === "warning") {
+  if (true) {
     return "warning-row";
   }
killedBy: getRowThresholdClass maps a threshold status to its row CSS class
statusReason: expected 'warning-row' to be '' // Object.is equality

[Killed] BlockStatement
components/entities/table/table-utils.ts:135:29
   if (status === "error") {
     return "limit-row";
   }
-  if (status === "warning") {
-    return "warning-row";
-  }
+  if (status === "warning") {}
   return "";
 }
killedBy: getRowThresholdClass maps a threshold status to its row CSS class
statusReason: expected '' to be 'warning-row' // Object.is equality

[Killed] BlockStatement
components/entities/table/table-utils.ts:146:11
   label: string | undefined,
   limits: ComputedThresholds["limits"],
   warnings: ComputedThresholds["warnings"],
-): string {
-  return (
-    `Field: ${label} \n` +
-    `Lower limit value: ${limits.lower_value ?? "-"} \n` +
-    `Upper limit value: ${limits.upper_value ?? "-"} \n` +
-    `Lower warning value: ${warnings.lower_value ?? "-"} \n` +
-    `Upper warning value: ${warnings.upper_value ?? "-"}`
-  );
-}
+): string {}
 
killedBy: buildThresholdTooltip renders each limit/warning value on its own line
statusReason: expected undefined to be 'Field: Temp \nLower limit value: 10 \…' // Object.is equality

[Killed] LogicalOperator
components/entities/table/table-utils.ts:149:27
 ): string {
   return (
     `Field: ${label} \n` +
-    `Lower limit value: ${limits.lower_value ?? "-"} \n` +
+    `Lower limit value: ${limits.lower_value && "-"} \n` +
     `Upper limit value: ${limits.upper_value ?? "-"} \n` +
     `Lower warning value: ${warnings.lower_value ?? "-"} \n` +
killedBy: buildThresholdTooltip renders each limit/warning value on its own line
statusReason: expected 'Field: Temp \nLower limit value: - \n…' to be 'Field: Temp \nLower limit value: 10 \…' // Object.is equality

[Killed] LogicalOperator
components/entities/table/table-utils.ts:150:27
   return (
     `Field: ${label} \n` +
     `Lower limit value: ${limits.lower_value ?? "-"} \n` +
-    `Upper limit value: ${limits.upper_value ?? "-"} \n` +
+    `Upper limit value: ${limits.upper_value && "-"} \n` +
     `Lower warning value: ${warnings.lower_value ?? "-"} \n` +
     `Upper warning value: ${warnings.upper_value ?? "-"}`
killedBy: buildThresholdTooltip renders each limit/warning value on its own line
statusReason: expected 'Field: Temp \nLower limit value: 10 \…' to be 'Field: Temp \nLower limit value: 10 \…' // Object.is equality

[Killed] LogicalOperator
components/entities/table/table-utils.ts:151:29
     `Field: ${label} \n` +
     `Lower limit value: ${limits.lower_value ?? "-"} \n` +
     `Upper limit value: ${limits.upper_value ?? "-"} \n` +
-    `Lower warning value: ${warnings.lower_value ?? "-"} \n` +
+    `Lower warning value: ${warnings.lower_value && "-"} \n` +
     `Upper warning value: ${warnings.upper_value ?? "-"}`
   );
killedBy: buildThresholdTooltip renders each limit/warning value on its own line
statusReason: expected 'Field: Temp \nLower limit value: 10 \…' to be 'Field: Temp \nLower limit value: 10 \…' // Object.is equality

[Killed] StringLiteral
components/entities/table/table-utils.ts:151:53
     `Field: ${label} \n` +
     `Lower limit value: ${limits.lower_value ?? "-"} \n` +
     `Upper limit value: ${limits.upper_value ?? "-"} \n` +
-    `Lower warning value: ${warnings.lower_value ?? "-"} \n` +
+    `Lower warning value: ${warnings.lower_value ?? ""} \n` +
     `Upper warning value: ${warnings.upper_value ?? "-"}`
   );
killedBy: buildThresholdTooltip renders a dash for each missing (null) threshold value
statusReason: expected 'Field: Temp \nLower limit value: - \n…' to be 'Field: Temp \nLower limit value: - \n…' // Object.is equality

[Killed] LogicalOperator
components/entities/table/table-utils.ts:152:29
     `Lower limit value: ${limits.lower_value ?? "-"} \n` +
     `Upper limit value: ${limits.upper_value ?? "-"} \n` +
     `Lower warning value: ${warnings.lower_value ?? "-"} \n` +
-    `Upper warning value: ${warnings.upper_value ?? "-"}`
+    `Upper warning value: ${warnings.upper_value && "-"}`
   );
 }
killedBy: buildThresholdTooltip renders each limit/warning value on its own line
statusReason: expected 'Field: Temp \nLower limit value: 10 \…' to be 'Field: Temp \nLower limit value: 10 \…' // Object.is equality
