[Killed] ConditionalExpression
components/ui/DataGrid/data-grid-utils.ts:8:7
 export function getFilterDisplayText(
   filterModel: Record<string, unknown> | null | undefined,
 ): string {
-  if (!filterModel) return "";
+  if (true) return "";
 
   const { type, filter, filterTo, operator } = filterModel as {
killedBy: getFilterDisplayText renders each numeric/text comparison type
statusReason: expected '' to be '= 5' // Object.is equality

[Killed] BooleanLiteral
components/ui/DataGrid/data-grid-utils.ts:8:7
 export function getFilterDisplayText(
   filterModel: Record<string, unknown> | null | undefined,
 ): string {
-  if (!filterModel) return "";
+  if (filterModel) return "";
 
   const { type, filter, filterTo, operator } = filterModel as {
killedBy: getFilterDisplayText returns empty string for a nullish filter model
statusReason: Cannot destructure property 'type' of 'filterModel' as it is null.

[Killed] ConditionalExpression
components/ui/DataGrid/data-grid-utils.ts:19:7
     type?: string;
   };
 
-  if (operator) {
+  if (false) {
     // Combined filter (AND/OR)
     const { condition1, condition2 } = filterModel as {
killedBy: getFilterDisplayText combines two conditions with the uppercased operator
statusReason: expected '' to be '> 1 AND < 9' // Object.is equality

[Killed] ConditionalExpression
components/ui/DataGrid/data-grid-utils.ts:19:7
     type?: string;
   };
 
-  if (operator) {
+  if (true) {
     // Combined filter (AND/OR)
     const { condition1, condition2 } = filterModel as {
killedBy: getFilterDisplayText renders each numeric/text comparison type
statusReason: Cannot read properties of undefined (reading 'toUpperCase')

[Killed] MethodExpression
components/ui/DataGrid/data-grid-utils.ts:27:24
     };
     const text1 = getFilterDisplayText(condition1);
     const text2 = getFilterDisplayText(condition2);
-    return `${text1} ${operator.toUpperCase()} ${text2}`;
+    return `${text1} ${operator.toLowerCase()} ${text2}`;
   }
 
killedBy: getFilterDisplayText combines two conditions with the uppercased operator
statusReason: expected '> 1 and < 9' to be '> 1 AND < 9' // Object.is equality

[Killed] ConditionalExpression
components/ui/DataGrid/data-grid-utils.ts:32:5
 
   let text: string;
   switch (type) {
-    case "equals":
-      text = `= ${filter}`;
-      break;
+    case "equals":
     case "notEqual":
       text = `≠ ${filter}`;
killedBy: getFilterDisplayText renders each numeric/text comparison type
statusReason: expected '≠ 5' to be '= 5' // Object.is equality

[Killed] StringLiteral
components/ui/DataGrid/data-grid-utils.ts:32:10
 
   let text: string;
   switch (type) {
-    case "equals":
+    case "":
       text = `= ${filter}`;
       break;
killedBy: getFilterDisplayText renders each numeric/text comparison type
statusReason: expected '5' to be '= 5' // Object.is equality

[Killed] ConditionalExpression
components/ui/DataGrid/data-grid-utils.ts:35:5
     case "equals":
       text = `= ${filter}`;
       break;
-    case "notEqual":
-      text = `≠ ${filter}`;
-      break;
+    case "notEqual":
     case "lessThan":
       text = `< ${filter}`;
killedBy: getFilterDisplayText renders each numeric/text comparison type
statusReason: expected '< 5' to be '≠ 5' // Object.is equality

[Killed] StringLiteral
components/ui/DataGrid/data-grid-utils.ts:35:10
     case "equals":
       text = `= ${filter}`;
       break;
-    case "notEqual":
+    case "":
       text = `≠ ${filter}`;
       break;
killedBy: getFilterDisplayText renders each numeric/text comparison type
statusReason: expected '5' to be '≠ 5' // Object.is equality

[Killed] ConditionalExpression
components/ui/DataGrid/data-grid-utils.ts:38:5
     case "notEqual":
       text = `≠ ${filter}`;
       break;
-    case "lessThan":
-      text = `< ${filter}`;
-      break;
+    case "lessThan":
     case "lessThanOrEqual":
       text = `≤ ${filter}`;
killedBy: getFilterDisplayText renders each numeric/text comparison type
statusReason: expected '≤ 5' to be '< 5' // Object.is equality

[Killed] ConditionalExpression
components/ui/DataGrid/data-grid-utils.ts:41:5
     case "lessThan":
       text = `< ${filter}`;
       break;
-    case "lessThanOrEqual":
-      text = `≤ ${filter}`;
-      break;
+    case "lessThanOrEqual":
     case "greaterThan":
       text = `> ${filter}`;
killedBy: getFilterDisplayText renders each numeric/text comparison type
statusReason: expected '> 5' to be '≤ 5' // Object.is equality

[Killed] StringLiteral
components/ui/DataGrid/data-grid-utils.ts:41:10
     case "lessThan":
       text = `< ${filter}`;
       break;
-    case "lessThanOrEqual":
+    case "":
       text = `≤ ${filter}`;
       break;
killedBy: getFilterDisplayText renders each numeric/text comparison type
statusReason: expected '5' to be '≤ 5' // Object.is equality

[Killed] ConditionalExpression
components/ui/DataGrid/data-grid-utils.ts:44:5
     case "lessThanOrEqual":
       text = `≤ ${filter}`;
       break;
-    case "greaterThan":
-      text = `> ${filter}`;
-      break;
+    case "greaterThan":
     case "greaterThanOrEqual":
       text = `≥ ${filter}`;
killedBy: getFilterDisplayText renders each numeric/text comparison type
statusReason: expected '≥ 5' to be '> 5' // Object.is equality

[Killed] StringLiteral
components/ui/DataGrid/data-grid-utils.ts:44:10
     case "lessThanOrEqual":
       text = `≤ ${filter}`;
       break;
-    case "greaterThan":
+    case "":
       text = `> ${filter}`;
       break;
killedBy: getFilterDisplayText renders each numeric/text comparison type
statusReason: expected '5' to be '> 5' // Object.is equality

[Killed] ConditionalExpression
components/ui/DataGrid/data-grid-utils.ts:47:5
     case "greaterThan":
       text = `> ${filter}`;
       break;
-    case "greaterThanOrEqual":
-      text = `≥ ${filter}`;
-      break;
+    case "greaterThanOrEqual":
     case "inRange":
       text = `${filter} to ${filterTo}`;
killedBy: getFilterDisplayText renders each numeric/text comparison type
statusReason: expected '5 to undefined' to be '≥ 5' // Object.is equality

[Killed] StringLiteral
components/ui/DataGrid/data-grid-utils.ts:47:10
     case "greaterThan":
       text = `> ${filter}`;
       break;
-    case "greaterThanOrEqual":
+    case "":
       text = `≥ ${filter}`;
       break;
killedBy: getFilterDisplayText renders each numeric/text comparison type
statusReason: expected '5' to be '≥ 5' // Object.is equality

[Killed] ConditionalExpression
components/ui/DataGrid/data-grid-utils.ts:50:5
     case "greaterThanOrEqual":
       text = `≥ ${filter}`;
       break;
-    case "inRange":
-      text = `${filter} to ${filterTo}`;
-      break;
+    case "inRange":
     case "contains":
       text = `contains "${filter}"`;
killedBy: getFilterDisplayText renders an inRange filter using both bounds
statusReason: expected 'contains "1"' to be '1 to 9' // Object.is equality

[Killed] StringLiteral
components/ui/DataGrid/data-grid-utils.ts:51:14
       text = `≥ ${filter}`;
       break;
     case "inRange":
-      text = `${filter} to ${filterTo}`;
+      text = ``;
       break;
     case "contains":
killedBy: getFilterDisplayText renders an inRange filter using both bounds
statusReason: expected '' to be '1 to 9' // Object.is equality

[Killed] ConditionalExpression
components/ui/DataGrid/data-grid-utils.ts:53:5
     case "inRange":
       text = `${filter} to ${filterTo}`;
       break;
-    case "contains":
-      text = `contains "${filter}"`;
-      break;
+    case "contains":
     case "notContains":
       text = `!contains "${filter}"`;
killedBy: getFilterDisplayText renders string-match types with quoted values
statusReason: expected '!contains "foo"' to be 'contains "foo"' // Object.is equality

[Killed] ConditionalExpression
components/ui/DataGrid/data-grid-utils.ts:56:5
     case "contains":
       text = `contains "${filter}"`;
       break;
-    case "notContains":
-      text = `!contains "${filter}"`;
-      break;
+    case "notContains":
     case "startsWith":
       text = `starts with "${filter}"`;
killedBy: getFilterDisplayText renders string-match types with quoted values
statusReason: expected 'starts with "foo"' to be '!contains "foo"' // Object.is equality

[Killed] StringLiteral
components/ui/DataGrid/data-grid-utils.ts:57:14
       text = `contains "${filter}"`;
       break;
     case "notContains":
-      text = `!contains "${filter}"`;
+      text = ``;
       break;
     case "startsWith":
killedBy: getFilterDisplayText renders string-match types with quoted values
statusReason: expected '' to be '!contains "foo"' // Object.is equality

[Killed] ConditionalExpression
components/ui/DataGrid/data-grid-utils.ts:59:5
     case "notContains":
       text = `!contains "${filter}"`;
       break;
-    case "startsWith":
-      text = `starts with "${filter}"`;
-      break;
+    case "startsWith":
     case "endsWith":
       text = `ends with "${filter}"`;
killedBy: getFilterDisplayText renders string-match types with quoted values
statusReason: expected 'ends with "foo"' to be 'starts with "foo"' // Object.is equality

[Killed] StringLiteral
components/ui/DataGrid/data-grid-utils.ts:59:10
     case "notContains":
       text = `!contains "${filter}"`;
       break;
-    case "startsWith":
+    case "":
       text = `starts with "${filter}"`;
       break;
killedBy: getFilterDisplayText renders string-match types with quoted values
statusReason: expected 'foo' to be 'starts with "foo"' // Object.is equality

[Killed] StringLiteral
components/ui/DataGrid/data-grid-utils.ts:60:14
       text = `!contains "${filter}"`;
       break;
     case "startsWith":
-      text = `starts with "${filter}"`;
+      text = ``;
       break;
     case "endsWith":
killedBy: getFilterDisplayText renders string-match types with quoted values
statusReason: expected '' to be 'starts with "foo"' // Object.is equality

[Killed] ConditionalExpression
components/ui/DataGrid/data-grid-utils.ts:62:5
     case "startsWith":
       text = `starts with "${filter}"`;
       break;
-    case "endsWith":
-      text = `ends with "${filter}"`;
-      break;
+    case "endsWith":
     case "blank":
       text = "is blank";
killedBy: getFilterDisplayText renders string-match types with quoted values
statusReason: expected 'is blank' to be 'ends with "foo"' // Object.is equality

[Killed] StringLiteral
components/ui/DataGrid/data-grid-utils.ts:62:10
     case "startsWith":
       text = `starts with "${filter}"`;
       break;
-    case "endsWith":
+    case "":
       text = `ends with "${filter}"`;
       break;
killedBy: getFilterDisplayText renders string-match types with quoted values
statusReason: expected 'foo' to be 'ends with "foo"' // Object.is equality

[Killed] StringLiteral
components/ui/DataGrid/data-grid-utils.ts:63:14
       text = `starts with "${filter}"`;
       break;
     case "endsWith":
-      text = `ends with "${filter}"`;
+      text = ``;
       break;
     case "blank":
killedBy: getFilterDisplayText renders string-match types with quoted values
statusReason: expected '' to be 'ends with "foo"' // Object.is equality

[Killed] ConditionalExpression
components/ui/DataGrid/data-grid-utils.ts:65:5
     case "endsWith":
       text = `ends with "${filter}"`;
       break;
-    case "blank":
-      text = "is blank";
-      break;
+    case "blank":
     case "notBlank":
       text = "is not blank";
killedBy: getFilterDisplayText renders blank/notBlank types
statusReason: expected 'is not blank' to be 'is blank' // Object.is equality

[Killed] ConditionalExpression
components/ui/DataGrid/data-grid-utils.ts:68:5
     case "blank":
       text = "is blank";
       break;
-    case "notBlank":
-      text = "is not blank";
-      break;
+    case "notBlank":
     default:
       text = filter ? String(filter) : "";
killedBy: getFilterDisplayText renders blank/notBlank types
statusReason: expected '' to be 'is not blank' // Object.is equality

[Killed] ConditionalExpression
components/ui/DataGrid/data-grid-utils.ts:71:5
     case "notBlank":
       text = "is not blank";
       break;
-    default:
-      text = filter ? String(filter) : "";
+    default:
   }
   return text;
killedBy: getFilterDisplayText falls back to the raw filter value for unknown types
statusReason: expected undefined to be 'abc' // Object.is equality

[Killed] StringLiteral
components/ui/DataGrid/data-grid-utils.ts:72:40
       text = "is not blank";
       break;
     default:
-      text = filter ? String(filter) : "";
+      text = filter ? String(filter) : "Stryker was here!";
   }
   return text;
killedBy: getFilterDisplayText returns empty string for an unknown type with no filter value
statusReason: expected 'Stryker was here!' to be '' // Object.is equality
