[Killed] BlockStatement
src/components/ui/date-range-utils.ts:19:47
 };
 
 /** Parse a GPS/ISO date string, treating a missing `Z` suffix as UTC (rather than local time). */
-function parseAsUtc(dateString: string): Date {
-  return dateString.endsWith("Z")
-    ? parseDateStringISO(dateString)
-    : parseDateStringISO(dateString + "Z");
-}
+function parseAsUtc(dateString: string): Date {}
 
 /**
killedBy: validateDateRangeInput reports out-of-range when before the min date
statusReason: expected { valid: false, …(1) } to deeply equal { valid: false, …(1) }

[Survived] MethodExpression
src/components/ui/date-range-utils.ts:20:10
 
 /** Parse a GPS/ISO date string, treating a missing `Z` suffix as UTC (rather than local time). */
 function parseAsUtc(dateString: string): Date {
-  return dateString.endsWith("Z")
+  return dateString.startsWith("Z")
     ? parseDateStringISO(dateString)
     : parseDateStringISO(dateString + "Z");

[Survived] StringLiteral
src/components/ui/date-range-utils.ts:22:39
 function parseAsUtc(dateString: string): Date {
   return dateString.endsWith("Z")
     ? parseDateStringISO(dateString)
-    : parseDateStringISO(dateString + "Z");
+    : parseDateStringISO(dateString + "");
 }
 

[Killed] ConditionalExpression
src/components/ui/date-range-utils.ts:40:7
 }: DateRangeValidationInput): DateRangeValidationResult {
   let eventDateString = dateString;
   let otherEventDateString = otherDateString;
-  if (dateFormat === "short") {
+  if (true) {
     eventDateString += "T00:00:00";
     otherEventDateString += "T00:00:00";
killedBy: validateDateRangeInput reports out-of-range when before the min date
statusReason: expected { valid: false, …(1) } to deeply equal { valid: false, …(1) }

[Killed] EqualityOperator
src/components/ui/date-range-utils.ts:40:7
 }: DateRangeValidationInput): DateRangeValidationResult {
   let eventDateString = dateString;
   let otherEventDateString = otherDateString;
-  if (dateFormat === "short") {
+  if (dateFormat !== "short") {
     eventDateString += "T00:00:00";
     otherEventDateString += "T00:00:00";
killedBy: validateDateRangeInput reports out-of-range when before the min date
statusReason: expected { valid: false, …(1) } to deeply equal { valid: false, …(1) }

[Survived] StringLiteral
src/components/ui/date-range-utils.ts:41:24
   let eventDateString = dateString;
   let otherEventDateString = otherDateString;
   if (dateFormat === "short") {
-    eventDateString += "T00:00:00";
+    eventDateString += "";
     otherEventDateString += "T00:00:00";
   }

[Killed] ConditionalExpression
src/components/ui/date-range-utils.ts:47:21
 
   // Treat GPS time string as UTC otherwise 7 hours will be added
   const eventDate = parseAsUtc(eventDateString);
-  const eventVerb = which === "from" ? "start" : "end";
+  const eventVerb = true ? "start" : "end";
   const otherDate = parseAsUtc(otherEventDateString);
   const otherDateVerb = which === "from" ? "end" : "start";
killedBy: validateDateRangeInput reports a required end date when editing an empty 'to'
statusReason: expected { valid: false, …(1) } to deeply equal { valid: false, …(1) }

[Killed] ConditionalExpression
src/components/ui/date-range-utils.ts:47:21
 
   // Treat GPS time string as UTC otherwise 7 hours will be added
   const eventDate = parseAsUtc(eventDateString);
-  const eventVerb = which === "from" ? "start" : "end";
+  const eventVerb = false ? "start" : "end";
   const otherDate = parseAsUtc(otherEventDateString);
   const otherDateVerb = which === "from" ? "end" : "start";
killedBy: validateDateRangeInput reports a required start date when editing an empty 'from'
statusReason: expected { valid: false, …(1) } to deeply equal { valid: false, …(1) }

[Killed] EqualityOperator
src/components/ui/date-range-utils.ts:49:25
   const eventDate = parseAsUtc(eventDateString);
   const eventVerb = which === "from" ? "start" : "end";
   const otherDate = parseAsUtc(otherEventDateString);
-  const otherDateVerb = which === "from" ? "end" : "start";
+  const otherDateVerb = which !== "from" ? "end" : "start";
 
   if (!dateString) {
killedBy: validateDateRangeInput reports the counterpart end date as invalid (editing 'from')
statusReason: expected { valid: false, …(1) } to deeply equal { valid: false, …(1) }

[Killed] ConditionalExpression
src/components/ui/date-range-utils.ts:49:25
   const eventDate = parseAsUtc(eventDateString);
   const eventVerb = which === "from" ? "start" : "end";
   const otherDate = parseAsUtc(otherEventDateString);
-  const otherDateVerb = which === "from" ? "end" : "start";
+  const otherDateVerb = false ? "end" : "start";
 
   if (!dateString) {
killedBy: validateDateRangeInput reports the counterpart end date as invalid (editing 'from')
statusReason: expected { valid: false, …(1) } to deeply equal { valid: false, …(1) }

[Killed] ConditionalExpression
src/components/ui/date-range-utils.ts:51:7
   const otherDate = parseAsUtc(otherEventDateString);
   const otherDateVerb = which === "from" ? "end" : "start";
 
-  if (!dateString) {
+  if (false) {
     return {
       valid: false,
killedBy: validateDateRangeInput reports a required start date when editing an empty 'from'
statusReason: expected { valid: false, …(1) } to deeply equal { valid: false, …(1) }

[Killed] BooleanLiteral
src/components/ui/date-range-utils.ts:51:7
   const otherDate = parseAsUtc(otherEventDateString);
   const otherDateVerb = which === "from" ? "end" : "start";
 
-  if (!dateString) {
+  if (dateString) {
     return {
       valid: false,
killedBy: validateDateRangeInput reports a required start date when editing an empty 'from'
statusReason: expected { valid: false, …(1) } to deeply equal { valid: false, …(1) }

[Killed] ConditionalExpression
src/components/ui/date-range-utils.ts:54:17
   if (!dateString) {
     return {
       valid: false,
-      error: `${eventVerb === "start" ? "Start" : "End"} date required`,
+      error: `${true ? "Start" : "End"} date required`,
     };
   } else if (!eventDate || !isValid(eventDate)) {
killedBy: validateDateRangeInput reports a required end date when editing an empty 'to'
statusReason: expected { valid: false, …(1) } to deeply equal { valid: false, …(1) }

[Killed] EqualityOperator
src/components/ui/date-range-utils.ts:54:17
   if (!dateString) {
     return {
       valid: false,
-      error: `${eventVerb === "start" ? "Start" : "End"} date required`,
+      error: `${eventVerb !== "start" ? "Start" : "End"} date required`,
     };
   } else if (!eventDate || !isValid(eventDate)) {
killedBy: validateDateRangeInput reports a required start date when editing an empty 'from'
statusReason: expected { valid: false, …(1) } to deeply equal { valid: false, …(1) }

[Killed] BooleanLiteral
src/components/ui/date-range-utils.ts:56:14
       valid: false,
       error: `${eventVerb === "start" ? "Start" : "End"} date required`,
     };
-  } else if (!eventDate || !isValid(eventDate)) {
+  } else if (eventDate || !isValid(eventDate)) {
     return { valid: false, error: `Invalid ${eventVerb} date` };
   } else if (isBefore(eventDate, minDate) || isAfter(eventDate, maxDate)) {
killedBy: validateDateRangeInput reports out-of-range when before the min date
statusReason: expected { valid: false, …(1) } to deeply equal { valid: false, …(1) }

[Killed] ConditionalExpression
src/components/ui/date-range-utils.ts:56:14
       valid: false,
       error: `${eventVerb === "start" ? "Start" : "End"} date required`,
     };
-  } else if (!eventDate || !isValid(eventDate)) {
+  } else if (true) {
     return { valid: false, error: `Invalid ${eventVerb} date` };
   } else if (isBefore(eventDate, minDate) || isAfter(eventDate, maxDate)) {
killedBy: validateDateRangeInput reports out-of-range when before the min date
statusReason: expected { valid: false, …(1) } to deeply equal { valid: false, …(1) }

[Killed] BooleanLiteral
src/components/ui/date-range-utils.ts:57:21
       error: `${eventVerb === "start" ? "Start" : "End"} date required`,
     };
   } else if (!eventDate || !isValid(eventDate)) {
-    return { valid: false, error: `Invalid ${eventVerb} date` };
+    return { valid: true, error: `Invalid ${eventVerb} date` };
   } else if (isBefore(eventDate, minDate) || isAfter(eventDate, maxDate)) {
     return { valid: false, error: "Date out of range" };
killedBy: validateDateRangeInput reports an invalid edited date
statusReason: expected { valid: true, …(1) } to deeply equal { valid: false, …(1) }

[Killed] StringLiteral
src/components/ui/date-range-utils.ts:57:35
       error: `${eventVerb === "start" ? "Start" : "End"} date required`,
     };
   } else if (!eventDate || !isValid(eventDate)) {
-    return { valid: false, error: `Invalid ${eventVerb} date` };
+    return { valid: false, error: `` };
   } else if (isBefore(eventDate, minDate) || isAfter(eventDate, maxDate)) {
     return { valid: false, error: "Date out of range" };
killedBy: validateDateRangeInput reports an invalid edited date
statusReason: expected { valid: false, error: '' } to deeply equal { valid: false, …(1) }

[Killed] BlockStatement
src/components/ui/date-range-utils.ts:58:75
     };
   } else if (!eventDate || !isValid(eventDate)) {
     return { valid: false, error: `Invalid ${eventVerb} date` };
-  } else if (isBefore(eventDate, minDate) || isAfter(eventDate, maxDate)) {
-    return { valid: false, error: "Date out of range" };
-  } else if (!otherDate || !isValid(otherDate)) {
+  } else if (isBefore(eventDate, minDate) || isAfter(eventDate, maxDate)) {} else if (!otherDate || !isValid(otherDate)) {
     return { valid: false, error: `Invalid ${otherDateVerb} date` };
   }
killedBy: validateDateRangeInput reports out-of-range when before the min date
statusReason: expected { valid: true, …(2) } to deeply equal { valid: false, …(1) }

[Killed] ConditionalExpression
src/components/ui/date-range-utils.ts:58:14
     };
   } else if (!eventDate || !isValid(eventDate)) {
     return { valid: false, error: `Invalid ${eventVerb} date` };
-  } else if (isBefore(eventDate, minDate) || isAfter(eventDate, maxDate)) {
+  } else if (false) {
     return { valid: false, error: "Date out of range" };
   } else if (!otherDate || !isValid(otherDate)) {
killedBy: validateDateRangeInput reports out-of-range when before the min date
statusReason: expected { valid: true, …(2) } to deeply equal { valid: false, …(1) }

[Killed] BooleanLiteral
src/components/ui/date-range-utils.ts:59:21
   } else if (!eventDate || !isValid(eventDate)) {
     return { valid: false, error: `Invalid ${eventVerb} date` };
   } else if (isBefore(eventDate, minDate) || isAfter(eventDate, maxDate)) {
-    return { valid: false, error: "Date out of range" };
+    return { valid: true, error: "Date out of range" };
   } else if (!otherDate || !isValid(otherDate)) {
     return { valid: false, error: `Invalid ${otherDateVerb} date` };
killedBy: validateDateRangeInput reports out-of-range when before the min date
statusReason: expected { valid: true, …(1) } to deeply equal { valid: false, …(1) }

[Killed] ObjectLiteral
src/components/ui/date-range-utils.ts:59:12
   } else if (!eventDate || !isValid(eventDate)) {
     return { valid: false, error: `Invalid ${eventVerb} date` };
   } else if (isBefore(eventDate, minDate) || isAfter(eventDate, maxDate)) {
-    return { valid: false, error: "Date out of range" };
+    return {};
   } else if (!otherDate || !isValid(otherDate)) {
     return { valid: false, error: `Invalid ${otherDateVerb} date` };
killedBy: validateDateRangeInput reports out-of-range when before the min date
statusReason: expected {} to deeply equal { valid: false, …(1) }

[Killed] ConditionalExpression
src/components/ui/date-range-utils.ts:60:14
     return { valid: false, error: `Invalid ${eventVerb} date` };
   } else if (isBefore(eventDate, minDate) || isAfter(eventDate, maxDate)) {
     return { valid: false, error: "Date out of range" };
-  } else if (!otherDate || !isValid(otherDate)) {
+  } else if (false) {
     return { valid: false, error: `Invalid ${otherDateVerb} date` };
   }
killedBy: validateDateRangeInput reports the counterpart end date as invalid (editing 'from')
statusReason: expected { valid: true, …(2) } to deeply equal { valid: false, …(1) }

[Killed] ConditionalExpression
src/components/ui/date-range-utils.ts:60:14
     return { valid: false, error: `Invalid ${eventVerb} date` };
   } else if (isBefore(eventDate, minDate) || isAfter(eventDate, maxDate)) {
     return { valid: false, error: "Date out of range" };
-  } else if (!otherDate || !isValid(otherDate)) {
+  } else if (true) {
     return { valid: false, error: `Invalid ${otherDateVerb} date` };
   }
killedBy: validateDateRangeInput rejects a start that comes after the end
statusReason: expected { valid: false, …(1) } to deeply equal { valid: false, …(1) }

[Killed] BooleanLiteral
src/components/ui/date-range-utils.ts:61:21
   } else if (isBefore(eventDate, minDate) || isAfter(eventDate, maxDate)) {
     return { valid: false, error: "Date out of range" };
   } else if (!otherDate || !isValid(otherDate)) {
-    return { valid: false, error: `Invalid ${otherDateVerb} date` };
+    return { valid: true, error: `Invalid ${otherDateVerb} date` };
   }
 
killedBy: validateDateRangeInput reports the counterpart end date as invalid (editing 'from')
statusReason: expected { valid: true, …(1) } to deeply equal { valid: false, …(1) }

[Killed] ConditionalExpression
src/components/ui/date-range-utils.ts:64:21
     return { valid: false, error: `Invalid ${otherDateVerb} date` };
   }
 
-  const startDate = which === "from" ? eventDate : otherDate;
+  const startDate = true ? eventDate : otherDate;
   const endDate = which === "to" ? eventDate : otherDate;
   if (isBefore(endDate, startDate)) {
killedBy: validateDateRangeInput resolves start/end when editing the 'to' field
statusReason: expected 1750377600000 to be 1749945600000 // Object.is equality

[Killed] ConditionalExpression
src/components/ui/date-range-utils.ts:64:21
     return { valid: false, error: `Invalid ${otherDateVerb} date` };
   }
 
-  const startDate = which === "from" ? eventDate : otherDate;
+  const startDate = false ? eventDate : otherDate;
   const endDate = which === "to" ? eventDate : otherDate;
   if (isBefore(endDate, startDate)) {
killedBy: validateDateRangeInput rejects a start that comes after the end
statusReason: expected { valid: true, …(2) } to deeply equal { valid: false, …(1) }

[Killed] ConditionalExpression
src/components/ui/date-range-utils.ts:65:19
   }
 
   const startDate = which === "from" ? eventDate : otherDate;
-  const endDate = which === "to" ? eventDate : otherDate;
+  const endDate = true ? eventDate : otherDate;
   if (isBefore(endDate, startDate)) {
     return { valid: false, error: "Start date must precede end date" };
killedBy: validateDateRangeInput rejects a start that comes after the end
statusReason: expected { valid: true, …(2) } to deeply equal { valid: false, …(1) }

[Killed] ConditionalExpression
src/components/ui/date-range-utils.ts:65:19
   }
 
   const startDate = which === "from" ? eventDate : otherDate;
-  const endDate = which === "to" ? eventDate : otherDate;
+  const endDate = false ? eventDate : otherDate;
   if (isBefore(endDate, startDate)) {
     return { valid: false, error: "Start date must precede end date" };
killedBy: validateDateRangeInput resolves start/end when editing the 'to' field
statusReason: expected 1749945600000 to be 1750377600000 // Object.is equality

[Killed] ConditionalExpression
src/components/ui/date-range-utils.ts:66:7
 
   const startDate = which === "from" ? eventDate : otherDate;
   const endDate = which === "to" ? eventDate : otherDate;
-  if (isBefore(endDate, startDate)) {
+  if (true) {
     return { valid: false, error: "Start date must precede end date" };
   }
killedBy: validateDateRangeInput resolves start/end when editing the 'from' field
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/components/ui/date-range-utils.ts:66:37
 
   const startDate = which === "from" ? eventDate : otherDate;
   const endDate = which === "to" ? eventDate : otherDate;
-  if (isBefore(endDate, startDate)) {
-    return { valid: false, error: "Start date must precede end date" };
-  }
+  if (isBefore(endDate, startDate)) {}
 
   return { valid: true, startDate, endDate };
killedBy: validateDateRangeInput rejects a start that comes after the end
statusReason: expected { valid: true, …(2) } to deeply equal { valid: false, …(1) }

[Killed] BooleanLiteral
src/components/ui/date-range-utils.ts:67:21
   const startDate = which === "from" ? eventDate : otherDate;
   const endDate = which === "to" ? eventDate : otherDate;
   if (isBefore(endDate, startDate)) {
-    return { valid: false, error: "Start date must precede end date" };
+    return { valid: true, error: "Start date must precede end date" };
   }
 
killedBy: validateDateRangeInput rejects a start that comes after the end
statusReason: expected { valid: true, …(1) } to deeply equal { valid: false, …(1) }

[Killed] ObjectLiteral
src/components/ui/date-range-utils.ts:67:12
   const startDate = which === "from" ? eventDate : otherDate;
   const endDate = which === "to" ? eventDate : otherDate;
   if (isBefore(endDate, startDate)) {
-    return { valid: false, error: "Start date must precede end date" };
+    return {};
   }
 
killedBy: validateDateRangeInput rejects a start that comes after the end
statusReason: expected {} to deeply equal { valid: false, …(1) }

[Killed] BooleanLiteral
src/components/ui/date-range-utils.ts:70:19
     return { valid: false, error: "Start date must precede end date" };
   }
 
-  return { valid: true, startDate, endDate };
+  return { valid: false, startDate, endDate };
 }
 
killedBy: validateDateRangeInput resolves start/end when editing the 'from' field
statusReason: expected false to be true // Object.is equality
