[Killed] BlockStatement
src/components/ui/entity-editor-utils.ts:20:6
 export const getLabelForSelectedProductOrLayer = (
   thing: SelectedProduct | DataLayer,
   fields?: string[],
-) => {
-  return `${thing.mission} ${thing.instrument} ${thing.dataset} ${(
-    fields || thing.fields
-  ).join(", ")} ${(thing.channels || [])
-    .map((c) => `(${c.id}: ${c.value})`)
-    .join(" ")} (v${thing.version}) ${
-    Array.isArray(thing.filter) && thing.filter.length > 0
-      ? `filter: ${thing.filter.join(", ")}`
-      : ""
-  }`;
-};
+) => {};
 
 // Returns the layer containing the selected product
killedBy: getLabelForSelectedProductOrLayer builds a full label with channels and filter
statusReason: expected undefined to be 'M I D a, b (c1: v1) (v3) filter: f=1,…' // Object.is equality

[Killed] StringLiteral
src/components/ui/entity-editor-utils.ts:21:10
   thing: SelectedProduct | DataLayer,
   fields?: string[],
 ) => {
-  return `${thing.mission} ${thing.instrument} ${thing.dataset} ${(
-    fields || thing.fields
-  ).join(", ")} ${(thing.channels || [])
-    .map((c) => `(${c.id}: ${c.value})`)
-    .join(" ")} (v${thing.version}) ${
-    Array.isArray(thing.filter) && thing.filter.length > 0
-      ? `filter: ${thing.filter.join(", ")}`
-      : ""
-  }`;
+  return ``;
 };
 
killedBy: getLabelForSelectedProductOrLayer builds a full label with channels and filter
statusReason: expected '' to be 'M I D a, b (c1: v1) (v3) filter: f=1,…' // Object.is equality

[Killed] LogicalOperator
src/components/ui/entity-editor-utils.ts:22:5
   fields?: string[],
 ) => {
   return `${thing.mission} ${thing.instrument} ${thing.dataset} ${(
-    fields || thing.fields
+    fields && thing.fields
   ).join(", ")} ${(thing.channels || [])
     .map((c) => `(${c.id}: ${c.value})`)
killedBy: getLabelForSelectedProductOrLayer builds a full label with channels and filter
statusReason: Cannot read properties of undefined (reading 'join')

[Killed] ConditionalExpression
src/components/ui/entity-editor-utils.ts:22:5
   fields?: string[],
 ) => {
   return `${thing.mission} ${thing.instrument} ${thing.dataset} ${(
-    fields || thing.fields
+    false
   ).join(", ")} ${(thing.channels || [])
     .map((c) => `(${c.id}: ${c.value})`)
killedBy: getLabelForSelectedProductOrLayer builds a full label with channels and filter
statusReason: (intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value).join is not a function

[Killed] ConditionalExpression
src/components/ui/entity-editor-utils.ts:23:20
 ) => {
   return `${thing.mission} ${thing.instrument} ${thing.dataset} ${(
     fields || thing.fields
-  ).join(", ")} ${(thing.channels || [])
+  ).join(", ")} ${(false)
     .map((c) => `(${c.id}: ${c.value})`)
     .join(" ")} (v${thing.version}) ${
killedBy: getLabelForSelectedProductOrLayer builds a full label with channels and filter
statusReason: (intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value).map is not a function

[Killed] ConditionalExpression
src/components/ui/entity-editor-utils.ts:23:20
 ) => {
   return `${thing.mission} ${thing.instrument} ${thing.dataset} ${(
     fields || thing.fields
-  ).join(", ")} ${(thing.channels || [])
+  ).join(", ")} ${(true)
     .map((c) => `(${c.id}: ${c.value})`)
     .join(" ")} (v${thing.version}) ${
killedBy: getLabelForSelectedProductOrLayer builds a full label with channels and filter
statusReason: (intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value).map is not a function

[Killed] ArrowFunction
src/components/ui/entity-editor-utils.ts:24:10
   return `${thing.mission} ${thing.instrument} ${thing.dataset} ${(
     fields || thing.fields
   ).join(", ")} ${(thing.channels || [])
-    .map((c) => `(${c.id}: ${c.value})`)
+    .map(() => undefined)
     .join(" ")} (v${thing.version}) ${
     Array.isArray(thing.filter) && thing.filter.length > 0
killedBy: getLabelForSelectedProductOrLayer builds a full label with channels and filter
statusReason: expected 'M I D a, b  (v3) filter: f=1, g=2' to be 'M I D a, b (c1: v1) (v3) filter: f=1,…' // Object.is equality

[Killed] EqualityOperator
src/components/ui/entity-editor-utils.ts:26:36
   ).join(", ")} ${(thing.channels || [])
     .map((c) => `(${c.id}: ${c.value})`)
     .join(" ")} (v${thing.version}) ${
-    Array.isArray(thing.filter) && thing.filter.length > 0
+    Array.isArray(thing.filter) && thing.filter.length <= 0
       ? `filter: ${thing.filter.join(", ")}`
       : ""
killedBy: getLabelForSelectedProductOrLayer builds a full label with channels and filter
statusReason: expected 'M I D a, b (c1: v1) (v3) ' to be 'M I D a, b (c1: v1) (v3) filter: f=1,…' // Object.is equality

[Killed] LogicalOperator
src/components/ui/entity-editor-utils.ts:26:5
   ).join(", ")} ${(thing.channels || [])
     .map((c) => `(${c.id}: ${c.value})`)
     .join(" ")} (v${thing.version}) ${
-    Array.isArray(thing.filter) && thing.filter.length > 0
+    Array.isArray(thing.filter) || thing.filter.length > 0
       ? `filter: ${thing.filter.join(", ")}`
       : ""
killedBy: getLabelForSelectedProductOrLayer joins multiple channels with a space
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
src/components/ui/entity-editor-utils.ts:37:35
   layer: DataLayer,
   selectedProducts: SelectedProduct[],
   fields?: string[],
-): SelectedProduct | undefined => {
-  return selectedProducts.find(
-    (p) =>
-      getLabelForSelectedProductOrLayer(p, fields || p.fields) ===
-      getLabelForSelectedProductOrLayer(layer, fields || layer.fields),
-  );
-};
+): SelectedProduct | undefined => {};
 
 /**
killedBy: getMatchingSelectedProductForLayer returns the product whose label matches the layer
statusReason: expected undefined to be 'match' // Object.is equality

[Killed] ArrowFunction
src/components/ui/entity-editor-utils.ts:39:5
   fields?: string[],
 ): SelectedProduct | undefined => {
   return selectedProducts.find(
-    (p) =>
-      getLabelForSelectedProductOrLayer(p, fields || p.fields) ===
-      getLabelForSelectedProductOrLayer(layer, fields || layer.fields),
+    () => undefined,
   );
 };
killedBy: getMatchingSelectedProductForLayer returns the product whose label matches the layer
statusReason: expected undefined to be 'match' // Object.is equality

[Killed] ConditionalExpression
src/components/ui/entity-editor-utils.ts:40:44
 ): SelectedProduct | undefined => {
   return selectedProducts.find(
     (p) =>
-      getLabelForSelectedProductOrLayer(p, fields || p.fields) ===
+      getLabelForSelectedProductOrLayer(p, true) ===
       getLabelForSelectedProductOrLayer(layer, fields || layer.fields),
   );
killedBy: getMatchingSelectedProductForLayer returns the product whose label matches the layer
statusReason: (intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value).join is not a function

[Killed] LogicalOperator
src/components/ui/entity-editor-utils.ts:40:44
 ): SelectedProduct | undefined => {
   return selectedProducts.find(
     (p) =>
-      getLabelForSelectedProductOrLayer(p, fields || p.fields) ===
+      getLabelForSelectedProductOrLayer(p, fields && p.fields) ===
       getLabelForSelectedProductOrLayer(layer, fields || layer.fields),
   );
killedBy: getMatchingSelectedProductForLayer applies the fields override to both sides
statusReason: expected undefined to be 'p' // Object.is equality

[Killed] ConditionalExpression
src/components/ui/entity-editor-utils.ts:41:48
   return selectedProducts.find(
     (p) =>
       getLabelForSelectedProductOrLayer(p, fields || p.fields) ===
-      getLabelForSelectedProductOrLayer(layer, fields || layer.fields),
+      getLabelForSelectedProductOrLayer(layer, true),
   );
 };
killedBy: getMatchingSelectedProductForLayer returns the product whose label matches the layer
statusReason: (intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value).join is not a function

[Killed] LogicalOperator
src/components/ui/entity-editor-utils.ts:41:48
   return selectedProducts.find(
     (p) =>
       getLabelForSelectedProductOrLayer(p, fields || p.fields) ===
-      getLabelForSelectedProductOrLayer(layer, fields || layer.fields),
+      getLabelForSelectedProductOrLayer(layer, fields && layer.fields),
   );
 };
killedBy: getMatchingSelectedProductForLayer applies the fields override to both sides
statusReason: expected undefined to be 'p' // Object.is equality

[Killed] BlockStatement
src/components/ui/entity-editor-utils.ts:51:15
  */
 export const isSelectedProductComplete = (
   product: SelectedProduct,
-): boolean => {
-  return Boolean(
-    product.mission &&
-    product.instrument &&
-    product.dataset &&
-    product.fields.length &&
-    product.version,
-  );
-};
+): boolean => {};
 
 /**
killedBy: isSelectedProductComplete is true when all required fields are present
statusReason: expected undefined to be true // Object.is equality

[Killed] LogicalOperator
src/components/ui/entity-editor-utils.ts:53:5
   product: SelectedProduct,
 ): boolean => {
   return Boolean(
-    product.mission &&
-    product.instrument &&
+    product.mission || product.instrument &&
     product.dataset &&
     product.fields.length &&
killedBy: isSelectedProductComplete is false when any single required field is missing
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
src/components/ui/entity-editor-utils.ts:53:5
   product: SelectedProduct,
 ): boolean => {
   return Boolean(
-    product.mission &&
-    product.instrument &&
-    product.dataset &&
-    product.fields.length &&
+    product.mission && product.instrument && product.dataset || product.fields.length &&
     product.version,
   );
killedBy: isSelectedProductComplete is false when any single required field is missing
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/components/ui/entity-editor-utils.ts:69:15
   product: SelectedProduct,
   hasSubsetVersionField: boolean | undefined,
   dateRange: DateRange | undefined,
-): boolean => {
-  return Boolean(
-    hasSubsetVersionField &&
-    product.mission &&
-    product.instrument &&
-    product.dataset &&
-    product.version &&
-    dateRange,
-  );
-};
+): boolean => {};
 
 /**
killedBy: shouldFetchSubsetVersionCount is true when the field exists and selection + range are complete
statusReason: expected undefined to be true // Object.is equality

[Killed] LogicalOperator
src/components/ui/entity-editor-utils.ts:71:5
   dateRange: DateRange | undefined,
 ): boolean => {
   return Boolean(
-    hasSubsetVersionField &&
-    product.mission &&
-    product.instrument &&
+    hasSubsetVersionField && product.mission || product.instrument &&
     product.dataset &&
     product.version &&
killedBy: shouldFetchSubsetVersionCount is false when the product lacks a subset_version field
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/components/ui/entity-editor-utils.ts:71:5
   dateRange: DateRange | undefined,
 ): boolean => {
   return Boolean(
-    hasSubsetVersionField &&
-    product.mission &&
-    product.instrument &&
-    product.dataset &&
-    product.version &&
-    dateRange,
+    false,
   );
 };
killedBy: shouldFetchSubsetVersionCount is true when the field exists and selection + range are complete
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/components/ui/entity-editor-utils.ts:86:14
  */
 export const countSubsetVersionsInDataResponse = (
   data: DataResponse | null | undefined,
-): number => {
-  const subsetVersionSet = new Set<string>();
-  if (data && Array.isArray(data.data)) {
-    data.data.forEach((point) => {
-      const subsetVersionValue = point.subset_version?.value;
-      if (subsetVersionValue !== undefined && subsetVersionValue !== null) {
-        subsetVersionSet.add(String(subsetVersionValue));
-      }
-    });
-  }
-  return subsetVersionSet.size;
-};
+): number => {};
 
 /**
killedBy: countSubsetVersionsInDataResponse returns 0 for missing or malformed responses
statusReason: expected undefined to be +0 // Object.is equality

[Killed] BlockStatement
src/components/ui/entity-editor-utils.ts:88:41
   data: DataResponse | null | undefined,
 ): number => {
   const subsetVersionSet = new Set<string>();
-  if (data && Array.isArray(data.data)) {
-    data.data.forEach((point) => {
-      const subsetVersionValue = point.subset_version?.value;
-      if (subsetVersionValue !== undefined && subsetVersionValue !== null) {
-        subsetVersionSet.add(String(subsetVersionValue));
-      }
-    });
-  }
+  if (data && Array.isArray(data.data)) {}
   return subsetVersionSet.size;
 };
killedBy: countSubsetVersionsInDataResponse counts distinct values and ignores duplicates
statusReason: expected +0 to be 2 // Object.is equality

[Killed] LogicalOperator
src/components/ui/entity-editor-utils.ts:88:7
   data: DataResponse | null | undefined,
 ): number => {
   const subsetVersionSet = new Set<string>();
-  if (data && Array.isArray(data.data)) {
+  if (data || Array.isArray(data.data)) {
     data.data.forEach((point) => {
       const subsetVersionValue = point.subset_version?.value;
killedBy: countSubsetVersionsInDataResponse returns 0 for missing or malformed responses
statusReason: Cannot read properties of null (reading 'data')

[Killed] BlockStatement
src/components/ui/entity-editor-utils.ts:89:34
 ): number => {
   const subsetVersionSet = new Set<string>();
   if (data && Array.isArray(data.data)) {
-    data.data.forEach((point) => {
-      const subsetVersionValue = point.subset_version?.value;
-      if (subsetVersionValue !== undefined && subsetVersionValue !== null) {
-        subsetVersionSet.add(String(subsetVersionValue));
-      }
-    });
+    data.data.forEach((point) => {});
   }
   return subsetVersionSet.size;
killedBy: countSubsetVersionsInDataResponse counts distinct values and ignores duplicates
statusReason: expected +0 to be 2 // Object.is equality

[Killed] OptionalChaining
src/components/ui/entity-editor-utils.ts:90:34
   const subsetVersionSet = new Set<string>();
   if (data && Array.isArray(data.data)) {
     data.data.forEach((point) => {
-      const subsetVersionValue = point.subset_version?.value;
+      const subsetVersionValue = point.subset_version.value;
       if (subsetVersionValue !== undefined && subsetVersionValue !== null) {
         subsetVersionSet.add(String(subsetVersionValue));
killedBy: countSubsetVersionsInDataResponse returns 0 when no entry carries a subset_version
statusReason: Cannot read properties of undefined (reading 'value')

[Killed] ConditionalExpression
src/components/ui/entity-editor-utils.ts:91:47
   if (data && Array.isArray(data.data)) {
     data.data.forEach((point) => {
       const subsetVersionValue = point.subset_version?.value;
-      if (subsetVersionValue !== undefined && subsetVersionValue !== null) {
+      if (subsetVersionValue !== undefined && true) {
         subsetVersionSet.add(String(subsetVersionValue));
       }
killedBy: countSubsetVersionsInDataResponse ignores null/undefined but counts falsy values like 0
statusReason: expected 2 to be 1 // Object.is equality

[Killed] LogicalOperator
src/components/ui/entity-editor-utils.ts:91:11
   if (data && Array.isArray(data.data)) {
     data.data.forEach((point) => {
       const subsetVersionValue = point.subset_version?.value;
-      if (subsetVersionValue !== undefined && subsetVersionValue !== null) {
+      if (subsetVersionValue !== undefined || subsetVersionValue !== null) {
         subsetVersionSet.add(String(subsetVersionValue));
       }
killedBy: countSubsetVersionsInDataResponse returns 0 when no entry carries a subset_version
statusReason: expected 1 to be +0 // Object.is equality

[Killed] BlockStatement
src/components/ui/entity-editor-utils.ts:106:25
  */
 export const splitSelectedProductsByField = (
   selectedProducts: SelectedProduct[],
-): SelectedProduct[] => {
-  const result: SelectedProduct[] = [];
-  selectedProducts.forEach((selectedProduct) => {
-    selectedProduct.fields.forEach((field) => {
-      result.push({
-        ...selectedProduct,
-        fields: [field],
-        id: generateUUID(),
-      });
-    });
-  });
-  return result;
-};
+): SelectedProduct[] => {};
 
 export const extractEntitySelectedProducts = (
killedBy: splitSelectedProductsByField splits a multi-field product into one product per field
statusReason: Target cannot be null or undefined.

[Killed] BlockStatement
src/components/ui/entity-editor-utils.ts:108:49
   selectedProducts: SelectedProduct[],
 ): SelectedProduct[] => {
   const result: SelectedProduct[] = [];
-  selectedProducts.forEach((selectedProduct) => {
-    selectedProduct.fields.forEach((field) => {
-      result.push({
-        ...selectedProduct,
-        fields: [field],
-        id: generateUUID(),
-      });
-    });
-  });
+  selectedProducts.forEach((selectedProduct) => {});
   return result;
 };
killedBy: splitSelectedProductsByField splits a multi-field product into one product per field
statusReason: expected [] to have a length of 3 but got +0

[Killed] BlockStatement
src/components/ui/entity-editor-utils.ts:109:47
 ): SelectedProduct[] => {
   const result: SelectedProduct[] = [];
   selectedProducts.forEach((selectedProduct) => {
-    selectedProduct.fields.forEach((field) => {
-      result.push({
-        ...selectedProduct,
-        fields: [field],
-        id: generateUUID(),
-      });
-    });
+    selectedProduct.fields.forEach((field) => {});
   });
   return result;
killedBy: splitSelectedProductsByField splits a multi-field product into one product per field
statusReason: expected [] to have a length of 3 but got +0

[Killed] BlockStatement
src/components/ui/entity-editor-utils.ts:122:25
 
 export const extractEntitySelectedProducts = (
   entity: EntityType,
-): SelectedProduct[] => {
-  const layers = (entity as ChartEntity | TableEntity).layers || [];
-  return layers.map((layer) => {
-    return {
-      id: generateUUID(),
-      channels: layer.channels,
-      fields: layer.fields,
-      dataset: layer.dataset,
-      mission: layer.mission,
-      version: layer.version,
-      instrument: layer.instrument,
-      ...(Array.isArray(layer.filter) ? { filter: layer.filter } : null),
-    } as SelectedProduct;
-  });
-};
+): SelectedProduct[] => {};
 
killedBy: extractEntitySelectedProducts maps each layer, copying fields and generating ids
statusReason: Target cannot be null or undefined.

[Killed] LogicalOperator
src/components/ui/entity-editor-utils.ts:123:18
 export const extractEntitySelectedProducts = (
   entity: EntityType,
 ): SelectedProduct[] => {
-  const layers = (entity as ChartEntity | TableEntity).layers || [];
+  const layers = (entity as ChartEntity | TableEntity).layers && [];
   return layers.map((layer) => {
     return {
killedBy: extractEntitySelectedProducts maps each layer, copying fields and generating ids
statusReason: expected [] to have a length of 2 but got +0

[Killed] ConditionalExpression
src/components/ui/entity-editor-utils.ts:123:18
 export const extractEntitySelectedProducts = (
   entity: EntityType,
 ): SelectedProduct[] => {
-  const layers = (entity as ChartEntity | TableEntity).layers || [];
+  const layers = false;
   return layers.map((layer) => {
     return {
killedBy: extractEntitySelectedProducts maps each layer, copying fields and generating ids
statusReason: layers.map is not a function

[Killed] BlockStatement
src/components/ui/entity-editor-utils.ts:124:32
   entity: EntityType,
 ): SelectedProduct[] => {
   const layers = (entity as ChartEntity | TableEntity).layers || [];
-  return layers.map((layer) => {
-    return {
-      id: generateUUID(),
-      channels: layer.channels,
-      fields: layer.fields,
-      dataset: layer.dataset,
-      mission: layer.mission,
-      version: layer.version,
-      instrument: layer.instrument,
-      ...(Array.isArray(layer.filter) ? { filter: layer.filter } : null),
-    } as SelectedProduct;
-  });
+  return layers.map((layer) => {});
 };
 
killedBy: extractEntitySelectedProducts maps each layer, copying fields and generating ids
statusReason: expected undefined to match object { mission: 'M', instrument: 'I', …(5) }
