[Killed] BlockStatement
src/utilities/api.ts:6:71
 import { DataResponse, DataResponseError, Product } from "../types/api";
 import { Channel, View } from "../types/view";
 
-export const getView = async (signal?: AbortSignal): Promise<View> => {
-  const url =
-    config.endpoints.data +
-    config.api.data.jsonStore
-      .replace("{METHOD}", "fetch")
-      .replace("{KEY}", "default-view");
-
-  const response = await fetch(url, {
-    credentials: "include",
-    method: "GET",
-    headers: {
-      "Content-Type": "application/json",
-    },
-    signal,
-  });
-
-  const json = await response.json();
-
-  if (response.status >= 200 && response.status <= 400) {
-    return json.data as View;
-  } else {
-    toast.error("Unable to load view", { richColors: true });
-    throw new Error(response.statusText);
-  }
-};
+export const getView = async (signal?: AbortSignal): Promise<View> => {};
 
 export const getMissions = async (
killedBy: getView requests the default view with JSON headers and credentials
statusReason: expected undefined to deeply equal { home: 'H' }

[Killed] ArithmeticOperator
src/utilities/api.ts:8:5
 
 export const getView = async (signal?: AbortSignal): Promise<View> => {
   const url =
-    config.endpoints.data +
-    config.api.data.jsonStore
-      .replace("{METHOD}", "fetch")
-      .replace("{KEY}", "default-view");
+    config.endpoints.data - config.api.data.jsonStore.replace("{METHOD}", "fetch").replace("{KEY}", "default-view");
 
   const response = await fetch(url, {
killedBy: getView requests the default view with JSON headers and credentials
statusReason: expected "spy" to be called with arguments: [ …(2) ]

Received: 

  1st spy call:

  Array [
-   "https://localhost:5173/api/ui/fetch/default-view",

[Killed] ObjectLiteral
src/utilities/api.ts:13:37
       .replace("{METHOD}", "fetch")
       .replace("{KEY}", "default-view");
 
-  const response = await fetch(url, {
-    credentials: "include",
-    method: "GET",
-    headers: {
-      "Content-Type": "application/json",
-    },
-    signal,
-  });
+  const response = await fetch(url, {});
 
   const json = await response.json();
killedBy: getView requests the default view with JSON headers and credentials
statusReason: expected "spy" to be called with arguments: [ …(2) ]

Received: 

  1st spy call:

  Array [
    "https://localhost:5173/api/ui/fetch/default-view",

[Killed] StringLiteral
src/utilities/api.ts:14:18
       .replace("{KEY}", "default-view");
 
   const response = await fetch(url, {
-    credentials: "include",
+    credentials: "",
     method: "GET",
     headers: {
killedBy: getView requests the default view with JSON headers and credentials
statusReason: expected "spy" to be called with arguments: [ …(2) ]

Received: 

  1st spy call:

  Array [
    "https://localhost:5173/api/ui/fetch/default-view",

[Killed] StringLiteral
src/utilities/api.ts:15:13
 
   const response = await fetch(url, {
     credentials: "include",
-    method: "GET",
+    method: "",
     headers: {
       "Content-Type": "application/json",
killedBy: getView requests the default view with JSON headers and credentials
statusReason: expected "spy" to be called with arguments: [ …(2) ]

Received: 

  1st spy call:

  Array [
    "https://localhost:5173/api/ui/fetch/default-view",

[Killed] EqualityOperator
src/utilities/api.ts:24:7
 
   const json = await response.json();
 
-  if (response.status >= 200 && response.status <= 400) {
+  if (response.status > 200 && response.status <= 400) {
     return json.data as View;
   } else {
killedBy: getView requests the default view with JSON headers and credentials
statusReason: HTTP 200

[Killed] EqualityOperator
src/utilities/api.ts:24:33
 
   const json = await response.json();
 
-  if (response.status >= 200 && response.status <= 400) {
+  if (response.status >= 200 && response.status > 400) {
     return json.data as View;
   } else {
killedBy: getView requests the default view with JSON headers and credentials
statusReason: HTTP 200

[Killed] BlockStatement
src/utilities/api.ts:26:10
 
   if (response.status >= 200 && response.status <= 400) {
     return json.data as View;
-  } else {
-    toast.error("Unable to load view", { richColors: true });
-    throw new Error(response.statusText);
-  }
+  } else {}
 };
 
killedBy: getView throws and toasts on a failed (>400) status
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BooleanLiteral
src/utilities/api.ts:27:54
   if (response.status >= 200 && response.status <= 400) {
     return json.data as View;
   } else {
-    toast.error("Unable to load view", { richColors: true });
+    toast.error("Unable to load view", { richColors: false });
     throw new Error(response.statusText);
   }
killedBy: getView throws and toasts on a failed (>400) status
statusReason: expected "spy" to be called with arguments: [ 'Unable to load view', …(1) ]

Received: 

  1st spy call:

  Array [
    "Unable to load view",

[Killed] BlockStatement
src/utilities/api.ts:39:6
     id: string;
     label: string;
   }[]
-> => {
-  const url = config.endpoints.data + config.api.data.missions;
-  const response = await (
-    await fetch(url, { signal, credentials: "include" })
-  ).json();
-  return response.data;
-};
+> => {};
 
 export const getProducts = async (
killedBy: getMissions returns data and targets the missions endpoint
statusReason: expected undefined to deeply equal [ { id: 'm1', label: 'M1' } ]

[Killed] ArithmeticOperator
src/utilities/api.ts:40:15
     label: string;
   }[]
 > => {
-  const url = config.endpoints.data + config.api.data.missions;
+  const url = config.endpoints.data - config.api.data.missions;
   const response = await (
     await fetch(url, { signal, credentials: "include" })
killedBy: getMissions returns data and targets the missions endpoint
statusReason: expected "spy" to be called with arguments: [ …(2) ]

Received: 

  1st spy call:

  Array [
-   "https://localhost:5173/api/missions/",

[Killed] ObjectLiteral
src/utilities/api.ts:42:22
 > => {
   const url = config.endpoints.data + config.api.data.missions;
   const response = await (
-    await fetch(url, { signal, credentials: "include" })
+    await fetch(url, {})
   ).json();
   return response.data;
killedBy: getMissions returns data and targets the missions endpoint
statusReason: expected "spy" to be called with arguments: [ …(2) ]

Received: 

  1st spy call:

  Array [
    "https://localhost:5173/api/missions/",

[Killed] BlockStatement
src/utilities/api.ts:50:26
 export const getProducts = async (
   missionId: string,
   signal: AbortSignal,
-): Promise<Product[]> => {
-  const url =
-    config.endpoints.data +
-    config.api.data.products.replace("{MISSION}", missionId);
-  const response = await (
-    await fetch(url, { signal, credentials: "include" })
-  ).json();
-  return response.data;
-};
+): Promise<Product[]> => {};
 
 export class HttpError extends Error {
killedBy: getProducts interpolates the mission id into the URL
statusReason: expected undefined to deeply equal [ { id: 'p1' } ]

[Killed] ArithmeticOperator
src/utilities/api.ts:52:5
   signal: AbortSignal,
 ): Promise<Product[]> => {
   const url =
-    config.endpoints.data +
-    config.api.data.products.replace("{MISSION}", missionId);
+    config.endpoints.data - config.api.data.products.replace("{MISSION}", missionId);
   const response = await (
     await fetch(url, { signal, credentials: "include" })
killedBy: getProducts interpolates the mission id into the URL
statusReason: expected "spy" to be called with arguments: [ …(2) ]

Received: 

  1st spy call:

  Array [
-   "https://localhost:5173/api/missions/GRACE/products",

[Killed] BlockStatement
src/utilities/api.ts:62:48
 
 export class HttpError extends Error {
   status: number;
-  constructor(message: string, status: number) {
-    super(message);
-    this.name = "HttpError";
-    this.status = status;
-  }
+  constructor(message: string, status: number) {}
 }
 
killedBy: isNotIngestedError is true only for 4xx HttpErrors
statusReason: Must call super constructor in derived class before accessing 'this' or returning from derived constructor

[Killed] ArrowFunction
src/utilities/api.ts:82:21
   filter?: string[],
 ) => {
   const fieldsString = fields.length
-    ? `${fields.map((f) => `&fields=${f}`).join("")}`
+    ? `${fields.map(() => undefined).join("")}`
     : "";
   let filtersString = channels.length
killedBy: getData builds a fully-parameterized URL and defers fetch until json()
statusReason: expected "spy" to be called with arguments: [ …(2) ]

Received: 

  1st spy call:

  Array [
-   "https://localhost:5173/api/missions/M/products/DS/versions/V/instruments/INSTR/data?from_isotimestamp=2020-01-01&to_isotimestamp=2020-02-01&fields=timestamp&fields=f1&fields=f2&filter=c1=v1&filter=c2=v2&filter=x=1&filter=y=2&downsampling_factor=5",

[Killed] StringLiteral
src/utilities/api.ts:82:49
   filter?: string[],
 ) => {
   const fieldsString = fields.length
-    ? `${fields.map((f) => `&fields=${f}`).join("")}`
+    ? `${fields.map((f) => `&fields=${f}`).join("Stryker was here!")}`
     : "";
   let filtersString = channels.length
killedBy: getData builds a fully-parameterized URL and defers fetch until json()
statusReason: expected "spy" to be called with arguments: [ …(2) ]

Received: 

  1st spy call:

  Array [
-   "https://localhost:5173/api/missions/M/products/DS/versions/V/instruments/INSTR/data?from_isotimestamp=2020-01-01&to_isotimestamp=2020-02-01&fields=timestamp&fields=f1&fields=f2&filter=c1=v1&filter=c2=v2&filter=x=1&filter=y=2&downsampling_factor=5",

[Killed] StringLiteral
src/utilities/api.ts:83:7
 ) => {
   const fieldsString = fields.length
     ? `${fields.map((f) => `&fields=${f}`).join("")}`
-    : "";
+    : "Stryker was here!";
   let filtersString = channels.length
     ? channels
killedBy: getData omits optional query segments when not provided
statusReason: expected "spy" to be called with arguments: [ …(2) ]

Received: 

  1st spy call:

  Array [
-   "https://localhost:5173/api/missions/M/products/DS/versions/V/instruments/INSTR/data?from_isotimestamp=s&to_isotimestamp=e&fields=timestamp",

[Killed] ArrowFunction
src/utilities/api.ts:86:14
     : "";
   let filtersString = channels.length
     ? channels
-        .map((channel) => `&filter=${channel.id}=${channel.value}`)
+        .map(() => undefined)
         .join("")
     : "";
killedBy: getData builds a fully-parameterized URL and defers fetch until json()
statusReason: expected "spy" to be called with arguments: [ …(2) ]

Received: 

  1st spy call:

  Array [
-   "https://localhost:5173/api/missions/M/products/DS/versions/V/instruments/INSTR/data?from_isotimestamp=2020-01-01&to_isotimestamp=2020-02-01&fields=timestamp&fields=f1&fields=f2&filter=c1=v1&filter=c2=v2&filter=x=1&filter=y=2&downsampling_factor=5",

[Killed] StringLiteral
src/utilities/api.ts:87:15
   let filtersString = channels.length
     ? channels
         .map((channel) => `&filter=${channel.id}=${channel.value}`)
-        .join("")
+        .join("Stryker was here!")
     : "";
   if (Array.isArray(filter) && filter.length > 0) {
killedBy: getData builds a fully-parameterized URL and defers fetch until json()
statusReason: expected "spy" to be called with arguments: [ …(2) ]

Received: 

  1st spy call:

  Array [
-   "https://localhost:5173/api/missions/M/products/DS/versions/V/instruments/INSTR/data?from_isotimestamp=2020-01-01&to_isotimestamp=2020-02-01&fields=timestamp&fields=f1&fields=f2&filter=c1=v1&filter=c2=v2&filter=x=1&filter=y=2&downsampling_factor=5",

[Killed] StringLiteral
src/utilities/api.ts:88:7
     ? channels
         .map((channel) => `&filter=${channel.id}=${channel.value}`)
         .join("")
-    : "";
+    : "Stryker was here!";
   if (Array.isArray(filter) && filter.length > 0) {
     filtersString += filter.map((f) => `&filter=${f}`).join("");
killedBy: getData omits optional query segments when not provided
statusReason: expected "spy" to be called with arguments: [ …(2) ]

Received: 

  1st spy call:

  Array [
-   "https://localhost:5173/api/missions/M/products/DS/versions/V/instruments/INSTR/data?from_isotimestamp=s&to_isotimestamp=e&fields=timestamp",

[Killed] LogicalOperator
src/utilities/api.ts:89:7
         .map((channel) => `&filter=${channel.id}=${channel.value}`)
         .join("")
     : "";
-  if (Array.isArray(filter) && filter.length > 0) {
+  if (Array.isArray(filter) || filter.length > 0) {
     filtersString += filter.map((f) => `&filter=${f}`).join("");
   }
killedBy: getData omits optional query segments when not provided
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ConditionalExpression
src/utilities/api.ts:89:7
         .map((channel) => `&filter=${channel.id}=${channel.value}`)
         .join("")
     : "";
-  if (Array.isArray(filter) && filter.length > 0) {
+  if (false) {
     filtersString += filter.map((f) => `&filter=${f}`).join("");
   }
killedBy: getData builds a fully-parameterized URL and defers fetch until json()
statusReason: expected "spy" to be called with arguments: [ …(2) ]

Received: 

  1st spy call:

  Array [
-   "https://localhost:5173/api/missions/M/products/DS/versions/V/instruments/INSTR/data?from_isotimestamp=2020-01-01&to_isotimestamp=2020-02-01&fields=timestamp&fields=f1&fields=f2&filter=c1=v1&filter=c2=v2&filter=x=1&filter=y=2&downsampling_factor=5",

[Killed] AssignmentOperator
src/utilities/api.ts:90:5
         .join("")
     : "";
   if (Array.isArray(filter) && filter.length > 0) {
-    filtersString += filter.map((f) => `&filter=${f}`).join("");
+    filtersString -= filter.map(f => `&filter=${f}`).join("");
   }
   const url =
killedBy: getData builds a fully-parameterized URL and defers fetch until json()
statusReason: expected "spy" to be called with arguments: [ …(2) ]

Received: 

  1st spy call:

  Array [
-   "https://localhost:5173/api/missions/M/products/DS/versions/V/instruments/INSTR/data?from_isotimestamp=2020-01-01&to_isotimestamp=2020-02-01&fields=timestamp&fields=f1&fields=f2&filter=c1=v1&filter=c2=v2&filter=x=1&filter=y=2&downsampling_factor=5",

[Killed] ArrowFunction
src/utilities/api.ts:90:33
         .join("")
     : "";
   if (Array.isArray(filter) && filter.length > 0) {
-    filtersString += filter.map((f) => `&filter=${f}`).join("");
+    filtersString += filter.map(() => undefined).join("");
   }
   const url =
killedBy: getData builds a fully-parameterized URL and defers fetch until json()
statusReason: expected "spy" to be called with arguments: [ …(2) ]

Received: 

  1st spy call:

  Array [
-   "https://localhost:5173/api/missions/M/products/DS/versions/V/instruments/INSTR/data?from_isotimestamp=2020-01-01&to_isotimestamp=2020-02-01&fields=timestamp&fields=f1&fields=f2&filter=c1=v1&filter=c2=v2&filter=x=1&filter=y=2&downsampling_factor=5",

[Killed] ArithmeticOperator
src/utilities/api.ts:93:5
     filtersString += filter.map((f) => `&filter=${f}`).join("");
   }
   const url =
-    config.endpoints.data +
-    config.api.data.data
-      .replace("{MISSION}", missionId)
-      .replace("{INSTRUMENT}", instrumentId)
-      .replace("{DATASET}", dataset)
-      .replace("{VERSION}", version) +
+    config.endpoints.data - config.api.data.data.replace("{MISSION}", missionId).replace("{INSTRUMENT}", instrumentId).replace("{DATASET}", dataset).replace("{VERSION}", version) +
     `?from_isotimestamp=${startTime}&to_isotimestamp=${endTime}&fields=timestamp${fieldsString}${filtersString}${
       typeof downsamplingFactor === "number"
killedBy: getData builds a fully-parameterized URL and defers fetch until json()
statusReason: expected "spy" to be called with arguments: [ …(2) ]

Received: 

  1st spy call:

  Array [
-   "https://localhost:5173/api/missions/M/products/DS/versions/V/instruments/INSTR/data?from_isotimestamp=2020-01-01&to_isotimestamp=2020-02-01&fields=timestamp&fields=f1&fields=f2&filter=c1=v1&filter=c2=v2&filter=x=1&filter=y=2&downsampling_factor=5",

[Killed] StringLiteral
src/utilities/api.ts:98:16
       .replace("{MISSION}", missionId)
       .replace("{INSTRUMENT}", instrumentId)
       .replace("{DATASET}", dataset)
-      .replace("{VERSION}", version) +
+      .replace("", version) +
     `?from_isotimestamp=${startTime}&to_isotimestamp=${endTime}&fields=timestamp${fieldsString}${filtersString}${
       typeof downsamplingFactor === "number"
killedBy: getData builds a fully-parameterized URL and defers fetch until json()
statusReason: expected "spy" to be called with arguments: [ …(2) ]

Received: 

  1st spy call:

  Array [
-   "https://localhost:5173/api/missions/M/products/DS/versions/V/instruments/INSTR/data?from_isotimestamp=2020-01-01&to_isotimestamp=2020-02-01&fields=timestamp&fields=f1&fields=f2&filter=c1=v1&filter=c2=v2&filter=x=1&filter=y=2&downsampling_factor=5",

[Killed] ConditionalExpression
src/utilities/api.ts:100:7
       .replace("{DATASET}", dataset)
       .replace("{VERSION}", version) +
     `?from_isotimestamp=${startTime}&to_isotimestamp=${endTime}&fields=timestamp${fieldsString}${filtersString}${
-      typeof downsamplingFactor === "number"
+      true
         ? `&downsampling_factor=${downsamplingFactor}`
         : ""
killedBy: getData omits optional query segments when not provided
statusReason: expected "spy" to be called with arguments: [ …(2) ]

Received: 

  1st spy call:

  Array [
-   "https://localhost:5173/api/missions/M/products/DS/versions/V/instruments/INSTR/data?from_isotimestamp=s&to_isotimestamp=e&fields=timestamp",

[Killed] ConditionalExpression
src/utilities/api.ts:100:7
       .replace("{DATASET}", dataset)
       .replace("{VERSION}", version) +
     `?from_isotimestamp=${startTime}&to_isotimestamp=${endTime}&fields=timestamp${fieldsString}${filtersString}${
-      typeof downsamplingFactor === "number"
+      false
         ? `&downsampling_factor=${downsamplingFactor}`
         : ""
killedBy: getData builds a fully-parameterized URL and defers fetch until json()
statusReason: expected "spy" to be called with arguments: [ …(2) ]

Received: 

  1st spy call:

  Array [
-   "https://localhost:5173/api/missions/M/products/DS/versions/V/instruments/INSTR/data?from_isotimestamp=2020-01-01&to_isotimestamp=2020-02-01&fields=timestamp&fields=f1&fields=f2&filter=c1=v1&filter=c2=v2&filter=x=1&filter=y=2&downsampling_factor=5",

[Killed] ArrowFunction
src/utilities/api.ts:106:18
     }`;
 
   const controller = new AbortController();
-  const cancel = () => controller.abort();
+  const cancel = () => undefined;
   const json = () =>
     new Promise<DataResponse>((resolve, reject) => {
killedBy: getData.cancel() aborts the request controller
statusReason: expected "abort" to be called 1 times, but got 0 times

[Killed] ObjectLiteral
src/utilities/api.ts:109:18
   const cancel = () => controller.abort();
   const json = () =>
     new Promise<DataResponse>((resolve, reject) => {
-      fetch(url, { signal: controller.signal, credentials: "include" })
+      fetch(url, {})
         .then((response) => {
           if (response.ok) {
killedBy: getData builds a fully-parameterized URL and defers fetch until json()
statusReason: expected "spy" to be called with arguments: [ …(2) ]

Received: 

  1st spy call:

  Array [
    "https://localhost:5173/api/missions/M/products/DS/versions/V/instruments/INSTR/data?from_isotimestamp=2020-01-01&to_isotimestamp=2020-02-01&fields=timestamp&fields=f1&fields=f2&filter=c1=v1&filter=c2=v2&filter=x=1&filter=y=2&downsampling_factor=5",

[Killed] BlockStatement
src/utilities/api.ts:111:28
     new Promise<DataResponse>((resolve, reject) => {
       fetch(url, { signal: controller.signal, credentials: "include" })
         .then((response) => {
-          if (response.ok) {
-            response
-              .json()
-              .then((json) => {
-                if (response.status >= 400) {
-                  throw new Error(
-                    (json as DataResponseError).detail || "Unknown error",
-                  );
-                } else {
-                  resolve(json as DataResponse);
-                }
-              })
-              .catch((error) => {
-                reject(error);
-              });
-          } else {
+          if (response.ok) {} else {
             response
               .json()
killedBy: getData builds a fully-parameterized URL and defers fetch until json()
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ConditionalExpression
src/utilities/api.ts:111:15
     new Promise<DataResponse>((resolve, reject) => {
       fetch(url, { signal: controller.signal, credentials: "include" })
         .then((response) => {
-          if (response.ok) {
+          if (false) {
             response
               .json()
killedBy: getData builds a fully-parameterized URL and defers fetch until json()
statusReason: HTTP 200

[Killed] BlockStatement
src/utilities/api.ts:114:31
           if (response.ok) {
             response
               .json()
-              .then((json) => {
-                if (response.status >= 400) {
-                  throw new Error(
-                    (json as DataResponseError).detail || "Unknown error",
-                  );
-                } else {
-                  resolve(json as DataResponse);
-                }
-              })
+              .then((json) => {})
               .catch((error) => {
                 reject(error);
killedBy: getData builds a fully-parameterized URL and defers fetch until json()
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ConditionalExpression
src/utilities/api.ts:115:21
             response
               .json()
               .then((json) => {
-                if (response.status >= 400) {
+                if (true) {
                   throw new Error(
                     (json as DataResponseError).detail || "Unknown error",
killedBy: getData builds a fully-parameterized URL and defers fetch until json()
statusReason: Unknown error

[Killed] EqualityOperator
src/utilities/api.ts:115:21
             response
               .json()
               .then((json) => {
-                if (response.status >= 400) {
+                if (response.status < 400) {
                   throw new Error(
                     (json as DataResponseError).detail || "Unknown error",
killedBy: getData builds a fully-parameterized URL and defers fetch until json()
statusReason: Unknown error

[Killed] ConditionalExpression
src/utilities/api.ts:117:21
               .then((json) => {
                 if (response.status >= 400) {
                   throw new Error(
-                    (json as DataResponseError).detail || "Unknown error",
+                    true,
                   );
                 } else {
killedBy: getData.json() throws with the body detail when an ok response reports status >= 400
statusReason: expected [Function] to throw error including 'still bad' but got 'true'

[Killed] LogicalOperator
src/utilities/api.ts:117:21
               .then((json) => {
                 if (response.status >= 400) {
                   throw new Error(
-                    (json as DataResponseError).detail || "Unknown error",
+                    (json as DataResponseError).detail && "Unknown error",
                   );
                 } else {
killedBy: getData.json() throws with the body detail when an ok response reports status >= 400
statusReason: expected [Function] to throw error including 'still bad' but got 'Unknown error'

[Killed] BlockStatement
src/utilities/api.ts:119:24
                   throw new Error(
                     (json as DataResponseError).detail || "Unknown error",
                   );
-                } else {
-                  resolve(json as DataResponse);
-                }
+                } else {}
               })
               .catch((error) => {
killedBy: getData builds a fully-parameterized URL and defers fetch until json()
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/utilities/api.ts:123:33
                   resolve(json as DataResponse);
                 }
               })
-              .catch((error) => {
-                reject(error);
-              });
+              .catch((error) => {});
           } else {
             response
killedBy: getData.json() throws with the body detail when an ok response reports status >= 400
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/utilities/api.ts:126:18
               .catch((error) => {
                 reject(error);
               });
-          } else {
-            response
-              .json()
-              .then((json) => {
-                reject(
-                  new HttpError(
-                    (json as DataResponseError).detail || response.statusText,
-                    response.status
-                  )
-                );
-              })
-              .catch(() => {
-                reject(new HttpError(response.statusText, response.status));
-              });
-          }
+          } else {}
         })
         .catch((error) => {
killedBy: getData.json() rejects with an HttpError (using detail) on a non-ok response
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/utilities/api.ts:129:31
           } else {
             response
               .json()
-              .then((json) => {
-                reject(
-                  new HttpError(
-                    (json as DataResponseError).detail || response.statusText,
-                    response.status
-                  )
-                );
-              })
+              .then((json) => {})
               .catch(() => {
                 reject(new HttpError(response.statusText, response.status));
killedBy: getData.json() rejects with an HttpError (using detail) on a non-ok response
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ConditionalExpression
src/utilities/api.ts:132:21
               .then((json) => {
                 reject(
                   new HttpError(
-                    (json as DataResponseError).detail || response.statusText,
+                    true,
                     response.status
                   )
killedBy: getData.json() rejects with an HttpError (using detail) on a non-ok response
statusReason: expected HttpError: true { status: 500 } to match object { Object (name, status, ...) }

[Killed] LogicalOperator
src/utilities/api.ts:132:21
               .then((json) => {
                 reject(
                   new HttpError(
-                    (json as DataResponseError).detail || response.statusText,
+                    (json as DataResponseError).detail && response.statusText,
                     response.status
                   )
killedBy: getData.json() rejects with an HttpError (using detail) on a non-ok response
statusReason: expected HttpError: HTTP 500 { status: 500 } to match object { Object (name, status, ...) }

[Killed] BlockStatement
src/utilities/api.ts:137:28
                   )
                 );
               })
-              .catch(() => {
-                reject(new HttpError(response.statusText, response.status));
-              });
+              .catch(() => {});
           }
         })
killedBy: getData.json() falls back to statusText when the error body is not JSON
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ObjectLiteral
src/utilities/api.ts:146:10
           reject(error);
         });
     });
-  return { json, cancel };
+  return {};
   // return fetchWithProgress<DataResponse>(url);
 };
killedBy: getData builds a fully-parameterized URL and defers fetch until json()
statusReason: json is not a function

[Killed] BlockStatement
src/utilities/api.ts:150:44
   // return fetchWithProgress<DataResponse>(url);
 };
 
-export async function saveView(view: View) {
-  const url =
-    config.endpoints.data +
-    config.api.data.jsonStore
-      .replace("{METHOD}", "store")
-      .replace("{KEY}", "default-view");
-
-  const response = await fetch(url, {
-    credentials: "include",
-    method: "POST",
-    body: JSON.stringify({ data: view }),
-    headers: {
-      "Content-Type": "application/json",
-    },
-  });
-
-  if (response.status >= 200 && response.status <= 400) {
-    toast.success("View saved");
-    return true;
-  } else {
-    throw new Error(response.statusText);
-  }
-}
+export async function saveView(view: View) {}
 
killedBy: saveView POSTs the wrapped view and toasts on success
statusReason: expected undefined to be true // Object.is equality
