[Killed] ArithmeticOperator
src/utilities/api.ts:152:5
 
 export async function saveView(view: View) {
   const url =
-    config.endpoints.data +
-    config.api.data.jsonStore
-      .replace("{METHOD}", "store")
-      .replace("{KEY}", "default-view");
+    config.endpoints.data - config.api.data.jsonStore.replace("{METHOD}", "store").replace("{KEY}", "default-view");
 
   const response = await fetch(url, {
killedBy: saveView POSTs the wrapped view and toasts on success
statusReason: expected "spy" to be called with arguments: [ …(2) ]

Received: 

  1st spy call:

  Array [
-   "https://localhost:5173/api/ui/store/default-view",

[Killed] StringLiteral
src/utilities/api.ts:155:25
     config.endpoints.data +
     config.api.data.jsonStore
       .replace("{METHOD}", "store")
-      .replace("{KEY}", "default-view");
+      .replace("{KEY}", "");
 
   const response = await fetch(url, {
killedBy: saveView POSTs the wrapped view and toasts on success
statusReason: expected "spy" to be called with arguments: [ …(2) ]

Received: 

  1st spy call:

  Array [
-   "https://localhost:5173/api/ui/store/default-view",

[Killed] StringLiteral
src/utilities/api.ts:155:16
     config.endpoints.data +
     config.api.data.jsonStore
       .replace("{METHOD}", "store")
-      .replace("{KEY}", "default-view");
+      .replace("", "default-view");
 
   const response = await fetch(url, {
killedBy: saveView POSTs the wrapped view and toasts on success
statusReason: expected "spy" to be called with arguments: [ …(2) ]

Received: 

  1st spy call:

  Array [
-   "https://localhost:5173/api/ui/store/default-view",

[Killed] StringLiteral
src/utilities/api.ts:159:13
 
   const response = await fetch(url, {
     credentials: "include",
-    method: "POST",
+    method: "",
     body: JSON.stringify({ data: view }),
     headers: {
killedBy: saveView POSTs the wrapped view and toasts on success
statusReason: expected "spy" to be called with arguments: [ …(2) ]

Received: 

  1st spy call:

  Array [
    "https://localhost:5173/api/ui/store/default-view",

[Killed] BlockStatement
src/utilities/api.ts:166:57
     },
   });
 
-  if (response.status >= 200 && response.status <= 400) {
-    toast.success("View saved");
-    return true;
-  } else {
+  if (response.status >= 200 && response.status <= 400) {} else {
     throw new Error(response.statusText);
   }
killedBy: saveView POSTs the wrapped view and toasts on success
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
src/utilities/api.ts:166:33
     },
   });
 
-  if (response.status >= 200 && response.status <= 400) {
+  if (response.status >= 200 && true) {
     toast.success("View saved");
     return true;
killedBy: saveView throws on a failed status and does not toast success
statusReason: promise resolved "true" instead of rejecting

[Killed] BooleanLiteral
src/utilities/api.ts:168:12
 
   if (response.status >= 200 && response.status <= 400) {
     toast.success("View saved");
-    return true;
+    return false;
   } else {
     throw new Error(response.statusText);
killedBy: saveView POSTs the wrapped view and toasts on success
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/utilities/api.ts:169:10
   if (response.status >= 200 && response.status <= 400) {
     toast.success("View saved");
     return true;
-  } else {
-    throw new Error(response.statusText);
-  }
+  } else {}
 }
 
killedBy: saveView throws on a failed status and does not toast success
statusReason: promise resolved "undefined" instead of rejecting
