[Killed] BlockStatement
src/utilities/generic.ts:7:32
 /**
  * Generates unique ID
  */
-export function generateUUID() {
-  return uuidv4();
-}
+export function generateUUID() {}
 
 export function fetchWithProgress<T>(url: string) {
killedBy: applyLayerTransform
statusReason: expected +0 to be 3 // Object.is equality

[Survived] BooleanLiteral
src/utilities/generic.ts:12:17
 }
 
 export function fetchWithProgress<T>(url: string) {
-  let loading = false;
+  let loading = true;
   let chunks: Uint8Array[] = [];
   let results = null;

[Survived] ArrayDeclaration
src/utilities/generic.ts:13:30
 
 export function fetchWithProgress<T>(url: string) {
   let loading = false;
-  let chunks: Uint8Array[] = [];
+  let chunks: Uint8Array[] = ["Stryker was here"];
   let results = null;
   let error = null;

[Killed] BlockStatement
src/utilities/generic.ts:19:53
   let controller: AbortController | null = null;
   const target = new EventTarget();
 
-  const json = async (options: RequestInit = {}) => {
-    _resetLocals();
-    const signal = controller?.signal;
-    loading = true;
-
-    try {
-      const response = await fetch(url, { signal, ...options });
-
-      if (response.status >= 200 && response.status < 300) {
-        results = (await _readBody(response)) || "";
-        return { result: JSON.parse(results) as T };
-      } else {
-        throw new Error(response.statusText);
-      }
-    } catch (err) {
-      error = err as Error;
-      results = null;
-      return { error };
-    } finally {
-      loading = false;
-    }
-  };
+  const json = async (options: RequestInit = {}) => {};
 
   const _readBody = async (response: Response) => {
killedBy: fetchWithProgress streams a body, emits progress/complete, and parses JSON
statusReason: expected "spy" to be called with arguments: [ Array(2) ]

Received: 



Number of calls: 0

[Survived] OptionalChaining
src/utilities/generic.ts:21:20
 
   const json = async (options: RequestInit = {}) => {
     _resetLocals();
-    const signal = controller?.signal;
+    const signal = controller.signal;
     loading = true;
 

[Killed] BooleanLiteral
src/utilities/generic.ts:22:15
   const json = async (options: RequestInit = {}) => {
     _resetLocals();
     const signal = controller?.signal;
-    loading = true;
+    loading = false;
 
     try {
killedBy: fetchWithProgress streams a body, emits progress/complete, and parses JSON
statusReason: expected { …(1) } to deeply equal { result: { value: 42 } }

[Killed] BlockStatement
src/utilities/generic.ts:24:9
     const signal = controller?.signal;
     loading = true;
 
-    try {
-      const response = await fetch(url, { signal, ...options });
-
-      if (response.status >= 200 && response.status < 300) {
-        results = (await _readBody(response)) || "";
-        return { result: JSON.parse(results) as T };
-      } else {
-        throw new Error(response.statusText);
-      }
-    } catch (err) {
+    try {} catch (err) {
       error = err as Error;
       results = null;
killedBy: fetchWithProgress streams a body, emits progress/complete, and parses JSON
statusReason: expected "spy" to be called with arguments: [ Array(2) ]

Received: 



Number of calls: 0

[Killed] ObjectLiteral
src/utilities/generic.ts:25:41
     loading = true;
 
     try {
-      const response = await fetch(url, { signal, ...options });
+      const response = await fetch(url, {});
 
       if (response.status >= 200 && response.status < 300) {
killedBy: fetchWithProgress streams a body, emits progress/complete, and parses JSON
statusReason: expected "spy" to be called with arguments: [ Array(2) ]

Received: 

  1st spy call:

  Array [
    "http://x/data",

[Killed] ConditionalExpression
src/utilities/generic.ts:27:11
     try {
       const response = await fetch(url, { signal, ...options });
 
-      if (response.status >= 200 && response.status < 300) {
+      if (true) {
         results = (await _readBody(response)) || "";
         return { result: JSON.parse(results) as T };
killedBy: fetchWithProgress rejects sub-200 and 3xx statuses (boundary)
statusReason: expected undefined to be an instance of Error

[Killed] ConditionalExpression
src/utilities/generic.ts:27:11
     try {
       const response = await fetch(url, { signal, ...options });
 
-      if (response.status >= 200 && response.status < 300) {
+      if (true && response.status < 300) {
         results = (await _readBody(response)) || "";
         return { result: JSON.parse(results) as T };
killedBy: fetchWithProgress rejects sub-200 and 3xx statuses (boundary)
statusReason: expected undefined to be an instance of Error

[Killed] ConditionalExpression
src/utilities/generic.ts:28:19
       const response = await fetch(url, { signal, ...options });
 
       if (response.status >= 200 && response.status < 300) {
-        results = (await _readBody(response)) || "";
+        results = true;
         return { result: JSON.parse(results) as T };
       } else {
killedBy: fetchWithProgress streams a body, emits progress/complete, and parses JSON
statusReason: expected { result: true } to deeply equal { result: { value: 42 } }

[Killed] ConditionalExpression
src/utilities/generic.ts:28:19
       const response = await fetch(url, { signal, ...options });
 
       if (response.status >= 200 && response.status < 300) {
-        results = (await _readBody(response)) || "";
+        results = false;
         return { result: JSON.parse(results) as T };
       } else {
killedBy: fetchWithProgress streams a body, emits progress/complete, and parses JSON
statusReason: expected { result: false } to deeply equal { result: { value: 42 } }

[Killed] ObjectLiteral
src/utilities/generic.ts:29:16
 
       if (response.status >= 200 && response.status < 300) {
         results = (await _readBody(response)) || "";
-        return { result: JSON.parse(results) as T };
+        return {};
       } else {
         throw new Error(response.statusText);
killedBy: fetchWithProgress streams a body, emits progress/complete, and parses JSON
statusReason: expected {} to deeply equal { result: { value: 42 } }

[Killed] BlockStatement
src/utilities/generic.ts:30:14
       if (response.status >= 200 && response.status < 300) {
         results = (await _readBody(response)) || "";
         return { result: JSON.parse(results) as T };
-      } else {
-        throw new Error(response.statusText);
-      }
+      } else {}
     } catch (err) {
       error = err as Error;
killedBy: fetchWithProgress rejects sub-200 and 3xx statuses (boundary)
statusReason: Cannot read properties of undefined (reading 'error')

[Killed] BlockStatement
src/utilities/generic.ts:33:19
       } else {
         throw new Error(response.statusText);
       }
-    } catch (err) {
-      error = err as Error;
-      results = null;
-      return { error };
-    } finally {
+    } catch (err) {} finally {
       loading = false;
     }
killedBy: fetchWithProgress rejects sub-200 and 3xx statuses (boundary)
statusReason: Cannot read properties of undefined (reading 'error')

[Survived] BlockStatement
src/utilities/generic.ts:37:15
       error = err as Error;
       results = null;
       return { error };
-    } finally {
-      loading = false;
-    }
+    } finally {}
   };
 

[Survived] BooleanLiteral
src/utilities/generic.ts:38:17
       results = null;
       return { error };
     } finally {
-      loading = false;
+      loading = true;
     }
   };

[Killed] BooleanLiteral
src/utilities/generic.ts:43:9
   };
 
   const _readBody = async (response: Response) => {
-    if (!response.body || !response.headers) {
+    if (response.body || !response.headers) {
       target.dispatchEvent(new CustomEvent("failure"));
       return;
killedBy: fetchWithProgress streams a body, emits progress/complete, and parses JSON
statusReason: expected { …(1) } to deeply equal { result: { value: 42 } }

[Killed] BlockStatement
src/utilities/generic.ts:43:46
   };
 
   const _readBody = async (response: Response) => {
-    if (!response.body || !response.headers) {
-      target.dispatchEvent(new CustomEvent("failure"));
-      return;
-    }
+    if (!response.body || !response.headers) {}
     const reader = response.body.getReader();
     const length = +(response.headers.get("content-length") || 0);
killedBy: fetchWithProgress dispatches failure and errors when the response has no body
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] StringLiteral
src/utilities/generic.ts:44:44
 
   const _readBody = async (response: Response) => {
     if (!response.body || !response.headers) {
-      target.dispatchEvent(new CustomEvent("failure"));
+      target.dispatchEvent(new CustomEvent(""));
       return;
     }
killedBy: fetchWithProgress dispatches failure and errors when the response has no body
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] UnaryOperator
src/utilities/generic.ts:48:20
       return;
     }
     const reader = response.body.getReader();
-    const length = +(response.headers.get("content-length") || 0);
+    const length = -(response.headers.get("content-length") || 0);
     let received = 0;
 
killedBy: fetchWithProgress streams a body, emits progress/complete, and parses JSON
statusReason: expected -12 to be 12 // Object.is equality

[Killed] ConditionalExpression
src/utilities/generic.ts:48:22
       return;
     }
     const reader = response.body.getReader();
-    const length = +(response.headers.get("content-length") || 0);
+    const length = +(true);
     let received = 0;
 
killedBy: fetchWithProgress streams a body, emits progress/complete, and parses JSON
statusReason: expected 1 to be 12 // Object.is equality

[Killed] ConditionalExpression
src/utilities/generic.ts:52:12
     let received = 0;
 
     // Loop through the response stream and extract data chunks
-    while (loading) {
+    while (false) {
       const { done, value } = await reader.read();
       const payload = { detail: { received, length, loading } };
killedBy: fetchWithProgress streams a body, emits progress/complete, and parses JSON
statusReason: expected { …(1) } to deeply equal { result: { value: 42 } }

[Timeout] BlockStatement
src/utilities/generic.ts:52:21
     let received = 0;
 
     // Loop through the response stream and extract data chunks
-    while (loading) {
-      const { done, value } = await reader.read();
-      const payload = { detail: { received, length, loading } };
-      // const onProgress =  new CustomEvent("fetch-progress", payload);
-      // const onFinished = new CustomEvent("fetch-finished", payload);
-
-      if (done) {
-        // Finish loading
-        loading = false;
-        target.dispatchEvent(new CustomEvent("complete", payload));
-      } else {
-        // Push values to the chunk array
-        chunks.push(value);
-        received += value.length;
-        target.dispatchEvent(new CustomEvent("progress", payload));
-      }
-    }
+    while (loading) {}
 
     // Concat the chinks into a single array

[Killed] ConditionalExpression
src/utilities/generic.ts:58:11
       // const onProgress =  new CustomEvent("fetch-progress", payload);
       // const onFinished = new CustomEvent("fetch-finished", payload);
 
-      if (done) {
+      if (false) {
         // Finish loading
         loading = false;
killedBy: fetchWithProgress streams a body, emits progress/complete, and parses JSON
statusReason: expected { …(1) } to deeply equal { result: { value: 42 } }

[Killed] ConditionalExpression
src/utilities/generic.ts:58:11
       // const onProgress =  new CustomEvent("fetch-progress", payload);
       // const onFinished = new CustomEvent("fetch-finished", payload);
 
-      if (done) {
+      if (true) {
         // Finish loading
         loading = false;
killedBy: fetchWithProgress streams a body, emits progress/complete, and parses JSON
statusReason: expected { …(1) } to deeply equal { result: { value: 42 } }

[Timeout] BooleanLiteral
src/utilities/generic.ts:60:19
 
       if (done) {
         // Finish loading
-        loading = false;
+        loading = true;
         target.dispatchEvent(new CustomEvent("complete", payload));
       } else {

[Killed] StringLiteral
src/utilities/generic.ts:61:46
       if (done) {
         // Finish loading
         loading = false;
-        target.dispatchEvent(new CustomEvent("complete", payload));
+        target.dispatchEvent(new CustomEvent("", payload));
       } else {
         // Push values to the chunk array
killedBy: fetchWithProgress streams a body, emits progress/complete, and parses JSON
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] BlockStatement
src/utilities/generic.ts:62:14
         // Finish loading
         loading = false;
         target.dispatchEvent(new CustomEvent("complete", payload));
-      } else {
-        // Push values to the chunk array
-        chunks.push(value);
-        received += value.length;
-        target.dispatchEvent(new CustomEvent("progress", payload));
-      }
+      } else {}
     }
 
killedBy: fetchWithProgress streams a body, emits progress/complete, and parses JSON
statusReason: expected { …(1) } to deeply equal { result: { value: 42 } }

[Killed] AssignmentOperator
src/utilities/generic.ts:65:9
       } else {
         // Push values to the chunk array
         chunks.push(value);
-        received += value.length;
+        received -= value.length;
         target.dispatchEvent(new CustomEvent("progress", payload));
       }
killedBy: fetchWithProgress streams a body, emits progress/complete, and parses JSON
statusReason: expected { …(1) } to deeply equal { result: { value: 42 } }

[Killed] BlockStatement
src/utilities/generic.ts:75:33
     let position = 0;
 
     // Order the chunks by their respective position
-    for (const chunk of chunks) {
-      body.set(chunk, position);
-      position += chunk.length;
-    }
+    for (const chunk of chunks) {}
 
     // Decode the response and return it
killedBy: fetchWithProgress streams a body, emits progress/complete, and parses JSON
statusReason: expected { …(1) } to deeply equal { result: { value: 42 } }

[Killed] AssignmentOperator
src/utilities/generic.ts:77:7
     // Order the chunks by their respective position
     for (const chunk of chunks) {
       body.set(chunk, position);
-      position += chunk.length;
+      position -= chunk.length;
     }
 
killedBy: fetchWithProgress streams a body, emits progress/complete, and parses JSON
statusReason: expected { …(1) } to deeply equal { result: { value: 42 } }

[Killed] StringLiteral
src/utilities/generic.ts:81:28
     }
 
     // Decode the response and return it
-    return new TextDecoder("utf-8").decode(body);
+    return new TextDecoder("").decode(body);
   };
 
killedBy: fetchWithProgress streams a body, emits progress/complete, and parses JSON
statusReason: expected { …(1) } to deeply equal { result: { value: 42 } }

[Killed] BlockStatement
src/utilities/generic.ts:84:30
     return new TextDecoder("utf-8").decode(body);
   };
 
-  const _resetLocals = () => {
-    loading = false;
-
-    chunks = [];
-    results = null;
-    error = null;
-
-    controller = new AbortController();
-  };
+  const _resetLocals = () => {};
 
   const cancel = () => {
killedBy: fetchWithProgress streams a body, emits progress/complete, and parses JSON
statusReason: expected "spy" to be called with arguments: [ Array(2) ]

Received: 

  1st spy call:

  Array [
    "http://x/data",

[Survived] BooleanLiteral
src/utilities/generic.ts:85:15
   };
 
   const _resetLocals = () => {
-    loading = false;
+    loading = true;
 
     chunks = [];

[Killed] ArrayDeclaration
src/utilities/generic.ts:87:14
   const _resetLocals = () => {
     loading = false;
 
-    chunks = [];
+    chunks = ["Stryker was here"];
     results = null;
     error = null;
killedBy: fetchWithProgress streams a body, emits progress/complete, and parses JSON
statusReason: expected { …(1) } to deeply equal { result: { value: 42 } }

[Survived] BlockStatement
src/utilities/generic.ts:94:24
     controller = new AbortController();
   };
 
-  const cancel = () => {
-    controller?.abort();
-    _resetLocals();
-  };
+  const cancel = () => {};
 
   return { target, json, cancel };

[Killed] OptionalChaining
src/utilities/generic.ts:95:5
   };
 
   const cancel = () => {
-    controller?.abort();
+    controller.abort();
     _resetLocals();
   };
killedBy: fetchWithProgress cancel() aborts without throwing
statusReason: expected [Function] to not throw an error but 'TypeError: Cannot read properties of …' was thrown

[Killed] BlockStatement
src/utilities/generic.ts:106:58
  * Returns unique identifier for a layer which currently comprises of:
  * mission, dataset, field, and instrument
  */
-export function getDataLayerId(layer: DataLayer): string {
-  return `${layer.mission}_${layer.dataset}_${layer.fields.join("_")}_${
-    layer.instrument
-  }_${
-    layer.channels
-      ? layer.channels.map((c) => `${c.id}_${c.value}`).join("_")
-      : ""
-  }${layer.version}_${layer.id}`;
-}
+export function getDataLayerId(layer: DataLayer): string {}
 
 /**
killedBy: getDataLayerId
statusReason: expected undefined to deeply equal 'MISSION_DATASET_FIELD1_FIELD2_INSTRUM…'

[Killed] StringLiteral
src/utilities/generic.ts:107:65
  * mission, dataset, field, and instrument
  */
 export function getDataLayerId(layer: DataLayer): string {
-  return `${layer.mission}_${layer.dataset}_${layer.fields.join("_")}_${
+  return `${layer.mission}_${layer.dataset}_${layer.fields.join("")}_${
     layer.instrument
   }_${
killedBy: getDataLayerId
statusReason: expected 'MISSION_DATASET_FIELD1FIELD2_INSTRUME…' to deeply equal 'MISSION_DATASET_FIELD1_FIELD2_INSTRUM…'

[Killed] ArrowFunction
src/utilities/generic.ts:111:28
     layer.instrument
   }_${
     layer.channels
-      ? layer.channels.map((c) => `${c.id}_${c.value}`).join("_")
+      ? layer.channels.map(() => undefined).join("_")
       : ""
   }${layer.version}_${layer.id}`;
killedBy: getDataLayerId includes channel id/value pairs when present
statusReason: expected 'M_D_f1_I__V_ID' to deeply equal 'M_D_f1_I_c1_v1_c2_v2V_ID'

[Killed] StringLiteral
src/utilities/generic.ts:111:35
     layer.instrument
   }_${
     layer.channels
-      ? layer.channels.map((c) => `${c.id}_${c.value}`).join("_")
+      ? layer.channels.map((c) => ``).join("_")
       : ""
   }${layer.version}_${layer.id}`;
killedBy: getDataLayerId includes channel id/value pairs when present
statusReason: expected 'M_D_f1_I__V_ID' to deeply equal 'M_D_f1_I_c1_v1_c2_v2V_ID'

[Killed] BlockStatement
src/utilities/generic.ts:119:54
 /**
  * Returns true if the error is an Abort Error
  */
-export function isAbortError(error: Error | unknown) {
-  return (error as Error).name === "AbortError";
-}
+export function isAbortError(error: Error | unknown) {}
 
 /**
killedBy: isAbortError
statusReason: expected undefined to be false // Object.is equality

[Killed] ConditionalExpression
src/utilities/generic.ts:120:10
  * Returns true if the error is an Abort Error
  */
 export function isAbortError(error: Error | unknown) {
-  return (error as Error).name === "AbortError";
+  return false;
 }
 
killedBy: isAbortError
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/utilities/generic.ts:120:10
  * Returns true if the error is an Abort Error
  */
 export function isAbortError(error: Error | unknown) {
-  return (error as Error).name === "AbortError";
+  return (error as Error).name !== "AbortError";
 }
 
killedBy: isAbortError
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/utilities/generic.ts:126:50
 /**
  * Returns s if count is 1
  */
-export function pluralize(count: number): string {
-  return count === 1 ? "" : "s";
-}
+export function pluralize(count: number): string {}
 
 /**
killedBy: pluralize
statusReason: expected undefined to be 's' // Object.is equality

[Killed] ConditionalExpression
src/utilities/generic.ts:127:10
  * Returns s if count is 1
  */
 export function pluralize(count: number): string {
-  return count === 1 ? "" : "s";
+  return false ? "" : "s";
 }
 
killedBy: pluralize
statusReason: expected 's' to be '' // Object.is equality

[Killed] EqualityOperator
src/utilities/generic.ts:127:10
  * Returns s if count is 1
  */
 export function pluralize(count: number): string {
-  return count === 1 ? "" : "s";
+  return count !== 1 ? "" : "s";
 }
 
killedBy: pluralize
statusReason: expected '' to be 's' // Object.is equality

[Killed] BlockStatement
src/utilities/generic.ts:134:72
  * Converts hex to rgba
  * @see https://gist.github.com/danieliser/b4b24c9f772066bcf0a6
  */
-export function convertHexToRGBA(hexCode: string, opacity: number = 1) {
-  try {
-    let hex = hexCode.replace("#", "");
-
-    if (hex.length === 3) {
-      hex = `${hex[0]}${hex[0]}${hex[1]}${hex[1]}${hex[2]}${hex[2]}`;
-    }
-
-    const r = parseInt(hex.substring(0, 2), 16);
-    const g = parseInt(hex.substring(2, 4), 16);
-    const b = parseInt(hex.substring(4, 6), 16);
-
-    /* Backward compatibility for whole number based opacity values. */
-    if (opacity > 1 && opacity <= 100) {
-      opacity = opacity / 100;
-    }
-
-    return `rgba(${r},${g},${b},${opacity})`;
-  } catch (err) {
-    return "#000000";
-  }
-}
+export function convertHexToRGBA(hexCode: string, opacity: number = 1) {}
 
 export function downloadJSON(obj: unknown, filename: string) {
killedBy: convertHexToRGBA converts 6-digit and 3-digit hex
statusReason: expected undefined to be 'rgba(255,0,0,1)' // Object.is equality

[Killed] BlockStatement
src/utilities/generic.ts:135:7
  * @see https://gist.github.com/danieliser/b4b24c9f772066bcf0a6
  */
 export function convertHexToRGBA(hexCode: string, opacity: number = 1) {
-  try {
-    let hex = hexCode.replace("#", "");
-
-    if (hex.length === 3) {
-      hex = `${hex[0]}${hex[0]}${hex[1]}${hex[1]}${hex[2]}${hex[2]}`;
-    }
-
-    const r = parseInt(hex.substring(0, 2), 16);
-    const g = parseInt(hex.substring(2, 4), 16);
-    const b = parseInt(hex.substring(4, 6), 16);
-
-    /* Backward compatibility for whole number based opacity values. */
-    if (opacity > 1 && opacity <= 100) {
-      opacity = opacity / 100;
-    }
-
-    return `rgba(${r},${g},${b},${opacity})`;
-  } catch (err) {
+  try {} catch (err) {
     return "#000000";
   }
killedBy: convertHexToRGBA converts 6-digit and 3-digit hex
statusReason: expected undefined to be 'rgba(255,0,0,1)' // Object.is equality

[Killed] StringLiteral
src/utilities/generic.ts:136:36
  */
 export function convertHexToRGBA(hexCode: string, opacity: number = 1) {
   try {
-    let hex = hexCode.replace("#", "");
+    let hex = hexCode.replace("#", "Stryker was here!");
 
     if (hex.length === 3) {
killedBy: convertHexToRGBA converts 6-digit and 3-digit hex
statusReason: expected 'rgba(NaN,NaN,NaN,1)' to be 'rgba(255,0,0,1)' // Object.is equality

[Killed] EqualityOperator
src/utilities/generic.ts:138:9
   try {
     let hex = hexCode.replace("#", "");
 
-    if (hex.length === 3) {
+    if (hex.length !== 3) {
       hex = `${hex[0]}${hex[0]}${hex[1]}${hex[1]}${hex[2]}${hex[2]}`;
     }
killedBy: convertHexToRGBA converts 6-digit and 3-digit hex
statusReason: expected 'rgba(255,255,0,1)' to be 'rgba(255,0,0,1)' // Object.is equality

[Killed] ConditionalExpression
src/utilities/generic.ts:138:9
   try {
     let hex = hexCode.replace("#", "");
 
-    if (hex.length === 3) {
+    if (true) {
       hex = `${hex[0]}${hex[0]}${hex[1]}${hex[1]}${hex[2]}${hex[2]}`;
     }
killedBy: convertHexToRGBA converts 6-digit and 3-digit hex
statusReason: expected 'rgba(255,255,0,1)' to be 'rgba(255,0,0,1)' // Object.is equality

[Killed] MethodExpression
src/utilities/generic.ts:142:24
       hex = `${hex[0]}${hex[0]}${hex[1]}${hex[1]}${hex[2]}${hex[2]}`;
     }
 
-    const r = parseInt(hex.substring(0, 2), 16);
+    const r = parseInt(hex, 16);
     const g = parseInt(hex.substring(2, 4), 16);
     const b = parseInt(hex.substring(4, 6), 16);
killedBy: convertHexToRGBA converts 6-digit and 3-digit hex
statusReason: expected 'rgba(16711680,0,0,1)' to be 'rgba(255,0,0,1)' // Object.is equality

[Killed] MethodExpression
src/utilities/generic.ts:143:24
     }
 
     const r = parseInt(hex.substring(0, 2), 16);
-    const g = parseInt(hex.substring(2, 4), 16);
+    const g = parseInt(hex, 16);
     const b = parseInt(hex.substring(4, 6), 16);
 
killedBy: convertHexToRGBA converts 6-digit and 3-digit hex
statusReason: expected 'rgba(255,16711680,0,1)' to be 'rgba(255,0,0,1)' // Object.is equality

[Killed] MethodExpression
src/utilities/generic.ts:144:24
 
     const r = parseInt(hex.substring(0, 2), 16);
     const g = parseInt(hex.substring(2, 4), 16);
-    const b = parseInt(hex.substring(4, 6), 16);
+    const b = parseInt(hex, 16);
 
     /* Backward compatibility for whole number based opacity values. */
killedBy: convertHexToRGBA converts 6-digit and 3-digit hex
statusReason: expected 'rgba(255,0,16711680,1)' to be 'rgba(255,0,0,1)' // Object.is equality

[Killed] BlockStatement
src/utilities/generic.ts:147:40
     const b = parseInt(hex.substring(4, 6), 16);
 
     /* Backward compatibility for whole number based opacity values. */
-    if (opacity > 1 && opacity <= 100) {
-      opacity = opacity / 100;
-    }
+    if (opacity > 1 && opacity <= 100) {}
 
     return `rgba(${r},${g},${b},${opacity})`;
killedBy: convertHexToRGBA applies opacity, converting whole-number percentages
statusReason: expected 'rgba(0,0,0,50)' to be 'rgba(0,0,0,0.5)' // Object.is equality

[Killed] ConditionalExpression
src/utilities/generic.ts:147:24
     const b = parseInt(hex.substring(4, 6), 16);
 
     /* Backward compatibility for whole number based opacity values. */
-    if (opacity > 1 && opacity <= 100) {
+    if (opacity > 1 && true) {
       opacity = opacity / 100;
     }
killedBy: convertHexToRGBA applies opacity, converting whole-number percentages
statusReason: expected 'rgba(0,0,0,1.5)' to be 'rgba(0,0,0,150)' // Object.is equality

[Killed] ArithmeticOperator
src/utilities/generic.ts:148:17
 
     /* Backward compatibility for whole number based opacity values. */
     if (opacity > 1 && opacity <= 100) {
-      opacity = opacity / 100;
+      opacity = opacity * 100;
     }
 
killedBy: convertHexToRGBA applies opacity, converting whole-number percentages
statusReason: expected 'rgba(0,0,0,5000)' to be 'rgba(0,0,0,0.5)' // Object.is equality

[Killed] BlockStatement
src/utilities/generic.ts:152:17
     }
 
     return `rgba(${r},${g},${b},${opacity})`;
-  } catch (err) {
-    return "#000000";
-  }
+  } catch (err) {}
 }
 
killedBy: convertHexToRGBA falls back to black on invalid input
statusReason: expected undefined to be '#000000' // Object.is equality

[Killed] BlockStatement
src/utilities/generic.ts:157:62
   }
 }
 
-export function downloadJSON(obj: unknown, filename: string) {
-  const blob = new Blob([JSON.stringify(obj, null, 2)], {
-    type: "application/json",
-  });
-  const url = URL.createObjectURL(blob);
-  const a = document.createElement("a");
-  a.href = url;
-  a.download = `${filename}.json`;
-  a.click();
-  URL.revokeObjectURL(url);
-}
+export function downloadJSON(obj: unknown, filename: string) {}
 
 export function isMacOs(): boolean {
killedBy: downloadJSON creates, clicks, and revokes an object-URL anchor
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] ObjectLiteral
src/utilities/generic.ts:158:57
 }
 
 export function downloadJSON(obj: unknown, filename: string) {
-  const blob = new Blob([JSON.stringify(obj, null, 2)], {
-    type: "application/json",
-  });
+  const blob = new Blob([JSON.stringify(obj, null, 2)], {});
   const url = URL.createObjectURL(blob);
   const a = document.createElement("a");
killedBy: downloadJSON creates, clicks, and revokes an object-URL anchor
statusReason: expected '' to be 'application/json' // Object.is equality

[Killed] StringLiteral
src/utilities/generic.ts:164:16
   const url = URL.createObjectURL(blob);
   const a = document.createElement("a");
   a.href = url;
-  a.download = `${filename}.json`;
+  a.download = ``;
   a.click();
   URL.revokeObjectURL(url);
killedBy: downloadJSON creates, clicks, and revokes an object-URL anchor
statusReason: expected '' to be 'report.json' // Object.is equality

[Killed] BlockStatement
src/utilities/generic.ts:169:36
   URL.revokeObjectURL(url);
 }
 
-export function isMacOs(): boolean {
-  return /mac/i.test(window.navigator.platform);
-}
+export function isMacOs(): boolean {}
 
killedBy: isMacOs reflects the navigator platform
statusReason: expected undefined to be true // Object.is equality
