[Killed] BlockStatement
src/utilities/product.ts:8:24
 export function getProductForLayer(
   layer: DataLayer,
   products: Product[]
-): Product | undefined {
-  return products.find(
-    (d) => layer.mission === d.mission.id && layer.dataset === d.id
-  );
-}
+): Product | undefined {}
 
 /**
killedBy: getProductForLayer matches on BOTH mission and dataset
statusReason: expected undefined to be { available_fields: [ …(2) ], …(11) } // Object.is equality

[Killed] EqualityOperator
src/utilities/product.ts:10:46
   products: Product[]
 ): Product | undefined {
   return products.find(
-    (d) => layer.mission === d.mission.id && layer.dataset === d.id
+    (d) => layer.mission === d.mission.id && layer.dataset !== d.id
   );
 }
killedBy: getProductForLayer matches on BOTH mission and dataset
statusReason: expected { available_fields: [ …(2) ], …(11) } to be undefined

[Killed] LogicalOperator
src/utilities/product.ts:10:12
   products: Product[]
 ): Product | undefined {
   return products.find(
-    (d) => layer.mission === d.mission.id && layer.dataset === d.id
+    (d) => layer.mission === d.mission.id || layer.dataset === d.id
   );
 }
killedBy: getProductForLayer matches on BOTH mission and dataset
statusReason: expected { available_fields: [ …(2) ], …(11) } to be undefined

[Killed] BlockStatement
src/utilities/product.ts:22:24
   layer: DataLayer,
   products: Product[],
   instrument?: string | null,
-): Dataset | undefined {
-  const product = getProductForLayer(layer, products);
-  if (!product) return undefined;
-  const layerInstrument = instrument ?? layer.instrument;
-  return product.datasets.find(
-    (ds) => ds.version_id === layer.version && ds.instrument_id === layerInstrument,
-  );
-}
+): Dataset | undefined {}
 
 export function getFieldMetadataForLayer(
killedBy: getDatasetForLayer matches on version and instrument
statusReason: expected undefined to be { …(7) } // Object.is equality

[Killed] BooleanLiteral
src/utilities/product.ts:24:7
   instrument?: string | null,
 ): Dataset | undefined {
   const product = getProductForLayer(layer, products);
-  if (!product) return undefined;
+  if (product) return undefined;
   const layerInstrument = instrument ?? layer.instrument;
   return product.datasets.find(
killedBy: getDatasetForLayer matches on version and instrument
statusReason: expected undefined to be { …(7) } // Object.is equality

[Killed] ConditionalExpression
src/utilities/product.ts:24:7
   instrument?: string | null,
 ): Dataset | undefined {
   const product = getProductForLayer(layer, products);
-  if (!product) return undefined;
+  if (false) return undefined;
   const layerInstrument = instrument ?? layer.instrument;
   return product.datasets.find(
killedBy: getDatasetForLayer matches on version and instrument
statusReason: Cannot read properties of undefined (reading 'datasets')

[Killed] LogicalOperator
src/utilities/product.ts:25:27
 ): Dataset | undefined {
   const product = getProductForLayer(layer, products);
   if (!product) return undefined;
-  const layerInstrument = instrument ?? layer.instrument;
+  const layerInstrument = instrument && layer.instrument;
   return product.datasets.find(
     (ds) => ds.version_id === layer.version && ds.instrument_id === layerInstrument,
killedBy: getDatasetForLayer matches on version and instrument
statusReason: expected undefined to be { …(7) } // Object.is equality

[Killed] ConditionalExpression
src/utilities/product.ts:27:13
   if (!product) return undefined;
   const layerInstrument = instrument ?? layer.instrument;
   return product.datasets.find(
-    (ds) => ds.version_id === layer.version && ds.instrument_id === layerInstrument,
+    (ds) => false,
   );
 }
killedBy: getDatasetForLayer matches on version and instrument
statusReason: expected undefined to be { …(7) } // Object.is equality

[Killed] ConditionalExpression
src/utilities/product.ts:27:48
   if (!product) return undefined;
   const layerInstrument = instrument ?? layer.instrument;
   return product.datasets.find(
-    (ds) => ds.version_id === layer.version && ds.instrument_id === layerInstrument,
+    (ds) => ds.version_id === layer.version && true,
   );
 }
killedBy: getDatasetForLayer matches on version and instrument
statusReason: expected { …(7) } to be { …(7) } // Object.is equality

[Killed] BlockStatement
src/utilities/product.ts:35:29
   field: string,
   layer: DataLayer,
   products: Product[]
-): ProductField | undefined {
-  const product = getProductForLayer(layer, products);
-  if (product) {
-    return product.available_fields.find((f) => f.name === field);
-  }
-}
+): ProductField | undefined {}
 
 // TODO only supports value, does not yet support min/max/etc
killedBy: getFieldMetadataForLayer returns the requested field, not merely the first
statusReason: expected undefined to be 'second' // Object.is equality

[Killed] BlockStatement
src/utilities/product.ts:37:16
   products: Product[]
 ): ProductField | undefined {
   const product = getProductForLayer(layer, products);
-  if (product) {
-    return product.available_fields.find((f) => f.name === field);
-  }
+  if (product) {}
 }
 
killedBy: getFieldMetadataForLayer returns the requested field, not merely the first
statusReason: expected undefined to be 'second' // Object.is equality

[Killed] ConditionalExpression
src/utilities/product.ts:37:7
   products: Product[]
 ): ProductField | undefined {
   const product = getProductForLayer(layer, products);
-  if (product) {
+  if (true) {
     return product.available_fields.find((f) => f.name === field);
   }
killedBy: getFieldMetadataForLayer returns the requested field, not merely the first
statusReason: Cannot read properties of undefined (reading 'available_fields')

[Killed] ArrowFunction
src/utilities/product.ts:38:42
 ): ProductField | undefined {
   const product = getProductForLayer(layer, products);
   if (product) {
-    return product.available_fields.find((f) => f.name === field);
+    return product.available_fields.find(() => undefined);
   }
 }
killedBy: getFieldMetadataForLayer returns the requested field, not merely the first
statusReason: expected undefined to be 'second' // Object.is equality

[Killed] ConditionalExpression
src/utilities/product.ts:38:49
 ): ProductField | undefined {
   const product = getProductForLayer(layer, products);
   if (product) {
-    return product.available_fields.find((f) => f.name === field);
+    return product.available_fields.find((f) => true);
   }
 }
killedBy: getFieldMetadataForLayer returns the requested field, not merely the first
statusReason: expected 'first' to be 'second' // Object.is equality

[Killed] ObjectLiteral
src/utilities/product.ts:48:13
   data: DataResponseDataEntry
 ): ComputedThresholds {
   const result: ComputedThresholds = {
-    limits: {
-      lower: false,
-      lower_value: null,
-      upper: false,
-      upper_value: null,
-    },
+    limits: {},
     warnings: {
       lower: false,
killedBy: applyFieldThresholds returns an all-clear result when the field has no thresholds
statusReason: expected { limits: {}, warnings: { …(4) } } to deeply equal { Object (limits, warnings) }

[Killed] BooleanLiteral
src/utilities/product.ts:49:14
 ): ComputedThresholds {
   const result: ComputedThresholds = {
     limits: {
-      lower: false,
+      lower: true,
       lower_value: null,
       upper: false,
killedBy: applyFieldThresholds returns an all-clear result when the field has no thresholds
statusReason: expected { limits: { lower: true, …(3) }, …(1) } to deeply equal { Object (limits, warnings) }

[Killed] BooleanLiteral
src/utilities/product.ts:51:14
     limits: {
       lower: false,
       lower_value: null,
-      upper: false,
+      upper: true,
       upper_value: null,
     },
killedBy: applyFieldThresholds returns an all-clear result when the field has no thresholds
statusReason: expected { Object (limits, warnings) } to deeply equal { Object (limits, warnings) }

[Killed] BooleanLiteral
src/utilities/product.ts:55:14
       upper_value: null,
     },
     warnings: {
-      lower: false,
+      lower: true,
       lower_value: null,
       upper: false,
killedBy: applyFieldThresholds returns an all-clear result when the field has no thresholds
statusReason: expected { Object (limits, warnings) } to deeply equal { Object (limits, warnings) }

[Killed] BlockStatement
src/utilities/product.ts:63:29
   };
 
   // Bail if field has no threshold configurations
-  if (!field.qc_thresholds) {
-    return result;
-  }
+  if (!field.qc_thresholds) {}
 
   // Find matching threshold entry
killedBy: applyFieldThresholds returns an all-clear result when the field has no thresholds
statusReason: Cannot read properties of undefined (reading 'find')

[Killed] ConditionalExpression
src/utilities/product.ts:63:7
   };
 
   // Bail if field has no threshold configurations
-  if (!field.qc_thresholds) {
+  if (true) {
     return result;
   }
killedBy: applyFieldThresholds flags lower/upper limit and warning violations
statusReason: expected { Object (limits, warnings) } to deeply equal { limits: { lower: true, …(3) }, …(1) }

[Killed] BlockStatement
src/utilities/product.ts:68:75
   }
 
   // Find matching threshold entry
-  const matchingThresholdConfig = field.qc_thresholds.find((threshold) => {
-    if (!threshold.effective_since && !threshold.effective_until) {
-      return true;
-    }
-    let inRange = false;
-    if (threshold.effective_since) {
-      inRange = threshold.effective_since <= data.timestamp;
-    }
-    if (threshold.effective_until) {
-      inRange = threshold.effective_until >= data.timestamp;
-    }
-    return inRange;
-  });
+  const matchingThresholdConfig = field.qc_thresholds.find((threshold) => {});
 
   if (!matchingThresholdConfig) {
killedBy: applyFieldThresholds flags lower/upper limit and warning violations
statusReason: expected { Object (limits, warnings) } to deeply equal { limits: { lower: true, …(3) }, …(1) }

[Killed] BooleanLiteral
src/utilities/product.ts:69:9
 
   // Find matching threshold entry
   const matchingThresholdConfig = field.qc_thresholds.find((threshold) => {
-    if (!threshold.effective_since && !threshold.effective_until) {
+    if (threshold.effective_since && !threshold.effective_until) {
       return true;
     }
killedBy: applyFieldThresholds flags lower/upper limit and warning violations
statusReason: expected { Object (limits, warnings) } to deeply equal { limits: { lower: true, …(3) }, …(1) }

[Killed] ConditionalExpression
src/utilities/product.ts:69:9
 
   // Find matching threshold entry
   const matchingThresholdConfig = field.qc_thresholds.find((threshold) => {
-    if (!threshold.effective_since && !threshold.effective_until) {
+    if (false) {
       return true;
     }
killedBy: applyFieldThresholds flags lower/upper limit and warning violations
statusReason: expected { Object (limits, warnings) } to deeply equal { limits: { lower: true, …(3) }, …(1) }

[Killed] BooleanLiteral
src/utilities/product.ts:70:14
   // Find matching threshold entry
   const matchingThresholdConfig = field.qc_thresholds.find((threshold) => {
     if (!threshold.effective_since && !threshold.effective_until) {
-      return true;
+      return false;
     }
     let inRange = false;
killedBy: applyFieldThresholds flags lower/upper limit and warning violations
statusReason: expected { Object (limits, warnings) } to deeply equal { limits: { lower: true, …(3) }, …(1) }

[Survived] BooleanLiteral
src/utilities/product.ts:72:19
     if (!threshold.effective_since && !threshold.effective_until) {
       return true;
     }
-    let inRange = false;
+    let inRange = true;
     if (threshold.effective_since) {
       inRange = threshold.effective_since <= data.timestamp;

[Killed] BlockStatement
src/utilities/product.ts:73:36
       return true;
     }
     let inRange = false;
-    if (threshold.effective_since) {
-      inRange = threshold.effective_since <= data.timestamp;
-    }
+    if (threshold.effective_since) {}
     if (threshold.effective_until) {
       inRange = threshold.effective_until >= data.timestamp;
killedBy: applyFieldThresholds honors effective_since / effective_until windows
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/utilities/product.ts:73:9
       return true;
     }
     let inRange = false;
-    if (threshold.effective_since) {
+    if (false) {
       inRange = threshold.effective_since <= data.timestamp;
     }
killedBy: applyFieldThresholds honors effective_since / effective_until windows
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/utilities/product.ts:74:17
     }
     let inRange = false;
     if (threshold.effective_since) {
-      inRange = threshold.effective_since <= data.timestamp;
+      inRange = threshold.effective_since < data.timestamp;
     }
     if (threshold.effective_until) {
killedBy: applyFieldThresholds honors effective_since / effective_until windows
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/utilities/product.ts:74:17
     }
     let inRange = false;
     if (threshold.effective_since) {
-      inRange = threshold.effective_since <= data.timestamp;
+      inRange = false;
     }
     if (threshold.effective_until) {
killedBy: applyFieldThresholds honors effective_since / effective_until windows
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/utilities/product.ts:76:9
     if (threshold.effective_since) {
       inRange = threshold.effective_since <= data.timestamp;
     }
-    if (threshold.effective_until) {
+    if (true) {
       inRange = threshold.effective_until >= data.timestamp;
     }
killedBy: applyFieldThresholds honors effective_since / effective_until windows
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/utilities/product.ts:76:36
     if (threshold.effective_since) {
       inRange = threshold.effective_since <= data.timestamp;
     }
-    if (threshold.effective_until) {
-      inRange = threshold.effective_until >= data.timestamp;
-    }
+    if (threshold.effective_until) {}
     return inRange;
   });
killedBy: applyFieldThresholds honors effective_since / effective_until windows
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/utilities/product.ts:77:17
       inRange = threshold.effective_since <= data.timestamp;
     }
     if (threshold.effective_until) {
-      inRange = threshold.effective_until >= data.timestamp;
+      inRange = false;
     }
     return inRange;
killedBy: applyFieldThresholds honors effective_since / effective_until windows
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/utilities/product.ts:77:17
       inRange = threshold.effective_since <= data.timestamp;
     }
     if (threshold.effective_until) {
-      inRange = threshold.effective_until >= data.timestamp;
+      inRange = threshold.effective_until < data.timestamp;
     }
     return inRange;
killedBy: applyFieldThresholds honors effective_since / effective_until windows
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/utilities/product.ts:82:7
     return inRange;
   });
 
-  if (!matchingThresholdConfig) {
+  if (false) {
     return result;
   }
killedBy: applyFieldThresholds honors effective_since / effective_until windows
statusReason: Cannot read properties of undefined (reading 'limits')

[Killed] BlockStatement
src/utilities/product.ts:82:33
     return inRange;
   });
 
-  if (!matchingThresholdConfig) {
-    return result;
-  }
+  if (!matchingThresholdConfig) {}
 
   // Compute violations
killedBy: applyFieldThresholds honors effective_since / effective_until windows
statusReason: Cannot read properties of undefined (reading 'limits')

[Killed] EqualityOperator
src/utilities/product.ts:90:9
   const value = data[field.name].value as number;
   result.limits = {
     lower: matchingThresholdConfig.limits
-      ? value <
-        (matchingThresholdConfig.limits.lower ?? Number.NEGATIVE_INFINITY)
+      ? value >= (matchingThresholdConfig.limits.lower ?? Number.NEGATIVE_INFINITY)
       : false,
     upper: matchingThresholdConfig.limits
killedBy: applyFieldThresholds flags lower/upper limit and warning violations
statusReason: expected { Object (limits, warnings) } to deeply equal { limits: { lower: true, …(3) }, …(1) }

[Killed] ConditionalExpression
src/utilities/product.ts:90:9
   const value = data[field.name].value as number;
   result.limits = {
     lower: matchingThresholdConfig.limits
-      ? value <
-        (matchingThresholdConfig.limits.lower ?? Number.NEGATIVE_INFINITY)
+      ? false
       : false,
     upper: matchingThresholdConfig.limits
killedBy: applyFieldThresholds flags lower/upper limit and warning violations
statusReason: expected { Object (limits, warnings) } to deeply equal { limits: { lower: true, …(3) }, …(1) }

[Killed] LogicalOperator
src/utilities/product.ts:91:10
   result.limits = {
     lower: matchingThresholdConfig.limits
       ? value <
-        (matchingThresholdConfig.limits.lower ?? Number.NEGATIVE_INFINITY)
+        (matchingThresholdConfig.limits.lower && Number.NEGATIVE_INFINITY)
       : false,
     upper: matchingThresholdConfig.limits
killedBy: applyFieldThresholds flags lower/upper limit and warning violations
statusReason: expected { Object (limits, warnings) } to deeply equal { limits: { lower: true, …(3) }, …(1) }

[Killed] BooleanLiteral
src/utilities/product.ts:92:9
     lower: matchingThresholdConfig.limits
       ? value <
         (matchingThresholdConfig.limits.lower ?? Number.NEGATIVE_INFINITY)
-      : false,
+      : true,
     upper: matchingThresholdConfig.limits
       ? value >
killedBy: applyFieldThresholds treats a missing limits block as no-op
statusReason: expected { limits: { lower: true, …(3) }, …(1) } to deeply equal { Object (limits, warnings) }

[Killed] ConditionalExpression
src/utilities/product.ts:94:9
         (matchingThresholdConfig.limits.lower ?? Number.NEGATIVE_INFINITY)
       : false,
     upper: matchingThresholdConfig.limits
-      ? value >
-        (matchingThresholdConfig.limits.upper ?? Number.POSITIVE_INFINITY)
+      ? false
       : false,
     lower_value: matchingThresholdConfig.limits
killedBy: applyFieldThresholds flags lower/upper limit and warning violations
statusReason: expected { Object (limits, warnings) } to deeply equal { Object (limits, warnings) }

[Killed] EqualityOperator
src/utilities/product.ts:94:9
         (matchingThresholdConfig.limits.lower ?? Number.NEGATIVE_INFINITY)
       : false,
     upper: matchingThresholdConfig.limits
-      ? value >
-        (matchingThresholdConfig.limits.upper ?? Number.POSITIVE_INFINITY)
+      ? value >= (matchingThresholdConfig.limits.upper ?? Number.POSITIVE_INFINITY)
       : false,
     lower_value: matchingThresholdConfig.limits
killedBy: applyFieldThresholds boundary values are inclusive-safe (violation is strict)
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
src/utilities/product.ts:95:10
       : false,
     upper: matchingThresholdConfig.limits
       ? value >
-        (matchingThresholdConfig.limits.upper ?? Number.POSITIVE_INFINITY)
+        (matchingThresholdConfig.limits.upper && Number.POSITIVE_INFINITY)
       : false,
     lower_value: matchingThresholdConfig.limits
killedBy: applyFieldThresholds flags lower/upper limit and warning violations
statusReason: expected { Object (limits, warnings) } to deeply equal { Object (limits, warnings) }

[Killed] BooleanLiteral
src/utilities/product.ts:96:9
     upper: matchingThresholdConfig.limits
       ? value >
         (matchingThresholdConfig.limits.upper ?? Number.POSITIVE_INFINITY)
-      : false,
+      : true,
     lower_value: matchingThresholdConfig.limits
       ? matchingThresholdConfig.limits.lower ?? null
killedBy: applyFieldThresholds treats a missing limits block as no-op
statusReason: expected { Object (limits, warnings) } to deeply equal { Object (limits, warnings) }

[Killed] LogicalOperator
src/utilities/product.ts:98:9
         (matchingThresholdConfig.limits.upper ?? Number.POSITIVE_INFINITY)
       : false,
     lower_value: matchingThresholdConfig.limits
-      ? matchingThresholdConfig.limits.lower ?? null
+      ? matchingThresholdConfig.limits.lower && null
       : null,
     upper_value: matchingThresholdConfig.limits
killedBy: applyFieldThresholds flags lower/upper limit and warning violations
statusReason: expected { limits: { lower: true, …(3) }, …(1) } to deeply equal { limits: { lower: true, …(3) }, …(1) }

[Killed] LogicalOperator
src/utilities/product.ts:101:9
       ? matchingThresholdConfig.limits.lower ?? null
       : null,
     upper_value: matchingThresholdConfig.limits
-      ? matchingThresholdConfig.limits.upper ?? null
+      ? matchingThresholdConfig.limits.upper && null
       : null,
   };
killedBy: applyFieldThresholds flags lower/upper limit and warning violations
statusReason: expected { limits: { lower: true, …(3) }, …(1) } to deeply equal { limits: { lower: true, …(3) }, …(1) }

[Killed] EqualityOperator
src/utilities/product.ts:107:9
 
   result.warnings = {
     lower: matchingThresholdConfig.warnings
-      ? value <
-        (matchingThresholdConfig.warnings.lower ?? Number.NEGATIVE_INFINITY)
+      ? value >= (matchingThresholdConfig.warnings.lower ?? Number.NEGATIVE_INFINITY)
       : false,
     upper: matchingThresholdConfig.warnings
killedBy: applyFieldThresholds flags lower/upper limit and warning violations
statusReason: expected { limits: { lower: true, …(3) }, …(1) } to deeply equal { limits: { lower: true, …(3) }, …(1) }

[Killed] ConditionalExpression
src/utilities/product.ts:107:9
 
   result.warnings = {
     lower: matchingThresholdConfig.warnings
-      ? value <
-        (matchingThresholdConfig.warnings.lower ?? Number.NEGATIVE_INFINITY)
+      ? true
       : false,
     upper: matchingThresholdConfig.warnings
killedBy: applyFieldThresholds flags lower/upper limit and warning violations
statusReason: expected { Object (limits, warnings) } to deeply equal { Object (limits, warnings) }

[Killed] LogicalOperator
src/utilities/product.ts:108:10
   result.warnings = {
     lower: matchingThresholdConfig.warnings
       ? value <
-        (matchingThresholdConfig.warnings.lower ?? Number.NEGATIVE_INFINITY)
+        (matchingThresholdConfig.warnings.lower && Number.NEGATIVE_INFINITY)
       : false,
     upper: matchingThresholdConfig.warnings
killedBy: applyFieldThresholds flags lower/upper limit and warning violations
statusReason: expected { limits: { lower: true, …(3) }, …(1) } to deeply equal { limits: { lower: true, …(3) }, …(1) }

[Killed] BooleanLiteral
src/utilities/product.ts:109:9
     lower: matchingThresholdConfig.warnings
       ? value <
         (matchingThresholdConfig.warnings.lower ?? Number.NEGATIVE_INFINITY)
-      : false,
+      : true,
     upper: matchingThresholdConfig.warnings
       ? value >
killedBy: applyFieldThresholds treats a missing warnings block as no-op
statusReason: expected { limits: { lower: true, …(3) }, …(1) } to deeply equal { limits: { lower: true, …(3) }, …(1) }

[Killed] ConditionalExpression
src/utilities/product.ts:111:9
         (matchingThresholdConfig.warnings.lower ?? Number.NEGATIVE_INFINITY)
       : false,
     upper: matchingThresholdConfig.warnings
-      ? value >
-        (matchingThresholdConfig.warnings.upper ?? Number.POSITIVE_INFINITY)
+      ? false
       : false,
     lower_value: matchingThresholdConfig.warnings
killedBy: applyFieldThresholds flags lower/upper limit and warning violations
statusReason: expected { Object (limits, warnings) } to deeply equal { Object (limits, warnings) }

[Killed] EqualityOperator
src/utilities/product.ts:111:9
         (matchingThresholdConfig.warnings.lower ?? Number.NEGATIVE_INFINITY)
       : false,
     upper: matchingThresholdConfig.warnings
-      ? value >
-        (matchingThresholdConfig.warnings.upper ?? Number.POSITIVE_INFINITY)
+      ? value >= (matchingThresholdConfig.warnings.upper ?? Number.POSITIVE_INFINITY)
       : false,
     lower_value: matchingThresholdConfig.warnings
killedBy: applyFieldThresholds boundary values are inclusive-safe (violation is strict)
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
src/utilities/product.ts:112:10
       : false,
     upper: matchingThresholdConfig.warnings
       ? value >
-        (matchingThresholdConfig.warnings.upper ?? Number.POSITIVE_INFINITY)
+        (matchingThresholdConfig.warnings.upper && Number.POSITIVE_INFINITY)
       : false,
     lower_value: matchingThresholdConfig.warnings
killedBy: applyFieldThresholds flags lower/upper limit and warning violations
statusReason: expected { Object (limits, warnings) } to deeply equal { Object (limits, warnings) }

[Killed] BooleanLiteral
src/utilities/product.ts:113:9
     upper: matchingThresholdConfig.warnings
       ? value >
         (matchingThresholdConfig.warnings.upper ?? Number.POSITIVE_INFINITY)
-      : false,
+      : true,
     lower_value: matchingThresholdConfig.warnings
       ? matchingThresholdConfig.warnings.lower ?? null
killedBy: applyFieldThresholds treats a missing warnings block as no-op
statusReason: expected { limits: { lower: true, …(3) }, …(1) } to deeply equal { limits: { lower: true, …(3) }, …(1) }

[Killed] LogicalOperator
src/utilities/product.ts:115:9
         (matchingThresholdConfig.warnings.upper ?? Number.POSITIVE_INFINITY)
       : false,
     lower_value: matchingThresholdConfig.warnings
-      ? matchingThresholdConfig.warnings.lower ?? null
+      ? matchingThresholdConfig.warnings.lower && null
       : null,
     upper_value: matchingThresholdConfig.warnings
killedBy: applyFieldThresholds flags lower/upper limit and warning violations
statusReason: expected { limits: { lower: true, …(3) }, …(1) } to deeply equal { limits: { lower: true, …(3) }, …(1) }

[Killed] LogicalOperator
src/utilities/product.ts:118:9
       ? matchingThresholdConfig.warnings.lower ?? null
       : null,
     upper_value: matchingThresholdConfig.warnings
-      ? matchingThresholdConfig.warnings.upper ?? null
+      ? matchingThresholdConfig.warnings.upper && null
       : null,
   };
killedBy: applyFieldThresholds flags lower/upper limit and warning violations
statusReason: expected { limits: { lower: true, …(3) }, …(1) } to deeply equal { limits: { lower: true, …(3) }, …(1) }
