[Killed] BlockStatement
src/utilities/time.ts:10:52
  * @param {string} isoStr ISO string
  * @return {string} datetime-local string
  */
-export function toDatetimelocalStr(isoStr: string) {
-  return isoStr.substring(0, 16);
-}
+export function toDatetimelocalStr(isoStr: string) {}
 
 /**
killedBy: toDatetimelocalStr truncates an ISO string to minute precision
statusReason: expected undefined to be '2022-03-02T00:36' // Object.is equality

[Killed] MethodExpression
src/utilities/time.ts:11:10
  * @return {string} datetime-local string
  */
 export function toDatetimelocalStr(isoStr: string) {
-  return isoStr.substring(0, 16);
+  return isoStr;
 }
 
killedBy: toDatetimelocalStr truncates an ISO string to minute precision
statusReason: expected '2022-03-02T00:36:00.000Z' to be '2022-03-02T00:36' // Object.is equality

[Killed] BlockStatement
src/utilities/time.ts:21:40
  * @param {string} datetimeStr datetime-local string
  * @return {number} UTC time in milliseconds
  */
-export function toUTCms(value: string) {
-  return Date.parse(value + "Z");
-}
+export function toUTCms(value: string) {}
 
 /**
killedBy: toUTCms parses a datetime-local string as UTC
statusReason: expected undefined to be 1646180940000 // Object.is equality

[Killed] BlockStatement
src/utilities/time.ts:28:35
 /**
  * Converts j2 (time since year 2000) to UTC ms
  */
-export function j2ToMs(x: number) {
-  return x * 1000 + 946728000000;
-}
+export function j2ToMs(x: number) {}
 
 /**
killedBy: j2ToMs converts seconds-since-2000-epoch to UTC milliseconds
statusReason: expected undefined to be 946728000000 // Object.is equality

[Killed] ArithmeticOperator
src/utilities/time.ts:29:10
  * Converts j2 (time since year 2000) to UTC ms
  */
 export function j2ToMs(x: number) {
-  return x * 1000 + 946728000000;
+  return x / 1000 + 946728000000;
 }
 
killedBy: j2ToMs converts seconds-since-2000-epoch to UTC milliseconds
statusReason: expected 946728000000.001 to be 946728001000 // Object.is equality

[Killed] ArithmeticOperator
src/utilities/time.ts:29:10
  * Converts j2 (time since year 2000) to UTC ms
  */
 export function j2ToMs(x: number) {
-  return x * 1000 + 946728000000;
+  return x * 1000 - 946728000000;
 }
 
killedBy: j2ToMs converts seconds-since-2000-epoch to UTC milliseconds
statusReason: expected -946728000000 to be 946728000000 // Object.is equality

[Killed] BlockStatement
src/utilities/time.ts:37:43
  * @param {Date} date
  * @returns {string} format YYYY-MM-DDTHH:MM:SS
  */
-export function formatDateGPS(date: Date) {
-  return formatDateISO(date).substring(0, 19);
-}
+export function formatDateGPS(date: Date) {}
 
killedBy: formatDateGPS returns YYYY-MM-DDTHH:MM:SS (seconds precision, no zone)
statusReason: expected undefined to be '2022-03-02T00:36:45' // Object.is equality

[Killed] MethodExpression
src/utilities/time.ts:38:10
  * @returns {string} format YYYY-MM-DDTHH:MM:SS
  */
 export function formatDateGPS(date: Date) {
-  return formatDateISO(date).substring(0, 19);
+  return formatDateISO(date);
 }
 
killedBy: formatDateGPS returns YYYY-MM-DDTHH:MM:SS (seconds precision, no zone)
statusReason: expected '2022-03-02T00:36:45Z' to be '2022-03-02T00:36:45' // Object.is equality
