[Killed] BlockStatement
src/utilities/view.ts:29:70
 
 const VIEW_VERSION: number = 1;
 
-export function isChartEntity(entity: Entity): entity is ChartEntity {
-  return entity.type === "chart";
-}
+export function isChartEntity(entity: Entity): entity is ChartEntity {}
 
 export function isMapEntity(entity: Entity): entity is MapEntity {
killedBy: entity type guards discriminate on the type field
statusReason: expected undefined to be true // Object.is equality

[Killed] EqualityOperator
src/utilities/view.ts:30:10
 const VIEW_VERSION: number = 1;
 
 export function isChartEntity(entity: Entity): entity is ChartEntity {
-  return entity.type === "chart";
+  return entity.type !== "chart";
 }
 
killedBy: entity type guards discriminate on the type field
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/utilities/view.ts:30:10
 const VIEW_VERSION: number = 1;
 
 export function isChartEntity(entity: Entity): entity is ChartEntity {
-  return entity.type === "chart";
+  return false;
 }
 
killedBy: entity type guards discriminate on the type field
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/utilities/view.ts:33:66
   return entity.type === "chart";
 }
 
-export function isMapEntity(entity: Entity): entity is MapEntity {
-  return entity.type === "map";
-}
+export function isMapEntity(entity: Entity): entity is MapEntity {}
 
 export function isTableEntity(entity: Entity): entity is TableEntity {
killedBy: entity type guards discriminate on the type field
statusReason: expected undefined to be true // Object.is equality

[Killed] EqualityOperator
src/utilities/view.ts:34:10
 }
 
 export function isMapEntity(entity: Entity): entity is MapEntity {
-  return entity.type === "map";
+  return entity.type !== "map";
 }
 
killedBy: entity type guards discriminate on the type field
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/utilities/view.ts:34:10
 }
 
 export function isMapEntity(entity: Entity): entity is MapEntity {
-  return entity.type === "map";
+  return false;
 }
 
killedBy: entity type guards discriminate on the type field
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/utilities/view.ts:37:70
   return entity.type === "map";
 }
 
-export function isTableEntity(entity: Entity): entity is TableEntity {
-  return entity.type === "table";
-}
+export function isTableEntity(entity: Entity): entity is TableEntity {}
 
 export function isDownlinkDashboardEntity(
killedBy: entity type guards discriminate on the type field
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
src/utilities/view.ts:38:10
 }
 
 export function isTableEntity(entity: Entity): entity is TableEntity {
-  return entity.type === "table";
+  return false;
 }
 
killedBy: entity type guards discriminate on the type field
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/utilities/view.ts:38:10
 }
 
 export function isTableEntity(entity: Entity): entity is TableEntity {
-  return entity.type === "table";
+  return true;
 }
 
killedBy: entity type guards discriminate on the type field
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/utilities/view.ts:43:38
 
 export function isDownlinkDashboardEntity(
   entity: Entity,
-): entity is DownlinkDashboardEntity {
-  return entity.type === "downlink-dashboard";
-}
+): entity is DownlinkDashboardEntity {}
 
 export function isTimelineRowEntity(
killedBy: entity type guards discriminate on the type field
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
src/utilities/view.ts:44:10
 export function isDownlinkDashboardEntity(
   entity: Entity,
 ): entity is DownlinkDashboardEntity {
-  return entity.type === "downlink-dashboard";
+  return false;
 }
 
killedBy: entity type guards discriminate on the type field
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/utilities/view.ts:44:10
 export function isDownlinkDashboardEntity(
   entity: Entity,
 ): entity is DownlinkDashboardEntity {
-  return entity.type === "downlink-dashboard";
+  return entity.type !== "downlink-dashboard";
 }
 
killedBy: entity type guards discriminate on the type field
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/utilities/view.ts:49:32
 
 export function isTimelineRowEntity(
   entity: Entity,
-): entity is TimelineRowEntity {
-  return entity.type === "timeline-row";
-}
+): entity is TimelineRowEntity {}
 
 export function isChartLayerLine(layer: ChartLayer): layer is ChartLayerLine {
killedBy: entity type guards discriminate on the type field
statusReason: expected undefined to be true // Object.is equality

[Killed] EqualityOperator
src/utilities/view.ts:50:10
 export function isTimelineRowEntity(
   entity: Entity,
 ): entity is TimelineRowEntity {
-  return entity.type === "timeline-row";
+  return entity.type !== "timeline-row";
 }
 
killedBy: entity type guards discriminate on the type field
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/utilities/view.ts:50:10
 export function isTimelineRowEntity(
   entity: Entity,
 ): entity is TimelineRowEntity {
-  return entity.type === "timeline-row";
+  return false;
 }
 
killedBy: entity type guards discriminate on the type field
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/utilities/view.ts:53:78
   return entity.type === "timeline-row";
 }
 
-export function isChartLayerLine(layer: ChartLayer): layer is ChartLayerLine {
-  return layer.type === "line";
-}
+export function isChartLayerLine(layer: ChartLayer): layer is ChartLayerLine {}
 
 export function isChartLayerEvent(layer: ChartLayer): layer is ChartLayerEvent {
killedBy: chart layer type guards discriminate on the type field
statusReason: expected undefined to be true // Object.is equality

[Killed] EqualityOperator
src/utilities/view.ts:54:10
 }
 
 export function isChartLayerLine(layer: ChartLayer): layer is ChartLayerLine {
-  return layer.type === "line";
+  return layer.type !== "line";
 }
 
killedBy: resolveFetchFields appends subset_version and skips downsampling for subset-version line layers
statusReason: expected { fieldsToFetch: [ 'a' ], …(1) } to deeply equal { fieldsToFetch: [ 'a', …(1) ], …(1) }

[Killed] ConditionalExpression
src/utilities/view.ts:54:10
 }
 
 export function isChartLayerLine(layer: ChartLayer): layer is ChartLayerLine {
-  return layer.type === "line";
+  return false;
 }
 
killedBy: chart layer type guards discriminate on the type field
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/utilities/view.ts:57:80
   return layer.type === "line";
 }
 
-export function isChartLayerEvent(layer: ChartLayer): layer is ChartLayerEvent {
-  return layer.type === "event";
-}
+export function isChartLayerEvent(layer: ChartLayer): layer is ChartLayerEvent {}
 
 export function isTextEntity(entity: {
killedBy: chart layer type guards discriminate on the type field
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
src/utilities/view.ts:58:10
 }
 
 export function isChartLayerEvent(layer: ChartLayer): layer is ChartLayerEvent {
-  return layer.type === "event";
+  return true;
 }
 
killedBy: chart layer type guards discriminate on the type field
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/utilities/view.ts:58:10
 }
 
 export function isChartLayerEvent(layer: ChartLayer): layer is ChartLayerEvent {
-  return layer.type === "event";
+  return layer.type !== "event";
 }
 
killedBy: chart layer type guards discriminate on the type field
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/utilities/view.ts:63:26
 
 export function isTextEntity(entity: {
   type: EntityType;
-}): entity is TextEntity {
-  return entity.type === "text";
-}
+}): entity is TextEntity {}
 
 export function applyLayerTransform(
killedBy: entity type guards discriminate on the type field
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
src/utilities/view.ts:64:10
 export function isTextEntity(entity: {
   type: EntityType;
 }): entity is TextEntity {
-  return entity.type === "text";
+  return true;
 }
 
killedBy: entity type guards discriminate on the type field
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/utilities/view.ts:64:10
 export function isTextEntity(entity: {
   type: EntityType;
 }): entity is TextEntity {
-  return entity.type === "text";
+  return entity.type !== "text";
 }
 
killedBy: entity type guards discriminate on the type field
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/utilities/view.ts:79:7
   index: number = 0,
 ): number | null {
   let newValue = value;
-  if (transform.type === "self") {
+  if (false) {
     // Transform using specified modifiers on the original data
     const transformSelf = transform as DataTransformSelf;
killedBy: applyLayerTransform
statusReason: expected +0 to be 1 // Object.is equality

[Killed] EqualityOperator
src/utilities/view.ts:79:7
   index: number = 0,
 ): number | null {
   let newValue = value;
-  if (transform.type === "self") {
+  if (transform.type !== "self") {
     // Transform using specified modifiers on the original data
     const transformSelf = transform as DataTransformSelf;
killedBy: applyLayerTransform
statusReason: expected +0 to be 1 // Object.is equality

[Killed] AssignmentOperator
src/utilities/view.ts:82:5
   if (transform.type === "self") {
     // Transform using specified modifiers on the original data
     const transformSelf = transform as DataTransformSelf;
-    newValue += transformSelf.add ?? 0;
+    newValue -= transformSelf.add ?? 0;
     newValue -= transformSelf.subtract ?? 0;
     newValue *= transformSelf.multiply ?? 1;
killedBy: applyLayerTransform
statusReason: expected -1 to be 1 // Object.is equality

[Killed] LogicalOperator
src/utilities/view.ts:82:17
   if (transform.type === "self") {
     // Transform using specified modifiers on the original data
     const transformSelf = transform as DataTransformSelf;
-    newValue += transformSelf.add ?? 0;
+    newValue += transformSelf.add && 0;
     newValue -= transformSelf.subtract ?? 0;
     newValue *= transformSelf.multiply ?? 1;
killedBy: applyLayerTransform
statusReason: expected +0 to be 1 // Object.is equality

[Killed] AssignmentOperator
src/utilities/view.ts:83:5
     // Transform using specified modifiers on the original data
     const transformSelf = transform as DataTransformSelf;
     newValue += transformSelf.add ?? 0;
-    newValue -= transformSelf.subtract ?? 0;
+    newValue += transformSelf.subtract ?? 0;
     newValue *= transformSelf.multiply ?? 1;
     newValue /= transformSelf.divide ?? 1;
killedBy: applyLayerTransform
statusReason: expected 3 to be -1 // Object.is equality

[Killed] LogicalOperator
src/utilities/view.ts:83:17
     // Transform using specified modifiers on the original data
     const transformSelf = transform as DataTransformSelf;
     newValue += transformSelf.add ?? 0;
-    newValue -= transformSelf.subtract ?? 0;
+    newValue -= transformSelf.subtract && 0;
     newValue *= transformSelf.multiply ?? 1;
     newValue /= transformSelf.divide ?? 1;
killedBy: applyLayerTransform
statusReason: expected NaN to be 1 // Object.is equality

[Killed] LogicalOperator
src/utilities/view.ts:84:17
     const transformSelf = transform as DataTransformSelf;
     newValue += transformSelf.add ?? 0;
     newValue -= transformSelf.subtract ?? 0;
-    newValue *= transformSelf.multiply ?? 1;
+    newValue *= transformSelf.multiply && 1;
     newValue /= transformSelf.divide ?? 1;
   } else if (transform.type === "derived") {
killedBy: applyLayerTransform
statusReason: expected NaN to be 1 // Object.is equality

[Killed] AssignmentOperator
src/utilities/view.ts:84:5
     const transformSelf = transform as DataTransformSelf;
     newValue += transformSelf.add ?? 0;
     newValue -= transformSelf.subtract ?? 0;
-    newValue *= transformSelf.multiply ?? 1;
+    newValue /= transformSelf.multiply ?? 1;
     newValue /= transformSelf.divide ?? 1;
   } else if (transform.type === "derived") {
killedBy: applyLayerTransform self multiply and divide
statusReason: expected 2 to be 8 // Object.is equality

[Killed] LogicalOperator
src/utilities/view.ts:85:17
     newValue += transformSelf.add ?? 0;
     newValue -= transformSelf.subtract ?? 0;
     newValue *= transformSelf.multiply ?? 1;
-    newValue /= transformSelf.divide ?? 1;
+    newValue /= transformSelf.divide && 1;
   } else if (transform.type === "derived") {
     const transformDerived = transform as DataTransformDerived;
killedBy: applyLayerTransform
statusReason: expected NaN to be 1 // Object.is equality

[Killed] AssignmentOperator
src/utilities/view.ts:85:5
     newValue += transformSelf.add ?? 0;
     newValue -= transformSelf.subtract ?? 0;
     newValue *= transformSelf.multiply ?? 1;
-    newValue /= transformSelf.divide ?? 1;
+    newValue *= transformSelf.divide ?? 1;
   } else if (transform.type === "derived") {
     const transformDerived = transform as DataTransformDerived;
killedBy: applyLayerTransform self multiply and divide
statusReason: expected 16 to be 4 // Object.is equality

[Killed] ConditionalExpression
src/utilities/view.ts:86:14
     newValue -= transformSelf.subtract ?? 0;
     newValue *= transformSelf.multiply ?? 1;
     newValue /= transformSelf.divide ?? 1;
-  } else if (transform.type === "derived") {
+  } else if (false) {
     const transformDerived = transform as DataTransformDerived;
     // Transform using the matching point from a specified layer
killedBy: applyLayerTransform
statusReason: expected +0 to be 3 // Object.is equality

[Killed] EqualityOperator
src/utilities/view.ts:86:14
     newValue -= transformSelf.subtract ?? 0;
     newValue *= transformSelf.multiply ?? 1;
     newValue /= transformSelf.divide ?? 1;
-  } else if (transform.type === "derived") {
+  } else if (transform.type !== "derived") {
     const transformDerived = transform as DataTransformDerived;
     // Transform using the matching point from a specified layer
killedBy: applyLayerTransform
statusReason: expected +0 to be 3 // Object.is equality

[Killed] ConditionalExpression
src/utilities/view.ts:90:22
     const transformDerived = transform as DataTransformDerived;
     // Transform using the matching point from a specified layer
     const matchingLayer = data.find(
-      ({ layer }) => layer.id === transformDerived.layerId,
+      ({ layer }) => false,
     );
     if (matchingLayer && field) {
killedBy: applyLayerTransform
statusReason: expected +0 to be 3 // Object.is equality

[Killed] ConditionalExpression
src/utilities/view.ts:90:22
     const transformDerived = transform as DataTransformDerived;
     // Transform using the matching point from a specified layer
     const matchingLayer = data.find(
-      ({ layer }) => layer.id === transformDerived.layerId,
+      ({ layer }) => true,
     );
     if (matchingLayer && field) {
killedBy: applyLayerTransform
statusReason: expected +0 to be 3 // Object.is equality

[Killed] ConditionalExpression
src/utilities/view.ts:92:9
     const matchingLayer = data.find(
       ({ layer }) => layer.id === transformDerived.layerId,
     );
-    if (matchingLayer && field) {
+    if (true) {
       // Find matching value in time
       const matchingPoint = findMatchingPoint(
killedBy: applyLayerTransform derived returns value unchanged when the referenced layer is missing
statusReason: Cannot read properties of undefined (reading 'pointsByField')

[Killed] BlockStatement
src/utilities/view.ts:92:33
     const matchingLayer = data.find(
       ({ layer }) => layer.id === transformDerived.layerId,
     );
-    if (matchingLayer && field) {
-      // Find matching value in time
-      const matchingPoint = findMatchingPoint(
-        matchingLayer.pointsByField[field],
-        index,
-        point.x,
-      );
-      if (
-        matchingPoint
-        // TODO would be nice to refactor this to take in a Point<number, number> where x is milliseconds
-        // instead of a timestamp string
-      ) {
-        newValue += transform.add ? (matchingPoint.y as number) : 0;
-        newValue -= transform.subtract ? (matchingPoint.y as number) : 0;
-        newValue *= transform.multiply ? (matchingPoint.y as number) : 1;
-        newValue /= transform.divide ? (matchingPoint.y as number) : 1;
-      } else {
-        return null;
-      }
-    }
+    if (matchingLayer && field) {}
   }
 
killedBy: applyLayerTransform
statusReason: expected +0 to be 3 // Object.is equality

[Killed] ConditionalExpression
src/utilities/view.ts:100:9
         point.x,
       );
       if (
-        matchingPoint
+        true
         // TODO would be nice to refactor this to take in a Point<number, number> where x is milliseconds
         // instead of a timestamp string
killedBy: applyLayerTransforms
statusReason: Cannot read properties of null (reading 'y')

[Killed] ConditionalExpression
src/utilities/view.ts:100:9
         point.x,
       );
       if (
-        matchingPoint
+        false
         // TODO would be nice to refactor this to take in a Point<number, number> where x is milliseconds
         // instead of a timestamp string
killedBy: applyLayerTransform
statusReason: expected null to be 3 // Object.is equality

[Killed] BlockStatement
src/utilities/view.ts:103:9
         matchingPoint
         // TODO would be nice to refactor this to take in a Point<number, number> where x is milliseconds
         // instead of a timestamp string
-      ) {
-        newValue += transform.add ? (matchingPoint.y as number) : 0;
-        newValue -= transform.subtract ? (matchingPoint.y as number) : 0;
-        newValue *= transform.multiply ? (matchingPoint.y as number) : 1;
-        newValue /= transform.divide ? (matchingPoint.y as number) : 1;
-      } else {
+      ) {} else {
         return null;
       }
killedBy: applyLayerTransform
statusReason: expected +0 to be 3 // Object.is equality

[Killed] AssignmentOperator
src/utilities/view.ts:104:9
         // TODO would be nice to refactor this to take in a Point<number, number> where x is milliseconds
         // instead of a timestamp string
       ) {
-        newValue += transform.add ? (matchingPoint.y as number) : 0;
+        newValue -= transform.add ? matchingPoint.y as number : 0;
         newValue -= transform.subtract ? (matchingPoint.y as number) : 0;
         newValue *= transform.multiply ? (matchingPoint.y as number) : 1;
killedBy: applyLayerTransform
statusReason: expected -3 to be 3 // Object.is equality

[Killed] AssignmentOperator
src/utilities/view.ts:105:9
         // instead of a timestamp string
       ) {
         newValue += transform.add ? (matchingPoint.y as number) : 0;
-        newValue -= transform.subtract ? (matchingPoint.y as number) : 0;
+        newValue += transform.subtract ? matchingPoint.y as number : 0;
         newValue *= transform.multiply ? (matchingPoint.y as number) : 1;
         newValue /= transform.divide ? (matchingPoint.y as number) : 1;
killedBy: applyLayerTransform derived subtract and divide
statusReason: expected 13 to be 7 // Object.is equality

[Killed] AssignmentOperator
src/utilities/view.ts:106:9
       ) {
         newValue += transform.add ? (matchingPoint.y as number) : 0;
         newValue -= transform.subtract ? (matchingPoint.y as number) : 0;
-        newValue *= transform.multiply ? (matchingPoint.y as number) : 1;
+        newValue /= transform.multiply ? matchingPoint.y as number : 1;
         newValue /= transform.divide ? (matchingPoint.y as number) : 1;
       } else {
killedBy: applyLayerTransforms
statusReason: expected { x: '2030-01-01T00:00:00.000Z', …(3) } to deeply equal { x: '2030-01-01T00:00:00.000Z', …(3) }

[Killed] AssignmentOperator
src/utilities/view.ts:107:9
         newValue += transform.add ? (matchingPoint.y as number) : 0;
         newValue -= transform.subtract ? (matchingPoint.y as number) : 0;
         newValue *= transform.multiply ? (matchingPoint.y as number) : 1;
-        newValue /= transform.divide ? (matchingPoint.y as number) : 1;
+        newValue *= transform.divide ? matchingPoint.y as number : 1;
       } else {
         return null;
killedBy: applyLayerTransform derived subtract and divide
statusReason: expected 27 to be 3 // Object.is equality

[Killed] BlockStatement
src/utilities/view.ts:108:14
         newValue -= transform.subtract ? (matchingPoint.y as number) : 0;
         newValue *= transform.multiply ? (matchingPoint.y as number) : 1;
         newValue /= transform.divide ? (matchingPoint.y as number) : 1;
-      } else {
-        return null;
-      }
+      } else {}
     }
   }
killedBy: applyLayerTransforms
statusReason: expected { x: '2030-01-01T00:00:00.000Z', …(3) } to deeply equal null

[Killed] BlockStatement
src/utilities/view.ts:124:3
   points: TimeSeriesPoint[],
   index = 0,
   dateString = "",
-) {
-  const pointAtIndex = points[index];
-  if (pointAtIndex && pointAtIndex.x === dateString) {
-    return pointAtIndex;
-  }
-
-  let step = 0;
-  while (step < points.length) {
-    const leftPoint = points[index - step];
-    if (leftPoint && leftPoint.x === dateString) {
-      return leftPoint;
-    }
-    const rightPoint = points[index + step];
-    if (rightPoint && rightPoint.x === dateString) {
-      return rightPoint;
-    }
-    step++;
-  }
-  return null;
-}
+) {}
 
 /* Apply layer transformations to a point at the given index */
killedBy: applyLayerTransform
statusReason: expected null to be 3 // Object.is equality

[Killed] ConditionalExpression
src/utilities/view.ts:126:23
   dateString = "",
 ) {
   const pointAtIndex = points[index];
-  if (pointAtIndex && pointAtIndex.x === dateString) {
+  if (pointAtIndex && true) {
     return pointAtIndex;
   }
killedBy: applyLayerTransforms
statusReason: expected { x: '2030-01-01T00:00:00.000Z', …(3) } to deeply equal null

[Killed] EqualityOperator
src/utilities/view.ts:126:23
   dateString = "",
 ) {
   const pointAtIndex = points[index];
-  if (pointAtIndex && pointAtIndex.x === dateString) {
+  if (pointAtIndex && pointAtIndex.x !== dateString) {
     return pointAtIndex;
   }
killedBy: applyLayerTransforms
statusReason: expected { x: '2030-01-01T00:00:00.000Z', …(3) } to deeply equal null

[Killed] ConditionalExpression
src/utilities/view.ts:131:10
   }
 
   let step = 0;
-  while (step < points.length) {
+  while (false) {
     const leftPoint = points[index - step];
     if (leftPoint && leftPoint.x === dateString) {
killedBy: findMatchingPoint
statusReason: expected null to deeply equal { x: '2030-01-02T00:00:00.000Z', …(3) }

[Timeout] EqualityOperator
src/utilities/view.ts:131:10
   }
 
   let step = 0;
-  while (step < points.length) {
+  while (step >= points.length) {
     const leftPoint = points[index - step];
     if (leftPoint && leftPoint.x === dateString) {

[Killed] ArithmeticOperator
src/utilities/view.ts:132:30
 
   let step = 0;
   while (step < points.length) {
-    const leftPoint = points[index - step];
+    const leftPoint = points[index + step];
     if (leftPoint && leftPoint.x === dateString) {
       return leftPoint;
killedBy: findMatchingPoint scans backwards from the start index
statusReason: expected null to deeply equal { x: '2030-01-01T00:00:00.000Z', …(3) }

[Killed] BlockStatement
src/utilities/view.ts:133:50
   let step = 0;
   while (step < points.length) {
     const leftPoint = points[index - step];
-    if (leftPoint && leftPoint.x === dateString) {
-      return leftPoint;
-    }
+    if (leftPoint && leftPoint.x === dateString) {}
     const rightPoint = points[index + step];
     if (rightPoint && rightPoint.x === dateString) {
killedBy: findMatchingPoint scans backwards from the start index
statusReason: expected null to deeply equal { x: '2030-01-01T00:00:00.000Z', …(3) }

[Killed] ConditionalExpression
src/utilities/view.ts:133:22
   let step = 0;
   while (step < points.length) {
     const leftPoint = points[index - step];
-    if (leftPoint && leftPoint.x === dateString) {
+    if (leftPoint && true) {
       return leftPoint;
     }
killedBy: applyLayerTransforms
statusReason: expected { x: '2030-01-01T00:00:00.000Z', …(3) } to deeply equal null

[Killed] ArithmeticOperator
src/utilities/view.ts:136:31
     if (leftPoint && leftPoint.x === dateString) {
       return leftPoint;
     }
-    const rightPoint = points[index + step];
+    const rightPoint = points[index - step];
     if (rightPoint && rightPoint.x === dateString) {
       return rightPoint;
killedBy: findMatchingPoint
statusReason: expected null to deeply equal { x: '2030-01-02T00:00:00.000Z', …(3) }

[Killed] EqualityOperator
src/utilities/view.ts:137:23
       return leftPoint;
     }
     const rightPoint = points[index + step];
-    if (rightPoint && rightPoint.x === dateString) {
+    if (rightPoint && rightPoint.x !== dateString) {
       return rightPoint;
     }
killedBy: applyLayerTransforms
statusReason: expected { x: '2030-01-01T00:00:00.000Z', …(3) } to deeply equal null

[Killed] ConditionalExpression
src/utilities/view.ts:137:9
       return leftPoint;
     }
     const rightPoint = points[index + step];
-    if (rightPoint && rightPoint.x === dateString) {
+    if (true) {
       return rightPoint;
     }
killedBy: applyLayerTransforms
statusReason: expected { x: '2030-01-01T00:00:00.000Z', …(3) } to deeply equal null

[Timeout] UpdateOperator
src/utilities/view.ts:140:5
     if (rightPoint && rightPoint.x === dateString) {
       return rightPoint;
     }
-    step++;
+    step--;
   }
   return null;

[Killed] LogicalOperator
src/utilities/view.ts:155:7
   }[],
   index: number,
 ): TimeSeriesPoint | null {
-  if (!layer.transforms || !layer.transforms.length) return point;
+  if (!layer.transforms && !layer.transforms.length) return point;
   const field = layer.fields[0]; // TODO pass this in?
   let newPoint = { ...point };
killedBy: applyLayerTransforms
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ConditionalExpression
src/utilities/view.ts:155:7
   }[],
   index: number,
 ): TimeSeriesPoint | null {
-  if (!layer.transforms || !layer.transforms.length) return point;
+  if (false) return point;
   const field = layer.fields[0]; // TODO pass this in?
   let newPoint = { ...point };
killedBy: applyLayerTransforms
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] EqualityOperator
src/utilities/view.ts:159:19
   const field = layer.fields[0]; // TODO pass this in?
   let newPoint = { ...point };
 
-  for (let i = 0; i < layer.transforms.length; i++) {
+  for (let i = 0; i >= layer.transforms.length; i++) {
     const transform = layer.transforms[i];
     const value = newPoint[transform.axis];
killedBy: applyLayerTransforms
statusReason: expected { x: '2030-01-01T00:00:00.000Z', …(3) } to deeply equal { x: '2030-01-01T00:00:00.000Z', …(3) }

[Killed] EqualityOperator
src/utilities/view.ts:159:19
   const field = layer.fields[0]; // TODO pass this in?
   let newPoint = { ...point };
 
-  for (let i = 0; i < layer.transforms.length; i++) {
+  for (let i = 0; i <= layer.transforms.length; i++) {
     const transform = layer.transforms[i];
     const value = newPoint[transform.axis];
killedBy: applyLayerTransforms
statusReason: Cannot read properties of undefined (reading 'axis')

[Killed] EqualityOperator
src/utilities/view.ts:163:9
     const transform = layer.transforms[i];
     const value = newPoint[transform.axis];
     let newX = newPoint.x;
-    if (transform.axis === "x") {
+    if (transform.axis !== "x") {
       const transformedX = applyLayerTransform(
         new Date(value).getTime(),
killedBy: applyLayerTransforms
statusReason: expected { x: '1970-01-01T00:00:00.001Z', …(3) } to deeply equal { x: '2030-01-01T00:00:00.000Z', …(3) }

[Killed] BlockStatement
src/utilities/view.ts:163:33
     const transform = layer.transforms[i];
     const value = newPoint[transform.axis];
     let newX = newPoint.x;
-    if (transform.axis === "x") {
-      const transformedX = applyLayerTransform(
-        new Date(value).getTime(),
-        newPoint,
-        transform,
-        field,
-        data,
-        index,
-      );
-      if (transformedX === null) {
-        return null;
-      }
-      newX = new Date(transformedX).toISOString().toString();
-    }
+    if (transform.axis === "x") {}
     let newY = newPoint.y;
     if (transform.axis === "y") {
killedBy: applyLayerTransforms applies an x-axis transform without touching y
statusReason: expected '2030-01-01T00:00:00.000Z' to be '2030-01-02T00:00:00.000Z' // Object.is equality

[Killed] ConditionalExpression
src/utilities/view.ts:172:11
         data,
         index,
       );
-      if (transformedX === null) {
+      if (false) {
         return null;
       }
killedBy: applyLayerTransforms returns null when an x-axis derived point is unaligned
statusReason: expected { x: '1970-01-01T00:00:00.000Z', …(3) } to be null

[Killed] EqualityOperator
src/utilities/view.ts:172:11
         data,
         index,
       );
-      if (transformedX === null) {
+      if (transformedX !== null) {
         return null;
       }
killedBy: applyLayerTransforms applies an x-axis transform without touching y
statusReason: expected null not to be null
