[Killed] ConditionalExpression
src/utilities/view.ts:178:9
       newX = new Date(transformedX).toISOString().toString();
     }
     let newY = newPoint.y;
-    if (transform.axis === "y") {
+    if (true) {
       const transformedY = applyLayerTransform(
         value as number,
killedBy: applyLayerTransforms applies an x-axis transform without touching y
statusReason: expected NaN to be 7 // Object.is equality

[Killed] ConditionalExpression
src/utilities/view.ts:178:9
       newX = new Date(transformedX).toISOString().toString();
     }
     let newY = newPoint.y;
-    if (transform.axis === "y") {
+    if (false) {
       const transformedY = applyLayerTransform(
         value as number,
killedBy: applyLayerTransforms
statusReason: expected { x: '2030-01-01T00:00:00.000Z', …(3) } to deeply equal { x: '2030-01-01T00:00:00.000Z', …(3) }

[Killed] ConditionalExpression
src/utilities/view.ts:187:11
         data,
         index,
       );
-      if (transformedY === null) {
+      if (false) {
         return null;
       }
killedBy: applyLayerTransforms
statusReason: expected { x: '2030-01-01T00:00:00.000Z', …(3) } to deeply equal null

[Killed] ConditionalExpression
src/utilities/view.ts:187:11
         data,
         index,
       );
-      if (transformedY === null) {
+      if (true) {
         return null;
       }
killedBy: applyLayerTransforms
statusReason: expected null to deeply equal { x: '2030-01-01T00:00:00.000Z', …(3) }

[Killed] ObjectLiteral
src/utilities/view.ts:193:16
       newY = transformedY;
     }
 
-    newPoint = {
-      ...newPoint,
-      x: newX,
-      y: newY,
-    };
+    newPoint = {};
   }
 
killedBy: applyLayerTransforms
statusReason: expected {} to deeply equal { x: '2030-01-01T00:00:00.000Z', …(3) }

[Killed] BlockStatement
src/utilities/view.ts:204:73
 }
 
 // TODO move to a more generic utils file?
-export function formatYValue(tickValue: number | string | null): string {
-  if (tickValue === null) {
-    return "";
-  }
-
-  if (typeof tickValue === "string") {
-    return tickValue;
-  }
-  const formattedValue =
-    Math.abs(tickValue) < 0.0001 || Math.abs(tickValue) > 9999
-      ? format("~e")(tickValue)
-      : format("~g")(tickValue);
-
-  return formattedValue.replace("e+0", "");
-}
+export function formatYValue(tickValue: number | string | null): string {}
 
 export function createView(): View {
killedBy: formatYValue
statusReason: expected undefined to deeply equal '10'

[Killed] BlockStatement
src/utilities/view.ts:205:27
 
 // TODO move to a more generic utils file?
 export function formatYValue(tickValue: number | string | null): string {
-  if (tickValue === null) {
-    return "";
-  }
+  if (tickValue === null) {}
 
   if (typeof tickValue === "string") {
killedBy: formatYValue
statusReason: expected '0' to deeply equal ''

[Killed] EqualityOperator
src/utilities/view.ts:205:7
 
 // TODO move to a more generic utils file?
 export function formatYValue(tickValue: number | string | null): string {
-  if (tickValue === null) {
+  if (tickValue !== null) {
     return "";
   }
killedBy: formatYValue
statusReason: expected '' to deeply equal '10'

[Killed] ConditionalExpression
src/utilities/view.ts:209:7
     return "";
   }
 
-  if (typeof tickValue === "string") {
+  if (true) {
     return tickValue;
   }
killedBy: formatYValue
statusReason: expected +0 to deeply equal '0'

[Killed] EqualityOperator
src/utilities/view.ts:209:7
     return "";
   }
 
-  if (typeof tickValue === "string") {
+  if (typeof tickValue !== "string") {
     return tickValue;
   }
killedBy: formatYValue
statusReason: expected +0 to deeply equal '0'

[Killed] EqualityOperator
src/utilities/view.ts:213:37
     return tickValue;
   }
   const formattedValue =
-    Math.abs(tickValue) < 0.0001 || Math.abs(tickValue) > 9999
+    Math.abs(tickValue) < 0.0001 || Math.abs(tickValue) <= 9999
       ? format("~e")(tickValue)
       : format("~g")(tickValue);
killedBy: formatYValue
statusReason: expected '1e+1' to deeply equal '10'

[Killed] EqualityOperator
src/utilities/view.ts:213:5
     return tickValue;
   }
   const formattedValue =
-    Math.abs(tickValue) < 0.0001 || Math.abs(tickValue) > 9999
+    Math.abs(tickValue) >= 0.0001 || Math.abs(tickValue) > 9999
       ? format("~e")(tickValue)
       : format("~g")(tickValue);
killedBy: formatYValue
statusReason: expected '1e+1' to deeply equal '10'

[Killed] StringLiteral
src/utilities/view.ts:214:16
   }
   const formattedValue =
     Math.abs(tickValue) < 0.0001 || Math.abs(tickValue) > 9999
-      ? format("~e")(tickValue)
+      ? format("")(tickValue)
       : format("~g")(tickValue);
 
killedBy: formatYValue
statusReason: expected '100000' to deeply equal '1e+5'

[Killed] StringLiteral
src/utilities/view.ts:215:16
   const formattedValue =
     Math.abs(tickValue) < 0.0001 || Math.abs(tickValue) > 9999
       ? format("~e")(tickValue)
-      : format("~g")(tickValue);
+      : format("")(tickValue);
 
   return formattedValue.replace("e+0", "");
killedBy: formatYValue
statusReason: expected '123.456789' to deeply equal '123.457'

[Killed] BlockStatement
src/utilities/view.ts:220:36
   return formattedValue.replace("e+0", "");
 }
 
-export function createView(): View {
-  return {
-    config: {
-      sidebarWidth: 200,
-      dateRangeBounds: {
-        start: "2010-12-01T00:00:00Z",
-        end: "2050-12-01T00:00:00Z",
-      },
-    },
-    home: createViewPage({}),
-    pageGroups: [],
-    version: VIEW_VERSION,
-  };
-}
+export function createView(): View {}
 
 export function createViewPage(params: Partial<Page>): Page {
killedBy: createView produces a versioned, empty default view
statusReason: Cannot read properties of undefined (reading 'version')

[Killed] BlockStatement
src/utilities/view.ts:235:61
   };
 }
 
-export function createViewPage(params: Partial<Page>): Page {
-  return {
-    dateFormat: "long",
-    id: generateUUID(),
-    sections: [],
-    title: "",
-    url: "",
-    ...params,
-  };
-}
+export function createViewPage(params: Partial<Page>): Page {}
 
 export function createViewPageGroup(params: Partial<PageGroup>): PageGroup {
killedBy: createView produces a versioned, empty default view
statusReason: Cannot read properties of undefined (reading 'sections')

[Killed] StringLiteral
src/utilities/view.ts:237:17
 
 export function createViewPage(params: Partial<Page>): Page {
   return {
-    dateFormat: "long",
+    dateFormat: "",
     id: generateUUID(),
     sections: [],
killedBy: createView produces a versioned, empty default view
statusReason: expected '' to be 'long' // Object.is equality

[Killed] StringLiteral
src/utilities/view.ts:240:12
     dateFormat: "long",
     id: generateUUID(),
     sections: [],
-    title: "",
+    title: "Stryker was here!",
     url: "",
     ...params,
killedBy: createViewPage applies defaults and honors overrides
statusReason: expected 'Stryker was here!' to be '' // Object.is equality

[Killed] BlockStatement
src/utilities/view.ts:246:76
   };
 }
 
-export function createViewPageGroup(params: Partial<PageGroup>): PageGroup {
-  return {
-    id: generateUUID(),
-    pages: [],
-    title: "",
-    url: "",
-    ...params,
-  };
-}
+export function createViewPageGroup(params: Partial<PageGroup>): PageGroup {}
 
 export function createEntity(params: Partial<Entity>): Entity {
killedBy: createViewPageGroup applies defaults and honors overrides
statusReason: Cannot read properties of undefined (reading 'pages')

[Killed] StringLiteral
src/utilities/view.ts:250:12
   return {
     id: generateUUID(),
     pages: [],
-    title: "",
+    title: "Stryker was here!",
     url: "",
     ...params,
killedBy: createViewPageGroup applies defaults and honors overrides
statusReason: expected 'Stryker was here!' to be '' // Object.is equality

[Killed] BlockStatement
src/utilities/view.ts:256:63
   };
 }
 
-export function createEntity(params: Partial<Entity>): Entity {
-  const type = params.type || "chart";
-  const entity: Entity = {
-    id: generateUUID(),
-    title: "New Entity",
-    type,
-    syncWithPageDateRange: true,
-    ...params,
-  };
-
-  // Add in required properties
-  if (isTableEntity(entity)) {
-    entity.columns = [];
-    entity.layers = [];
-  }
-  return entity;
-}
+export function createEntity(params: Partial<Entity>): Entity {}
 
 export function createDataLayer(params: Partial<DataLayer>): DataLayer {
killedBy: createEntity defaults to a chart and only tables get columns/layers
statusReason: Cannot read properties of undefined (reading 'type')

[Killed] ConditionalExpression
src/utilities/view.ts:257:16
 }
 
 export function createEntity(params: Partial<Entity>): Entity {
-  const type = params.type || "chart";
+  const type = true;
   const entity: Entity = {
     id: generateUUID(),
killedBy: createEntity defaults to a chart and only tables get columns/layers
statusReason: expected true to be 'chart' // Object.is equality

[Killed] ConditionalExpression
src/utilities/view.ts:257:16
 }
 
 export function createEntity(params: Partial<Entity>): Entity {
-  const type = params.type || "chart";
+  const type = false;
   const entity: Entity = {
     id: generateUUID(),
killedBy: createEntity defaults to a chart and only tables get columns/layers
statusReason: expected false to be 'chart' // Object.is equality

[Killed] BooleanLiteral
src/utilities/view.ts:262:28
     id: generateUUID(),
     title: "New Entity",
     type,
-    syncWithPageDateRange: true,
+    syncWithPageDateRange: false,
     ...params,
   };
killedBy: createEntity defaults to a chart and only tables get columns/layers
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/utilities/view.ts:267:7
   };
 
   // Add in required properties
-  if (isTableEntity(entity)) {
+  if (false) {
     entity.columns = [];
     entity.layers = [];
killedBy: createEntity defaults to a chart and only tables get columns/layers
statusReason: expected undefined to deeply equal []

[Killed] ConditionalExpression
src/utilities/view.ts:267:7
   };
 
   // Add in required properties
-  if (isTableEntity(entity)) {
+  if (true) {
     entity.columns = [];
     entity.layers = [];
killedBy: createEntity defaults to a chart and only tables get columns/layers
statusReason: expected true to be false // Object.is equality

[Killed] ArrayDeclaration
src/utilities/view.ts:269:21
   // Add in required properties
   if (isTableEntity(entity)) {
     entity.columns = [];
-    entity.layers = [];
+    entity.layers = ["Stryker was here"];
   }
   return entity;
killedBy: createEntity defaults to a chart and only tables get columns/layers
statusReason: expected [ 'Stryker was here' ] to deeply equal []

[Killed] BlockStatement
src/utilities/view.ts:274:72
   return entity;
 }
 
-export function createDataLayer(params: Partial<DataLayer>): DataLayer {
-  return {
-    dataset: "",
-    endTime: "",
-    fields: [],
-    id: generateUUID(),
-    instrument: "",
-    mission: "",
-    startTime: "",
-    version: "",
-    ...params,
-  };
-}
+export function createDataLayer(params: Partial<DataLayer>): DataLayer {}
 
 export function duplicateEntity(entity: Entity, section: Section): Section {
killedBy: createDataLayer applies defaults and honors overrides
statusReason: expected undefined to match object { dataset: '', endTime: '', …(5) }

[Killed] StringLiteral
src/utilities/view.ts:276:14
 
 export function createDataLayer(params: Partial<DataLayer>): DataLayer {
   return {
-    dataset: "",
+    dataset: "Stryker was here!",
     endTime: "",
     fields: [],
killedBy: createDataLayer applies defaults and honors overrides
statusReason: expected { dataset: 'Stryker was here!', …(7) } to match object { dataset: '', endTime: '', …(5) }
(1 matching property omitted from actual)

[Killed] StringLiteral
src/utilities/view.ts:277:14
 export function createDataLayer(params: Partial<DataLayer>): DataLayer {
   return {
     dataset: "",
-    endTime: "",
+    endTime: "Stryker was here!",
     fields: [],
     id: generateUUID(),
killedBy: createDataLayer applies defaults and honors overrides
statusReason: expected { dataset: '', …(7) } to match object { dataset: '', endTime: '', …(5) }
(1 matching property omitted from actual)

[Killed] ArrayDeclaration
src/utilities/view.ts:278:13
   return {
     dataset: "",
     endTime: "",
-    fields: [],
+    fields: ["Stryker was here"],
     id: generateUUID(),
     instrument: "",
killedBy: createDataLayer applies defaults and honors overrides
statusReason: expected { dataset: '', endTime: '', …(6) } to match object { dataset: '', endTime: '', …(5) }
(1 matching property omitted from actual)

[Killed] StringLiteral
src/utilities/view.ts:280:17
     endTime: "",
     fields: [],
     id: generateUUID(),
-    instrument: "",
+    instrument: "Stryker was here!",
     mission: "",
     startTime: "",
killedBy: createDataLayer applies defaults and honors overrides
statusReason: expected { dataset: '', endTime: '', …(6) } to match object { dataset: '', endTime: '', …(5) }
(1 matching property omitted from actual)

[Killed] BlockStatement
src/utilities/view.ts:288:76
   };
 }
 
-export function duplicateEntity(entity: Entity, section: Section): Section {
-  const newId = generateUUID();
-  const newEntity = structuredClone(entity);
-  newEntity.id = newId;
-  const newEntities: Entity[] = section.entities.concat(newEntity);
-  const newLayout: SectionLayout[] = [
-    ...section.layout,
-    { i: newId, w: 4, h: 2, x: 0, y: 0 },
-  ];
-  return {
-    ...section,
-    entities: newEntities,
-    layout: newLayout,
-  };
-}
+export function duplicateEntity(entity: Entity, section: Section): Section {}
 
 export function removeEntityFromSection(
killedBy: duplicateEntity appends a clone with a new id and layout, leaving the source untouched
statusReason: Cannot read properties of undefined (reading 'entities')

[Killed] ArrayDeclaration
src/utilities/view.ts:293:38
   const newEntity = structuredClone(entity);
   newEntity.id = newId;
   const newEntities: Entity[] = section.entities.concat(newEntity);
-  const newLayout: SectionLayout[] = [
-    ...section.layout,
-    { i: newId, w: 4, h: 2, x: 0, y: 0 },
-  ];
+  const newLayout: SectionLayout[] = [];
   return {
     ...section,
killedBy: duplicateEntity appends a clone with a new id and layout, leaving the source untouched
statusReason: expected [] to have a length of 2 but got +0

[Killed] ObjectLiteral
src/utilities/view.ts:295:5
   const newEntities: Entity[] = section.entities.concat(newEntity);
   const newLayout: SectionLayout[] = [
     ...section.layout,
-    { i: newId, w: 4, h: 2, x: 0, y: 0 },
+    {},
   ];
   return {
killedBy: duplicateEntity appends a clone with a new id and layout, leaving the source untouched
statusReason: expected {} to deeply equal { …(5) }

[Killed] BlockStatement
src/utilities/view.ts:307:12
 export function removeEntityFromSection(
   section: Section,
   entityId: string,
-): Section {
-  const newEntities: Entity[] = [];
-  const newLayout: SectionLayout[] = [...section.layout];
-  section.entities.forEach((entity, i) => {
-    if (entity.id === entityId) {
-      newLayout.splice(i, 1);
-    } else {
-      newEntities.push(entity);
-    }
-  });
-  return {
-    ...section,
-    entities: newEntities,
-    layout: newLayout,
-  };
-}
+): Section {}
 
 export function replaceEntityInSection(
killedBy: removeEntityFromSection drops the entity and its layout entry by index, leaving others
statusReason: Cannot read properties of undefined (reading 'entities')

[Killed] ArrayDeclaration
src/utilities/view.ts:309:38
   entityId: string,
 ): Section {
   const newEntities: Entity[] = [];
-  const newLayout: SectionLayout[] = [...section.layout];
+  const newLayout: SectionLayout[] = [];
   section.entities.forEach((entity, i) => {
     if (entity.id === entityId) {
killedBy: removeEntityFromSection drops the entity and its layout entry by index, leaving others
statusReason: expected [] to deeply equal [ 'L0', 'L2' ]

[Killed] BlockStatement
src/utilities/view.ts:310:43
 ): Section {
   const newEntities: Entity[] = [];
   const newLayout: SectionLayout[] = [...section.layout];
-  section.entities.forEach((entity, i) => {
-    if (entity.id === entityId) {
-      newLayout.splice(i, 1);
-    } else {
-      newEntities.push(entity);
-    }
-  });
+  section.entities.forEach((entity, i) => {});
   return {
     ...section,
killedBy: removeEntityFromSection drops the entity and its layout entry by index, leaving others
statusReason: expected [] to deeply equal [ …(2) ]

[Killed] BlockStatement
src/utilities/view.ts:311:33
   const newEntities: Entity[] = [];
   const newLayout: SectionLayout[] = [...section.layout];
   section.entities.forEach((entity, i) => {
-    if (entity.id === entityId) {
-      newLayout.splice(i, 1);
-    } else {
+    if (entity.id === entityId) {} else {
       newEntities.push(entity);
     }
killedBy: removeEntityFromSection drops the entity and its layout entry by index, leaving others
statusReason: expected [ 'L0', 'L1', 'L2' ] to deeply equal [ 'L0', 'L2' ]

[Killed] EqualityOperator
src/utilities/view.ts:311:9
   const newEntities: Entity[] = [];
   const newLayout: SectionLayout[] = [...section.layout];
   section.entities.forEach((entity, i) => {
-    if (entity.id === entityId) {
+    if (entity.id !== entityId) {
       newLayout.splice(i, 1);
     } else {
killedBy: removeEntityFromSection drops the entity and its layout entry by index, leaving others
statusReason: expected [ Array(1) ] to deeply equal [ …(2) ]

[Killed] BlockStatement
src/utilities/view.ts:313:12
   section.entities.forEach((entity, i) => {
     if (entity.id === entityId) {
       newLayout.splice(i, 1);
-    } else {
-      newEntities.push(entity);
-    }
+    } else {}
   });
   return {
killedBy: removeEntityFromSection drops the entity and its layout entry by index, leaving others
statusReason: expected [] to deeply equal [ …(2) ]

[Killed] BlockStatement
src/utilities/view.ts:327:12
 export function replaceEntityInSection(
   section: Section,
   entity: Entity,
-): Section {
-  return {
-    ...section,
-    entities: section.entities.map((e) => (e.id === entity.id ? entity : e)),
-  };
-}
+): Section {}
 
 export function duplicateSection(section: Section): Section {
killedBy: replaceEntityInSection swaps the matching entity and leaves the rest untouched
statusReason: Cannot read properties of undefined (reading 'entities')

[Killed] EqualityOperator
src/utilities/view.ts:330:44
 ): Section {
   return {
     ...section,
-    entities: section.entities.map((e) => (e.id === entity.id ? entity : e)),
+    entities: section.entities.map((e) => (e.id !== entity.id ? entity : e)),
   };
 }
killedBy: replaceEntityInSection swaps the matching entity and leaves the rest untouched
statusReason: expected { …(4) } to be { …(4) } // Object.is equality

[Killed] ConditionalExpression
src/utilities/view.ts:330:44
 ): Section {
   return {
     ...section,
-    entities: section.entities.map((e) => (e.id === entity.id ? entity : e)),
+    entities: section.entities.map((e) => (true ? entity : e)),
   };
 }
killedBy: replaceEntityInSection swaps the matching entity and leaves the rest untouched
statusReason: expected { …(4) } to be { …(4) } // Object.is equality

[Killed] BlockStatement
src/utilities/view.ts:334:61
   };
 }
 
-export function duplicateSection(section: Section): Section {
-  const newSection = structuredClone(section);
-  newSection.id = generateUUID();
-  newSection.entities.forEach((entity) => {
-    const newId = generateUUID();
-    // Find matching entity within layout and map new ID
-    newSection.layout.forEach((l) => {
-      if (l.i === entity.id) {
-        l.i = newId;
-      }
-    });
-    entity.id = newId;
-  });
-  return newSection;
-}
+export function duplicateSection(section: Section): Section {}
 
killedBy: duplicateSection deep-clones with fresh ids and remaps layout entries
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] BlockStatement
src/utilities/view.ts:337:43
 export function duplicateSection(section: Section): Section {
   const newSection = structuredClone(section);
   newSection.id = generateUUID();
-  newSection.entities.forEach((entity) => {
-    const newId = generateUUID();
-    // Find matching entity within layout and map new ID
-    newSection.layout.forEach((l) => {
-      if (l.i === entity.id) {
-        l.i = newId;
-      }
-    });
-    entity.id = newId;
-  });
+  newSection.entities.forEach((entity) => {});
   return newSection;
 }
killedBy: duplicateSection deep-clones with fresh ids and remaps layout entries
statusReason: expected '0c16c41b-8a61-4c5f-ab24-1e2da6429fb2' not to be '0c16c41b-8a61-4c5f-ab24-1e2da6429fb2' // Object.is equality

[Killed] BlockStatement
src/utilities/view.ts:340:38
   newSection.entities.forEach((entity) => {
     const newId = generateUUID();
     // Find matching entity within layout and map new ID
-    newSection.layout.forEach((l) => {
-      if (l.i === entity.id) {
-        l.i = newId;
-      }
-    });
+    newSection.layout.forEach((l) => {});
     entity.id = newId;
   });
killedBy: duplicateSection deep-clones with fresh ids and remaps layout entries
statusReason: expected 'e117e9bf-7314-4394-943c-779c25411e46' to be '3fac1a44-12ed-4a5b-a8c1-9a3b5165d898' // Object.is equality

[Killed] BlockStatement
src/utilities/view.ts:341:30
     const newId = generateUUID();
     // Find matching entity within layout and map new ID
     newSection.layout.forEach((l) => {
-      if (l.i === entity.id) {
-        l.i = newId;
-      }
+      if (l.i === entity.id) {}
     });
     entity.id = newId;
killedBy: duplicateSection deep-clones with fresh ids and remaps layout entries
statusReason: expected '9f063b21-805a-4063-81ff-1c0eb54bb95c' to be 'ff036a57-d5ac-46a3-8d67-7cad9e9a3655' // Object.is equality

[Killed] EqualityOperator
src/utilities/view.ts:341:11
     const newId = generateUUID();
     // Find matching entity within layout and map new ID
     newSection.layout.forEach((l) => {
-      if (l.i === entity.id) {
+      if (l.i !== entity.id) {
         l.i = newId;
       }
killedBy: duplicateSection deep-clones with fresh ids and remaps layout entries
statusReason: expected '3c874abd-0d50-474f-ba29-f49c50590fdf' to be '277a746e-83fa-4520-84ce-f35893d50b1a' // Object.is equality
