[Killed] BlockStatement
src/utilities/generic.ts:134:72
  * Converts hex to rgba
  * @see https://gist.github.com/danieliser/b4b24c9f772066bcf0a6
  */
-export function convertHexToRGBA(hexCode: string, opacity: number = 1) {
-  try {
-    let hex = hexCode.replace("#", "");
-
-    if (hex.length === 3) {
-      hex = `${hex[0]}${hex[0]}${hex[1]}${hex[1]}${hex[2]}${hex[2]}`;
-    }
-
-    const r = parseInt(hex.substring(0, 2), 16);
-    const g = parseInt(hex.substring(2, 4), 16);
-    const b = parseInt(hex.substring(4, 6), 16);
-
-    /* Backward compatibility for whole number based opacity values. */
-    if (opacity > 1 && opacity <= 100) {
-      opacity = opacity / 100;
-    }
-
-    return `rgba(${r},${g},${b},${opacity})`;
-  } catch {
-    return "#000000";
-  }
-}
+export function convertHexToRGBA(hexCode: string, opacity: number = 1) {}
 
 export function downloadJSON(obj: unknown, filename: string) {
killedBy: convertHexToRGBA converts 6-digit and 3-digit hex
statusReason: expected undefined to be 'rgba(255,0,0,1)' // Object.is equality

[Killed] BlockStatement
src/utilities/generic.ts:135:7
  * @see https://gist.github.com/danieliser/b4b24c9f772066bcf0a6
  */
 export function convertHexToRGBA(hexCode: string, opacity: number = 1) {
-  try {
-    let hex = hexCode.replace("#", "");
-
-    if (hex.length === 3) {
-      hex = `${hex[0]}${hex[0]}${hex[1]}${hex[1]}${hex[2]}${hex[2]}`;
-    }
-
-    const r = parseInt(hex.substring(0, 2), 16);
-    const g = parseInt(hex.substring(2, 4), 16);
-    const b = parseInt(hex.substring(4, 6), 16);
-
-    /* Backward compatibility for whole number based opacity values. */
-    if (opacity > 1 && opacity <= 100) {
-      opacity = opacity / 100;
-    }
-
-    return `rgba(${r},${g},${b},${opacity})`;
-  } catch {
+  try {} catch {
     return "#000000";
   }
killedBy: convertHexToRGBA converts 6-digit and 3-digit hex
statusReason: expected undefined to be 'rgba(255,0,0,1)' // Object.is equality

[Killed] BlockStatement
src/utilities/generic.ts:152:11
     }
 
     return `rgba(${r},${g},${b},${opacity})`;
-  } catch {
-    return "#000000";
-  }
+  } catch {}
 }
 
killedBy: convertHexToRGBA falls back to black on invalid input
statusReason: expected undefined to be '#000000' // Object.is equality
