[Killed] BlockStatement
src/utilities/time.ts:52:75
  * Returns true if the time range is short enough for subset version filtering
  * to be available.
  */
-export function isWithinSubsetVersionMaxRange(start: string, end: string) {
-  const durationMs = new Date(end).getTime() - new Date(start).getTime();
-  return durationMs <= SUBSET_VERSION_MAX_RANGE_DAYS * 24 * 60 * 60 * 1000;
-}
+export function isWithinSubsetVersionMaxRange(start: string, end: string) {}
 
killedBy: renders the subset-version dropdown with All plus the fetched versions
statusReason: expected [] to have a length of 4 but got +0

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ArithmeticOperator
src/utilities/time.ts:53:22
  * to be available.
  */
 export function isWithinSubsetVersionMaxRange(start: string, end: string) {
-  const durationMs = new Date(end).getTime() - new Date(start).getTime();
+  const durationMs = new Date(end).getTime() + new Date(start).getTime();
   return durationMs <= SUBSET_VERSION_MAX_RANGE_DAYS * 24 * 60 * 60 * 1000;
 }
killedBy: renders the subset-version dropdown with All plus the fetched versions
statusReason: expected [] to have a length of 4 but got +0

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ArithmeticOperator
src/utilities/time.ts:54:24
  */
 export function isWithinSubsetVersionMaxRange(start: string, end: string) {
   const durationMs = new Date(end).getTime() - new Date(start).getTime();
-  return durationMs <= SUBSET_VERSION_MAX_RANGE_DAYS * 24 * 60 * 60 * 1000;
+  return durationMs <= SUBSET_VERSION_MAX_RANGE_DAYS * 24 * 60 * 60 / 1000;
 }
 
killedBy: renders the subset-version dropdown with All plus the fetched versions
statusReason: expected [] to have a length of 4 but got +0

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ArithmeticOperator
src/utilities/time.ts:54:24
  */
 export function isWithinSubsetVersionMaxRange(start: string, end: string) {
   const durationMs = new Date(end).getTime() - new Date(start).getTime();
-  return durationMs <= SUBSET_VERSION_MAX_RANGE_DAYS * 24 * 60 * 60 * 1000;
+  return durationMs <= SUBSET_VERSION_MAX_RANGE_DAYS * 24 * 60 / 60 * 1000;
 }
 
killedBy: renders the subset-version dropdown with All plus the fetched versions
statusReason: expected [] to have a length of 4 but got +0

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div
